[{"id":"1331292012930007152","channel_id":"1331153382278172755","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"‎ \nAbove all else, I find meditation is really good for grounding yourself and moving away from mental red herrings, and in my summation, meditation is essentially just being physically and mentally \"still\", as in, just giving yourself the task to observe or be aware of experience. The reason this seems to work is that it puts the recursive aspect (the controller/perceiver) which is always trying to control or manipulate experience in the backseat. You also have to naturally meditate in order to fall asleep, as it requires you to be still physically and not engage with your thoughts. The reason meditation works well is because you quickly realize that the thoughts you're having are very transient (time-based) and that they go away by themselves pretty quickly, and this is important because it only leaves what is essential to your present experience. You can do away with the ideas and theories and abide in silence, if you want. Often our knowledge seems important in the moment, but meditation essentially \"sweeps it away\" and leaves you back at only what is intrinsic and non-assumptive. It allows the sand in the water to settle, so to speak. If you're worried that you're gonna mess something up by not thinking or theorizing, then clearly that thing is not intrinsic to your experience of yourself, so toss it away. Get rid of all that is transient, and stay with what is present, intrinsic, and essential. That is basically what meditation is about, and it will probably make more sense the more it happens in your own experience.","timestamp":"2025-01-21T15:59:10.092000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"_diaso_"},{"id":"1331291789855948875","channel_id":"1331153382278172755","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think it's important to see that what is being pointed to isn't any explicit knowledge or something gained over time, it's about regressing backwards from a belief about your experience of yourself.\n\nYou don't gain knowledge from losing a belief, or losing anything for that matter. If a non-believer of Santa comes up to you and starts questioning your belief in Santa, it's not that they know something you don't about Santa or whatever else, it's more that they're just doing the best they can with their tool of language and communication to describe what is already the case; that there is no Santa. \n\nIt's less like learning about something, and more like going \"wait I have no idea why I was even doing that this entire time lol\". Like, ***stopping*** the learning*** completely***. I don't have to learn about myself anymore because I'm always myself, duh. Myself can't learn about myself, that makes two; it's recursive. The entire equation or desire to learn about myself is an error because it's based on a recursion of myself.","timestamp":"2025-01-21T15:58:16.907000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"_diaso_"}]