[{"id":"1331742616521408593","channel_id":"1329476495587934300","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> If I think about a random guy giving the presentation and embarrassing himself, there is no emotional attachment to the thinking because I recognize that the random guy is not me and is just a thought. Now, let’s replace the random guy with “me”. Now it feels different because I think the person the experience is happening to is actually who I am, or it might be, so I feel emotionally attached to the experience. Because of this, I want to try hard to avoid this hypothetical situation, which causes me to worry.\n\nEmbarrassment has always been a hypothetical situation through and through.\n\nMy straightforward and practical advice is to just start an inquiry about what you think actually ***causes*** embarassment. Like \"what is the cause of my embarassment?\" I believe that by doing this you will essentially run into a web of assumptions about yourself which don't actually land at anything conclusive, and it will probably be helpful to bring that to the limelight.\n\nExperiences don't happen to people or things, and emotions don't attach to experiences, as if they are separate, it's all simultaneous to each other. So anything you believe causes the other is a superfluous separation created through time/thought/assumption. This separative \"recursion\" ***is*** embarrassment and it is an \"afterthought\" on behalf of the initial event. You believe you have located a cause for embarrassment (in the initial event), but experience can't be caused by something other than itself because that would make for two experiences.","timestamp":"2025-01-22T21:49:42.360000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"233007836429418496","username":"hunter221","avatar":"0fbda587679ccbdff20f31ec1cd9847f","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"Hunter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1329476495587934300","message_id":"1329476495587934300","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"_diaso_"}]