[{"id":"1303136342846472304","channel_id":"1302005810552897606","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"***Isn’t the crux realizing that you are experiencing life constantly through “two cameras,” which consist of “me” and self-image?***\n\nYou are both cameras. One of the cameras is unnecessary because it claims that it is separate from you, when it isn't. In the present experience, everything happens together all at ***once***, not separately. The second camera creates the appearance that there is a version of you separate from your current self which has experienced the past and future. That is the separate self, which is the belief, which is self-image, which has to be examined. There isn't two of you, there's only the current you, viewing everything which is current, including any cameras.\n\n\n***Just to explain, it’s like, “Why do I think xy...?” and then, after thinking about it for a while, I’m just like, “I don’t know.” By that point, I can only make assumptions where I don’t know if they’re actually true, and doing that feels pretty pointless. And asking myself what self-image is, feels pointless too  because I already know what it is intellectually. So why do I have to ask myself that, if I will just give the same answer as always?***\n\nYou can't really know what self-image is, because it's a belief. It's made out of nothing. It's not there. Self-image is what you think about yourself that doesn't actually exist.  \n\nIf you or someone has a belief, you don't just say \"oh I know what beliefs already are\" because that doesn't actually make contact with the belief. If you ask someone whether they know what a belief is, they will give you a perfect definition, yet despite that they still have beliefs. That's because the definition of a belief is not a belief. Just like the definition of an apple isn't an apple. You have to actually bring up what the word \"belief\" or \"self-image\" points to. You have to directly bring up what you think you are, ***that ***is self-image, because it doesn't exist and so it is a belief, and so you must question it.","timestamp":"2024-11-04T23:18:35.237000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302005810552897606","message_id":"1303080645848993884","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"_diaso_"},{"id":"1302068320257704078","channel_id":"1302005810552897606","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There isn't someone separate from self-image affected by self-image which denotes someone that has \"my self-image\". What you think you are ***is*** self-image. When you say \"it's because of my self-image\", whose self-image are you talking about, which is separate from the self-image? That entire thought is self-image, because it refers back to your previous thought which is also self-image. It's the separate \"me\" that is dealing with all of these thoughts which is self-image. \"**My** self-image\", \"**my** thoughts\", etc.\n\nFirst and foremost, the self-image is a belief. There isn't a way to get rid of it because it already doesn't exist, there is only realizing that it already isn't there and that you are mistaking your thoughts for yourself. In the same way how there is no way to get rid of Santa Claus, there is only realizing that he isn't in your experience already. It's already the case. It's already inherent to your experience.\n\nAs long as you can ask questions, you can inquire. If you feel stuck, ask a question about where you're stuck. Who or what has a self-image? What is a self-image? You can gain more insights just by asking more questions. You're only stuck if you stop asking questions because you have some belief stopping you from asking more questions, like \"I'm stuck\".\n\nYou are creating a \"circle\" because you're putting a label on the initial thought without inspecting it. It's like if I'm worried about the future, and then I say \"the reason I'm worried is because the future is self-image\". It's tautological and all it does is point back to the initial thought.","timestamp":"2024-11-02T00:34:38.809000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302005810552897606","message_id":"1302005810552897606","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"_diaso_"}]