[{"id":"1258966433467990048","channel_id":"1258635899315556415","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@wtfaustin (forgot to tag reply)","timestamp":"2024-07-06T02:03:08.204000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":12,"userName":"_diaso_"},{"id":"1258962668883283978","channel_id":"1258635899315556415","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"‎\nYou are specifically focusing on your minds ability to divide reality, which is the ability to describe things. The separative faculty of your mind. That is how you are creating your self-image, and that is akin to reading a thesaurus in real time. A thesaurus describes divisions, and so does your mind. \n\nAlthough there can be very profound emotions, experiences, and insights, the actual realization itself is very simple and succinct and doesn't take much complexity. It's kind of like if you were living your entire life with a book in your hand called \"my life\", and then you forgot you were reading it. Then all of a sudden you realize \"wait, why am I reading this book on my life, when I am my life?\" and then just closing the book. It makes life much easier and much less confusing, but everything stays the same more or less.","timestamp":"2024-07-06T01:48:10.657000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":11,"userName":"_diaso_"},{"id":"1258962344214790224","channel_id":"1258635899315556415","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"‎\nAlso pay attention to the chronological limitation of reality, which is that everything must occur now. \"Past\" and \"future\" are like scaffoldings which ***always*** must be built on top of now. There is no such thing as a past while being in a past, or a future while being in a future. All concepts of time ***must*** be relative to now. So then, who does knowledge about past and future apply to?\n\nThe way it happened for me was that I basically realized that there is no actual difference between reading and imagining my life. Both are the exact same mental function of describing and imagining. You have to read now, and you have to describe now, and you have to think now. When you think about yourself, you are entirely limited to manmade words and definitions. It's like you're trying to find your life in a thesaurus. The only way for you to describe your life is by using the words in the thesaurus because all descriptions are words. You can't describe yourself without words. Your description of yourself is a manmade invention, it is just a bunch of definitions and words you pull out of a thesaurus. \"Future\", \"past\", etc, are just words and definitions that your mind reads in real time. You are the one reading, you aren't inside of what you are reading. You aren't inside of definitions, you are reading definitions. The reason why words don't point to anything outside of themselves is because they are always presently imagined, in the same way a thesaurus is always presently read. The words don't exist now, never will, because humans made it up through their ability to imagine. You don't experience definitions any time other than now, it's now or never. It doesn't matter how it defines itself, whether it says it is in past, future, tomorrow, etc, you have to describe it ***now.***","timestamp":"2024-07-06T01:46:53.250000+00:00","edited_timestamp":"2024-07-06T01:49:32.444000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":10,"userName":"_diaso_"},{"id":"1258962181291118734","channel_id":"1258635899315556415","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Get really good at watching your thoughts appear and disappear in whatever capacity. What does it look like for a thought to disappear? What does it feel like?\n\nReally focus on your minds capacity to describe things. What is it describing? How is it describing? What is a description? Can I describe something without thinking? etc.\n\nJust take notice of this innate capability of your mind, which is that it appears as things and then stops appearing as them. And also notice that your emotions appear and disappear alongside them. The cause of the emotion is not what the thought is describing, it is how the thought feels currently. \"Tomorrow\" can't cause emotions, because emotions happen now. You stop feeling the thought when you stop thinking it, because you are turning the thought into an object, like a hot stove, and thus you will stop feeling it once you let go of the thought. The thought isn't really an object, but because you have that belief operating (that you can imagine objects), the emotion literally vanishes alongside the thought. Observing this in real time could be a very significant thing to witness, and it was a big part of how my thoughts loosened up in my own inquiry.\n\nIf you pay attention to this \"gap\" in thoughts you will naturally become disillusioned over time. I personally spent time watching my thoughts appear and disappear in the dark just because I was so fascinated by the fact that my mind was just creating things out of thin air. Doing this in a pitch black room is good because it removes visual stimuli that your mind can objectify. This is why people make you close your eyes during meditation, but a dark room is even better IMO. This is essentially what meditation is.","timestamp":"2024-07-06T01:46:14.406000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":9,"userName":"_diaso_"}]