[{"id":"1306498259698843658","channel_id":"1306487055987245167","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Every instance of self-image is a recursion. Which is to say, it is creating two of you. This is also referred to as the subject-object relationship. This is fundamentally the idea that it requires two things to perceive something. A thinker and a thought, an experiencer and an experience, a perceiver and perception, etc. etc. \n\nThis creates a paradox which must be examined, because the perceiver or separate aspect would also have to be perceived somehow.\n\nThis separate aspect is the self-image, which can't ever actually be perceived; it was never really there, you just assumed it was.\n\nThis creates a residual separate entity (self-image) that seems to hide behind all our thoughts and perceptions even though it isn't actually there, and we end up worrying about this separate self everytime we think because we are recognizing it is there through our thinking, like recognizing ourselves in the reflection of a mirror. For example, you can think \"I am separate from thoughts\", but that entire sentence is a thought, and so there is no actual thinker outside of it or separate from it. The \"I\" (perceiver) which it refers to is nowhere to be found, because it only exists as the thought (perception).\n\nAs a more practical example, thinking about the future doesn't denote someone that has to worry about the future, the person who experiences the future does not exist outside of the thought of the future. The thinker is the thought. If you believe that you are worried about the future, then in actuality you are effectively thinking of someone that is thinking and then emotionally reacting to that. This is the recursion again.\n\nThere is no thinker, thus there is no one that has to deal with or worry about any of your thoughts or what they are describing. It only seems like there is a thinker once you start thinking of one, but that is obviously not a thinker, it is just another thought which is describing a thinker. All thoughts are made of descriptions/words/divisions.\n\nThese recursive contradictions will continue to pop up in your thoughts because you feel that the separate entity is relevant, until it is recognized that the separate entity isn't actually there.\n\nThe key is that you are already observing the fact. Why do you think you aren't? Bring up all the beliefs that say you aren't so that you can question them properly. Those beliefs really aren't there. Only the present occurrence is. There isn't a separate thinker and Santa Claus isn't coming to town, so why do you keep recognizing yourself in those thoughts? \n\nYou want to stick to what is already inherent and present in your experience, anything that requires time or effort to reach somewhere is not inherent to your experience, and thus it is irrelevant, let go of it. Observe what is presently and already the case.","timestamp":"2024-11-14T05:57:38.676000+00:00","edited_timestamp":"2024-11-14T06:37:53.289000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1306487055987245167","message_id":"1306487055987245167","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"_diaso_"}]