[{"id":"1351257836046258237","channel_id":"1347386199072968705","author":{"id":"478359517181247490","username":"_diaso_","avatar":"66de051aedb999eec8e4233c11afd878","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Diaso","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> I don’t understand the difference between this image and my image/memory of other people (which is necessary because I do not have others memory). \n\nDifferences can't be understood by anyone or anything because understanding something is itself a relationship which requires two different entities (something that understands another thing, which makes a difference of two things). Which is to say, the idea of understanding another thing is itself a difference which requires another thing to be different from the \"understander\" that can then be understood. It's a subject-object relationship, exactly like the \"knower-known\" relationship where it seems there is a knower separate from what is known but both depend on each other because they are actually the same thing.\n\nThere's nothing which is other than difference to understand what a difference is. Meaning, something that understands another thing is itself a difference (it's different from what is understood).\n\nThere's no real \"answer\" other than seeing the nature of the distinctions that your mind makes up. A difference (subject) can't understand a difference (object), because it assumes there is something other than both of the differences (subject-object) which can be understood or isn't understood yet.\n\nYour inability to \"know what you have to do\" among other listed mental scenarios hints at what you actually are, which is not separate. As in, no one actually knows what they have to do because there isn't a separate knower-known relationship to begin with. Just like no one ever knows the future precisely because they are always present (unseparated).","timestamp":"2025-03-17T18:16:13.270000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1347386199072968705","message_id":"1347386199072968705","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"_diaso_"}]