[{"id":"1395869628860862636","channel_id":"1386808875260448848","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*The human organism that we are exists in real life, that is us, and if it has undesirable qualities we should seek to change them as we recognize them.* \n\nSure to the second part, but imagine you were a plant saying the same thing how weird that would sound. The plant saying \"oh god it's so dark in here, I hate how I've found myself in such a dark, wet state, I need to fix this\". Then it grows roots and leaves the soil. Then it says \"oh god I'm like, bare naked and feel so small and insignificant, I better grow some leaves or something\" then it does that. Then it looks at a tree and says \"wow, what a big and impressive tree, I am still so small and insignificant but I can overcome this\" then it grows a bit more and continues this cycle of thought/growth/movement. \n\n*Your knowledge and thinking try their best to match reality, they are limited, so sometimes funky stuff occurs when your thoughts don't properly map to reality and there is a abrupt corrective process in response to new information that fixes that mapping.*\n\nThe above is happening to the plant also and is the same process you've described. The plant identifies as \"Me\" and is then emotionally and physically reacting to what it perceives as new information about \"Me\". \n\n*This is why it makes sense to me to respond to new information about \"me\"  and emotionally react to it.*\n\nIt might appear to make sense but it is unnecessary struggle, just like the plant. The plant doesn't need to emotionally react to new information it just automatically reacts intelligently to what externally happens to it, there is no need for emotional relationship to its imagination of what it is. Human beings naturally operate identically to this and is what is experienced without a self-image.","timestamp":"2025-07-18T20:47:33.524000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1386808875260448848","message_id":"1386808875260448848","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]