[{"id":"1287550201434734593","channel_id":"1287514284925911121","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What I'm absolutely certain about is that it's available to everyone because it really is as simple as the cessation of an invented belief. The physiological change in thought and emotional processing as a byproduct is also both automatic and very intuitive when it occurs and absolutely not exclusive to anyone or a certain type of brain. What I would say though is it is possibly the case that some people may not ever untangle the core belief in a self-concept just because of a lack of interest, not seeing why it is important, or because the way it is being communicated by others they are not able to understand what it is or how it relates to them. In the same way if someone said \"I have really strong identification with my Christian values\", depending on how nuanced and rooted those beliefs are, they might simply not be open to any communication from others of how they are not necessary at all for perfect emotional and intelligent function. Even if they are open, they might simply not comprehend that they are invented beliefs and not something that directly points at what they think is the truth. It is of course very obvious to someone who is not at all religious - or from another religion - that this person's beliefs are inherited/conditioned and not necessary at all for moral guidance.\n\nIt is a neuro-physiological phenomenon, but it has nothing to do with an alteration of your physical brain structure like a lobotomy or enabling/disabling function. It's analogous to transferring the files from an sd card to a hard drive, then forgetting your whole life to delete the contents of the sd card and trying to constantly manage the files on both the sd card and hard drive at the same time without realizing what you're doing. If you just broke the sd card, you would damage the function of the system, but if you realized you had already copied the files, you would think \"oh shit I better delete the files on the sd card to free up space\" This is just done automatically by your brain the moment you become aware the files on the sd card aren't needed at all. \n\nWhat you subjectively realize is that  since you first remember, you have been trying to imagine your own life in the same way you try to imagine other people's lives, but you don't need to do that because you already have your own memory and experience. It is like realizing your game is running poorly because you accidentally launched the client twice and the moment you become aware of it your brain/computer automatically close the second client and is like \"lol oops\". That is the physically felt change in your brain that I described like the popping toy. The felt change in electrical activity in the brain that lasts for a little while is from trying to access the second client like before, and because it's not open anymore, it automatically redirects and strengthens the signal to the primary client. \n\nA similar thing happens at a much smaller scale whenever you have any large project or objective and suddenly new information instantly changes the entire trajectory of that endeavour. Someone finally texting you back with a positive response, getting a new job, winning the lottery, or someone dying, getting fired etc. are all small examples of your brain literally adjusting itself and changing the thoughts/emotions you are looping on, you just don't physically feel it other than as emotions or new thoughts because it's the reconfiguration of our beliefs rather than the removal of them. Self realization is just more significant because there isn't a more significant \"project\" that people build up in their mind than their beliefs about their own life.","timestamp":"2024-09-22T23:04:49.548000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287514284925911121","message_id":"1287534185032192020","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1287531104143937536","channel_id":"1287514284925911121","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean my general impression is that pretty much everything they're saying is just their speculation and comes off to me like a very obscure high school presentation on someone's niche interest. They don't seem to be talking from a self-realized perspective as what they're describing about non-duality and living without self/speaking from the source is all just speculation and belief on their behalf as pretty much none of it tracks. The implication that the pursuit of SR is futile and a result of \"left brain/right brain\" is absolute nonsense. As far as I'm aware even in just regular neuroscience the idea of \"left brain/right brain creative/analytical stuff\" has never even been a thing in the way people in pop-psychology think it is. As far as I'm aware it's like saying \"Type A/B personality\" which is just an arbitrary categorization of a cluster of behaviours some people might have. Each part of your brain has specific function and the hemispheric separation is not really relevant to many things other than where specific parts of the brain happen to be and how they connect to other parts.\n\nSelf-realization is synonymous with the cessation of our self-image, and is no different than no longer believing in Santa Claus. It is only rare because it is easy to figure out that Santa Claus doesn't exist, but very difficult to realize that your self-concept doesn't exist because it really, really seems like when we think about ourselves, that thing we are thinking about *must* be in somehow connected to ourselves despite it not being the case. Self realization isn't something you add to yourself or the result of a particular part of your brain being overcome or nullified, it is a belief that is completely removed without replacement, as the belief was invented and built upon from a very young age, it isn't something to do with the physical hardware of your brain, but how it is being used. \n\nNon duality is not sourced from a hemisphere in the brain, it is not \"created\", a duality or plurality is created by thought which is invented in the brain wherever thought/memory operates which isn't really very important but something you could check if you wanted. What we are experiencing is a singular \"signal\" we call consciousness that is experienced in the present and that is all there is. Like a simulation being rendered all at one instant. Duality is called duality because it is the invention of \"Me\" who lives \"in the world\" and we view them as separates entities. It is the division of conscious experience into more than one part. This then creates an illusion of \"my past and future\" which results in an unlimited number of separate possible realities/lives that *may* occur. If this ends, there is then the perception that everything is exactly as it is and no other state is possible, and *that* is what non-duality is. You can't simultaneously experience duality and non-duality because you can't simultaneously believe there is one thing but also believe there is more than one thing. The belief there is one thing *and* more than one thing is itself the belief there is more than one thing.","timestamp":"2024-09-22T21:48:56.399000+00:00","edited_timestamp":"2024-09-22T21:57:04.599000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287514284925911121","message_id":"1287514284925911121","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]