[{"id":"1306336757632991252","channel_id":"1289542528798035978","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If there is a desired outcome, then there is an effort to control or influence others for our own gain. Our own gain in this context being the creation of what we want. Whether it is just wanting \"to make a good impression\" or something more neurotic, they are both self-image. It is harmful to put others down in order to appear tough or competent, but it is also harmful to be overly cheery and obsequious towards others as well. The former is easy to see for most people, but the latter is just as harmful to both parties but outwardly polite. \n\nI like the example of vanity, in that it is vain for someone to brag about how great they are because they are trying to impress people. We all know this and it annoys almost everyone. What most people are under the mistaken impression of however is thinking that humility is \"underplaying your achievements\" and good. This isn't humility, it is also vanity because the person is intentionally downplaying their achievement in order to try to get you to have a heightened impression of them. It is *also* vain to shoot it straight down the middle in order to *fit in* because again, you are trying to control an outcome and create a false impression. The only way to not be vain is when there is genuinely no anticipation of an outcome, and only your best effort to act intelligently in the moment as it is occurring. As in you are directly responding to the situation itself. This is the genuine expression of your personality in context, which you do your best to accomplish using your intelligence. It's hard to communicate this directly, but one way this is commonly experienced is when you are \"having fun\". This means there is no actual behaviour that is vain or not, only an intent behind it that the person is generating. In the same way, you don't need to concern yourself with what other people think, you only need to concern yourself with your direct communication with them in the moment and respond dynamically to what is occurring. \n\nIt is neither good nor bad to give to a homeless person, and it is neither good nor bad to talk like Conor McGregor hyping himself up for a fight. The only thing that is harmful is what is occurring to you psychologically when you act that way. This also resolves acting in ways that harm others, because without desire for outcome, when you make a mistake that bothers someone, they communicate that to you in words or body language and you can immediately adjust.","timestamp":"2024-11-13T19:15:53.583000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1289542528798035978","message_id":"1302062326035251313","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1298615228476686336","channel_id":"1289542528798035978","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is fine to try to do your best for others and hope that they will reciprocate to you. It is harmful to think that you must behave in a certain way to manipulate or get certain behaviour out of others. \n\nIf you behave in any way to \"get something out of others\" it is always a misunderstanding of what you actually want and mis-guided.","timestamp":"2024-10-23T11:53:17.573000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1289542528798035978","message_id":"1298439475776589885","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1292730220906025011","channel_id":"1289542528798035978","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*I feel really offended because someone assumed that my actions had vain intentions when they didn’t.*\n\nThis is always ego/self-image. It isn't a problem, just something to observe. If you are concerned with how someone else views you, which is ultimately \"how other people see me affects how I think about myself\" it is self-image. \n\nNot trying to lay anything on, but it is analogous to the feeling of injustice some people feel when they think they are smart and then someone else thinks they are an idiot. There is a feeling of injustice because \"I am not an idiot but they think I am!\"\n\nIn either case what is the problem? The problem is the desire for other people to think highly of us. We masquerade behind the idea of \"well, I don't want them to think highly of me, I want them to think *accurately* of me\" but it doesn't make a difference. How do you know that your own idea of yourself is even accurate in the first place? You are ultimately asking all other people to think of you exactly the way you think of yourself, and is that even correct itself? \n\nThere is nothing you can do to control other people's thoughts or ideas of you and it makes no difference if they think highly or lowly of you because the fact remains the same either way. \n\nIf you want to take it from a different angle, the reason that we want other's to think accurately or highly of us is because we want to get something out of other people. If we don't want anything from others, then there is absolutely no desire to control their opinion.","timestamp":"2024-10-07T06:08:22.430000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"880303042153562172","username":"mando3305","avatar":"28c91456ff1394b736aa5b8e9f23f05d","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"Sebastian","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1289542528798035978","message_id":"1289542528798035978","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]