[{"id":"1260347187192397824","channel_id":"1259571646356783197","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It translates to the cessation of emotion relationship to self-imagination because there is an automatic understanding that any thought about your past or future cannot in any way have a relationship to your present experience. For example, instead of counting numbers, lets say that each number we're counting represents a thought. Most people will go \"thought 5, thought 6, thought 7, oh god, remember when thought 1 happened back when I was a kid? That was so sad I hope I never experience that again, anyway, gotta get over that, so back to it. Thought 8...\", when in reality that tangent was itself thought 8, and now you're actually on thought 9. The belief we have time travelled to a traumatic past experience or time travelled to a future bad outcome outside of the ever-present counting of present thoughts are both misunderstandings of how thinking and the counting analogy actually work.","timestamp":"2024-07-09T21:29:45.545000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"776884386372255755","username":"q__c_","avatar":"9da34bdb46f23c4e74ef91e6b87fde84","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Q-C","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259571646356783197","message_id":"1259863663217737828","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1259801662462361651","channel_id":"1259571646356783197","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Take the example of a weather report. A weather report is a model that has a bunch of data/measurements stored on a hard drive. The hard drive's data contains every single weather measurement up until now. A model then accesses that hard-drive for data, and then extrapolates that data according to the model to produce a prediction of future likely measurements of the weather it calls \"tomorrow\" or \"next week\". \n\nThis is almost exactly how your brain and intelligence works with your memory. What has to be recognized in the weather report is two things: \n\n1. What we call \"the past\" is actually the present state of the hard drive. The hard drive is a physical object with configuration that produces a signal. Your brain's memory is exactly the same. It isn't accessing anything from the past, it is an object in the present with certain configuration that enables to produce certain thoughts/information.\n\n2. What also has to be recognized is that it doesn't matter if a weather report is correct about the future weather, it never predicts the future at all, it models the present. It could never know the future nor predict it, it just extrapolated its present stored data into another pieced of present stored data that we call \"the future\". Neither the past nor the future are real, they are both stored data/models that exist in the present. In the case of a weather report, both the past and future are just excel spreadsheets that exist in the present and thought works the same way.\n\nThe reason we struggle with \"living in the present\" in our lives is because we haven't realized that everything we experience is that. We haven't realized that just because we acquired certain memories in certain orders, and so they are somewhat accurately labelled that way in our memory, that, just like a hard drive on a computer, is *just the present physical state of the storage device* and that when you imagine \"the future\" just because something that you predicted roughly happens doesn't mean you ever predicted the future, you just modeled the present probabilistically. \n\nThe reason this is extremely important to actually perceive in your subjective experience as true is because it means your brain never needs to worry about past or future at all, because it is entirely resolved just by paying attention to what is immediately happening. The example I like is if you just start counting \"1, 2, 3, 4, 5\" you don't need to remember the previous numbers you've counted or worry about missing any numbers in the future, becuase when you say \"127\", included in that information is the knowledge \"yeah I must have counted 122 because that's before 127\" and \"I'm not at 1000 yet because that's after\". \n\nPsychologically this resolves neurotic emotions related to past and future because you don't think \"oh shit, is it gonna be heads or tails in the future? I'm really worried if it's tails and really excited if it's heads!\" you just see \"they haven't flipped the coin yet\" and so there is no emotional reaction to an imagined but obviously unreal outcome.","timestamp":"2024-07-08T09:22:02.314000+00:00","edited_timestamp":"2024-07-08T09:31:57.203000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259571646356783197","message_id":"1259571646356783197","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]