[{"id":"1316671722614816789","channel_id":"1313987562683236392","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not exactly easy to communicate it head on, I guess the main point of delineating self-image from genuine immediate perception is to start teasing out a wedge between two distinct structures. This happened coincidentally for me where my imagined self-identity sort of \"lagged\" what was happening to me in the moment in such a way that made me think \"everything about how I conceptualize my life has to be wrong somehow this makes no sense\". It's a bit like how when you play a racing game and your PR is like a ghost version of yourself that you race. If each time you play you are slightly faster or slightly slower, it appears that the ghost car is basically identical to yourself with only tiny differences and is sort of \"copying you\". Only if you completely crash your car or get way further ahead of it do you realize \"wait, what the fuck is that thing actually?\" \n\nI think over time some better drawings or analogies will spring to mind that would help. Even though this is pretty unrelated I think that using VR to help people realize their conscious experience is themselves with no temporal (past or future) component could help, but as of right now all I've really got is what my current experience is, the memory of what it used to be, and then trying to clarify the structural differences and experiential differences.","timestamp":"2024-12-12T07:43:21.249000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"880303042153562172","username":"mando3305","avatar":"28c91456ff1394b736aa5b8e9f23f05d","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"Sebastian","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1313987562683236392","message_id":"1313990804431437887","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"}]