[{"id":"1405157993007288340","channel_id":"1400598674504941659","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You experience fear when someone swings a sledgehammer at you because your immediate perception experiences danger and reacts to it. \n\nIf you are 2 years old and don't know that sledgehammers can hurt you then you might not react defensively. \n\nThese are your brain reacting to visual and physical stimulus from your vision/hearing/touch. Yes, your brain has maybe not yet understood a physical impact can harm you. It is about to learn that.\n\nWhat I am describing as all neuroticism and self-image/ego is emotional relationship to threats to our imagined self in thought. It's not supposed to be super technical, it is really intuitive and straightforward. \n\nIf I'm in visual radius and about to hack you down with a machete, you will be scared. This your visual perception interacting with memory to declare \"Danger!\"\n\nIf you are sitting in your room, feeling anxious about how you acted in your highshcool prom will affect your reputation, that is your emotional relationship towards your self-image. \n\nIf you want to dissect the difference between \"my highschool reputation\" and \"someone trying to murder me with a machete\" then I hope it's obvious it's pretty different, but there is enormous and important reality inbetween, just not this ridiculous dicohotomy.","timestamp":"2025-08-13T11:56:12.106000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1400598674504941659","message_id":"1400598674504941659","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"}]