[{"id":"1306314097243066419","channel_id":"1300951457142407188","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"\"I have noticed periods of seeming clarity where all my experience appears to happen in totality, where it's seamless. Only then does my confusion end and I can see thought for what it is.\" \n\nTry to observe the opposite, when does experience happen *partially*. Is it possible to partially experience something or is that only when you compare it to an imagined ideal in thought? How can you tell an experience is complete or partial?\n\nIf you look at any other person or any animal, does it make sense to say \"oh, that dog is only partially experiencing right now\"? or is it always experiencing everything in totality? What you are trying to do is understand the origin of your confusion, which is in the content of thought, and to step back and observe that this process engages as a result of the human brain's capacity to reason, and thought occurs as part of your conscious experience. \n\nFor example, if I listen to someone speaking Japanese, I'm sitting there thinking \"I have no idea about the content of what they are saying\" There is no confusion, I just don't know what they are saying. If however, you are listening to someone say something very complex in English, you might think \"damn, I just don't fucking understand what they are saying, I am so confused\". You are not trying to figure out your beliefs or thought process like it's the latter situation, but to realize that all of thought is like the former. No matter what form it takes or what it's about, it is always just a single stream being fed into conscious experience. The way we naturally compartmentalize all Japanese words as \"one thing that I don't understand\" rather than a few hundred thousand words with individual meaning is the same way thought operates, in that it is just instead \"one thing\" not \"nearly infinite things put together\".","timestamp":"2024-11-13T17:45:50.925000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1300951457142407188","message_id":"1300951457142407188","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]