[{"id":"1328195666182410301","channel_id":"1322236010049835049","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You're getting lost in the philosophy of the whole thing and missing the root of misunderstanding, which is what is the agent you refer to as \"Me\" that does the operation? On the surface, yes, you are the only entity who has the agency to move your hand, in contrast I can only move my hand and not yours. We refer to the capacity to do this operation as \"Me\". Philosophically it creates two separate objects which would be \"Me\" and \"You\". This is relevant and important to categorize and make separate ideas for the sake of thought/communication. The point is to actually examine what \"Me\" the object is. While we presume it is a whole host of things, it is much more like the number 0, in that it is useful in calculation, it exists in thought and abstraction, but it actually doesn't exist as an object. \n\nUsually people into spirituality, meditation, or any of this kind of stuff continue to misunderstand themselves as \"point conciousness\" or what is essentially the 0.0. coordinate on a graph. They imagine the \"Me\" is the centre point from which everything emanates, and then they go to find it and characterize it in thought. The point of the search however is to realize that it does not in fact exist. You can never find nothing itself like you cannot point to the single object that is \"Me\".","timestamp":"2025-01-13T02:55:23.500000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1322236010049835049","message_id":"1322236010049835049","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]