[{"id":"1296714578587287552","channel_id":"1262630927398600780","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You're struggling to comprehend it because you're imagining it's something it isn't hahaha. A lot of what you're describing is similar to \"How can someone who doesn't believe in the ten commandments just not go around stealing and committing adultery??\"\n\nThe reason self-realization and lack of emotional relationship to self-imagination can exist is because you don't need it to function perfectly. Absolutely everything that isn't *currently happening* is most effectively dealt with thought and planning without the distortion of anxiety, panic, or greed. If I have a date tomorrow, it is not helpful to be anxious about it, it is the most effective to just *think about what to do*. If something is not currently happening, then an absolutely neutral emotional state is the best canvas for thought to operate within to make a plan or idea. \n\nWith regards to something like sexually assaulting someone, you don't do that because the moment you make any unappreciated or untoward communication towards someone, they communicate displeasure at that and you will automatically feel bad in the moment in response to them, apologize, and pull away. That prevents the behaviour. If for some reason you got framed and put in jail for SA, then you would feel there was injustice and want to fight the case because this is not your preferred environment/outcome but there is no reason why emotionality is necessary at all. When you mention torture, that is physical pain and obviously something you would try to avoid. It is however not a problem unless it is happening. I would emphasize again that when I say self-realization is the operation without the use of a self-concept it is because what you are currently calling a self-concept is *not yourself* you just believe it is and that is what causes emotional relationship to it. \n\nIt is similar to someone saying \"being an atheist or agnostic is acting morally without the ten commandments\" and someone says \"so you're fine with raping and stealing?\" and it's like no, the point is that the morals don't actually exist in the scripture, they exist external to it in the human beings and the scripture is about underlying human nature.\n\nWant plays out in the form of automatic preferences. At a micro level it is \"I like banana ice cream and not peppermint. I have no control over this it is my preference\". At a macro level it is putting a seed into the ground and it grows into a tree because it constantly acts out preferred action that turns it into a tree that is related to its individual genetic structure. Humans are the same way, in that I like doing the things I like doing because it's in my physical character. Some people like making music, others like writing or thinking, and others like animals or trains, etc. If you ever look back at your life chronologically, you'll notice that everything kinda \"ties together\" and while we mistakenly say \"yeah cause I learned from my experiences and did xyz\" it's really because it all is just \"you doing what you naturally want to do\" as it's written into your character. \n\nRegarding want: there are no things I want for myself, there are only things I want to have in order to let me do another thing I want to do to act out my preferences. There is no feeling of lack compelling behaviour, it is analogous to looking at a menu and automatically filtering out the 90% of things you definitely don't want, and then weighing and measuring and trying out the other 10% to figure out what's perfect for you. \n\nYou don't view your life as a movie, the best analogy I would give is you realize it's basically an open-world rail-shooter. That sounds like an oxymoron but it isn't at all. You can hypothetically do anything, which is the open-world, but the decisions you make are limited to what you subjectively think is a good idea, which is the rails, and subject to your innate character/nature.","timestamp":"2024-10-18T06:00:47.327000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1262630927398600780","message_id":"1296683334092722207","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"},{"id":"1292713539324219405","channel_id":"1262630927398600780","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"To emphasize, there is no change in capacity of thought, there is just a different understanding and automatic emotional relationship to it. \n\nI think the biggest difficulty is always the automatic demand for \"ok I understand that there may be a different way of relating to your thoughts, *how do I do it?*\" and while that is intuitive it's not the right angle. \n\nThe way that a self-realized person relates to their thoughts about themselves and their thoughts about the \"past\" and \"future\" is analogous to how anyone relates to the possible past and future events of a video game character they are playing in an RPG right now. If you are playing Zelda or Space Marine 2, when the story takes a twist and they say \"new assignment marine, you are going to war now\", you the player don't give a shit at all, it's just a video game and even though your character is now in a life or death situation that drastically changes the state of affairs of his life, *you* are not effected because you are not in the game, you're just playing it. The NPC's in the game could say or do literally anything to your character and you would not care because there is automatic knowing that your character in the game is controlled by you, but is not you. Self-realization is not that ethereal, but it is analogous because it's not about \"how do I stop feeling so concerned about myself\" it is recognizing and realizing why there is no reason or cause for it in the first place. The main concern is reconciling how you experience time and how it relates to thought, and from there you can see \"oh, it actually doesn't matter what I think about my life at all\". \n\nIn brief what has to be resolve isn't a new way of looking at things or a new approach to thinking, but a recognition that the current method of analyzing and thinking about our lives is not just pointless, but only distortionary and harmful. Seeing why this must be the case causes your brain to instantly and automatically stop doing it.","timestamp":"2024-10-07T05:02:05.231000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1262630927398600780","message_id":"1287659352005541939","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1287504789625897038","channel_id":"1262630927398600780","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think what is being missed is that you don't need to have an intellectual identification with your body to respond to signals of pain, touch, sight, smell, sound, etc. \n\nWhen you touch a fire with your hand and it really hurts, you instantly pull your hand away and don't do it again. You don't consciously in any way need to identify \"this is my hand and it is hurt by fire\" in your mind, you directly relate to the sensory experience without concepts. \n\nWhat is typically misunderstood is that all thought about our experience comes *after* the sensory experience occurs to us. When you meet someone you are very attracted to, all you know is \"I really like this person\" and from that sensory experience you can then rationalize \"why I like this person\" but in no way does the reason come first, the sensation does.","timestamp":"2024-09-22T20:04:22.529000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1262630927398600780","message_id":"1281781984406011927","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1281342752197578784","channel_id":"1262630927398600780","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not fundamentally a jump, it's what is experienced all the time when you are not drawing a conclusion in thought about what you are or what your identity is. \n\nEssentially if you were a baby or animal that was incapable of complex thought/language, then *what would you call yourself?* You would not be able to verbalize or conceptualize \"I am a human baby\" or \"I am consciousness\" or some other object you have imagined. You would simply experience the signal generation of conscious experience and that is what you are. That is what you are anyway, we just add on another layer in thought by trying to turn that concept into an object and identify as it with other thoughts. This process and identification can completely end as it's not necessary. You don't need to think about yourself or identify as yourself, you are always yourself and experiencing yourself fully at all time.","timestamp":"2024-09-05T19:58:38.321000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1277537671777878049","channel_id":"1262630927398600780","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"While I am always a fan of being the boobs, the fundamental description of subjective first person experience is always \"that which I am aware of\". This has to be something we observe and identify as \"the only thing\" that we experience. \n\nThe identification with experiences is exactly what must be observed, as that is the only thing we experience. The question is then, what is that? What is experience itself? That observation leads us more deeply to \"Oh, it's all *just* this\".\n\nYou are not \"the boobs\", as in \"I am the physical object I am aware of\", you are the signal generated between the human organism and whatever it itself is aware of. \n\n\nreally dial things back and say \"Fuck, I have been existing since, well, my whole life...what am I actually experiencing?\"\n\n\nThat's the question of \"Me\" that has to be inquired into.","timestamp":"2024-08-26T07:58:36.454000+00:00","edited_timestamp":"2024-08-26T09:21:37.918000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]