[{"id":"1287507290143854697","channel_id":"1268571849663709224","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah no worries what you're saying makes sense don't stress about any questions or anything like that.\n\nThere is no emotional relationship to thinking in the way you've described and stories don't hold any emotional content. They remain interesting or not interesting depending on their novelty and value as information, which is what was inducing the emotion previously. People become sad or aspirational from stories because they are forced by the story to imagine a scenario they haven't thought of before and that creates an insight into their own beliefs and life situation that is helpful or makes them more understanding of something they weren't before. Because there is an emotional relationship to the idea of themself, this insight can be emotional because it dramatically changes who they think they are and how they think they should/should've acted. While it might sound like a good thing to be moved emotionally by stories, it only occurs because there is underlying stress/tension in that person and the story relieves it in some way. If there is no tension at all in the first place then a story is always just an entertaining or informative expression of creativity or ideas. A story can be beautiful or ugly, but not emotional. \n\nLike the idea of past or future, all stories are ideas and generated by thought. Whether it happened, didn't happen, will happen, or any characteristic, like someone telling you about their day it is all the expression of thought.","timestamp":"2024-09-22T20:14:18.699000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"576881852686663692","username":"kaelfm","avatar":"3492ae6670e3acc39401a2b93e5be9f7","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaine","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1268571849663709224","message_id":"1282375144693563614","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":13,"userName":"jamie0773"},{"id":"1281347490674769960","channel_id":"1268571849663709224","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is the complete cessation of emotional/psychological suffering. Certain negative emotions occur when necessary to indicate physical threats/danger and in response to another communicating you have hurt them, but other than that there is no emotional relationship to self-imagination or thinking/dreams. \n\nThis doesn't mean you can't think or express preferences. Personally I think it would be cool to be taller like you said, but if I see a tall person there is no envy or feeling of inferiority. In your public speaking example, it isn't self-image to think about your speaking performance and how you can improve it, it is your self-image as a structure in your brain that creates an emotional relationship to how you think you performed. Performance anxiety and sadness from the feeling you messed up or others are judging you harshly is your self-image being harmed, literally thinking about what you said or how to improve is just thinking. The error in self-understanding that causes the emotional relationship is caused by the belief that when you are thinking about how you performed you are *thinking about yourself* which you aren't, instead what is occurring is your actual self, in the present, is creating images in your mind right now that are being mistaken for yourself in the past.","timestamp":"2024-09-05T20:17:28.062000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"576881852686663692","username":"kaelfm","avatar":"3492ae6670e3acc39401a2b93e5be9f7","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaine","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1268571849663709224","message_id":"1274091678499606650","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"},{"id":"1281345758813225030","channel_id":"1268571849663709224","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The difference is the emotional relationship to what is perceived and contemplated in thought. When a person is imagining moving to a different country and how their life will be better, this is perceived as an altered future state of reality and an emotional reaction is generated in relationship to this perception. We immediately compare our present circumstance with this imagined future circumstance and feel a longing or desire to achieve it, which manifests as a displeasure with our current circumstance and an energy to change it which we call ambition. \n\nThe misunderstanding causing this ambition is that you are not contemplating the future or an altered state of reality, you are creating an image in present thought and mistaking it for an altered reality that currently doesn't exist. Your thoughts are real and do exist, but they are part of the present they are not something you can move towards or away from. With SR the emotional relationship stops permanently because it's not possible to imagine how to make your life better or worse because all imagination is produced by the present state of your brain and is not in the future or past. \n\nIn a practical sense you still enjoy making material improvements in your life, but there is no emotional relationship to it. There is instead a sensory want to create beauty and order which is essentially the function of intelligence, but no 'reason' to do things. You are never running away or changing your life, you are just acting out your preferences. \n\nIf you gave anyone 5 movies to choose between and they have to watch one, they will look at each poster and trailer and then be like \"yeah I want to watch this one\". It's the same non-emotional expression of preference for all things.","timestamp":"2024-09-05T20:10:35.154000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1268571849663709224","message_id":"1278238258979147890","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"},{"id":"1277534915730341920","channel_id":"1268571849663709224","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There is emotional relationship to thought when a thought causes another sense to re-activate and respond to what is now a circumstance that is perceived differently. \n\nThis is hard to describe, as it is genuinely very rare, but imagine a circumstance where you had coffee with a friend and discussed their relationship with their girlfriend. They said to you \"Yeah, I really love her, but I'm not sure she really loves me\". You then say \"yeah, well, I know this is really harsh, but I saw her the other day at xyz club and she made out with another guy. I think she's cheating on you\". \n\nYour friend then breaks up with them and says \"yeah, fuck dude, that was rough, but glad she's out of my life\". \n\nYou then realize that the person you saw making out with another guy wasn't actually his girlfriend, and you were completely wrong about the whole scenario. \n\n\nThis is a situation where the emotion of shame (I have harmed you) will occur in relationship to thought because the thought causes you to realize you have made a huge inaccuracy in what you wanted to communicate","timestamp":"2024-08-26T07:47:39.361000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"210575654524026880","username":"dimefox.","avatar":"11af762583dd387f7fcdc219e76efbf2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"dime","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1268571849663709224","message_id":"1272522235906752543","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1272427421827858575","channel_id":"1268571849663709224","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey thanks for the question. \n\nSelf-realization results in no emotional relationship to a self-concept. Once it occurs there is no effort or need to accept or fight any sort of insecurity, anxiety, or ambition it just doesn't arise. I think the most salient example is that there is no longer any emotional content to dreams, and while there are exceptions, just to get the theme across because there are particulars, 99% of the time there is no emotional relationship to thought either. \n\nThe insight that results in self-realization is not a form of knowledge like philosophy or psychology, so you don't get \"close to it\" or choose to accept or deny it, it is essentially undoing the knot of beliefs you have about your life, your identity, your past, your future, and then there isn't one anymore automatically. It isn't incremental, but all at once, in that there is either a knot or there isn't one. \n\nTake for example your ambition to move to a different country. There is nothing wrong with wanting to move somewhere else because you think your life would be better. That's no different than wanting to eat fish and chips instead of a burger. It's just an expression of personal preference and something you as an organism want to do and experience in your life right now. The misunderstanding is the structure of perceived past, future, and self-concept that creates the emotional discomfort which is \"my life would be better if I lived somewhere else\". The reason there is striving is because there is the comparison of a possible future state that is better than your current state, and an impatience, uncertainty, and discontent with arriving there.\n\nSelf-realization results in a cessation of this not through effort or acceptance, but through understanding that what you think you are contemplating (in this case the present and future condition of your life) has no relationship to what your life actually is. As a similar example, many people believe that they solved their loneliness by finding a good partner. This is not true. They solved their loneliness temporarily, by causing their desire for meaningful partnership to stop operating, because the conditions for its fulfillment are currently met. The actual, permanent solution to loneliness and attachment is realizing that it is a false self-concept that creates the feeling of insecurity when one does not have meaningful partnership, and the same structure applies to all form of emotional relationship to things we believe about our life and who we are.\n\nThe main point that you touched on is that the inquiry is resolving the fundamental question of what is that we subjectively experience as \"Me\" from birth to death, and what conscious experience is. Not as an object to be contemplated and communicated to other people, but what you experience and call \"Me\". The reason this inquiry is important is because the realization at the end of the tunnel results from realizing there is a foundational misunderstanding of how thought operates in our subjective experience and has falsely created a duplicate experience of emotional response to our imagination of ourselves.","timestamp":"2024-08-12T05:32:17.922000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"576881852686663692","username":"kaelfm","avatar":"3492ae6670e3acc39401a2b93e5be9f7","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaine","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1268571849663709224","message_id":"1268571849663709224","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]