[{"id":"1296746287592509451","channel_id":"1296417168312897628","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If it is one of my earlier videos you can take them with a grain of salt. The realization has always been the same but my communication wasn't. If it's in my longer essay video I wrote then that was my first attempt at \"getting it all out\" and I wouldn't change much from that, but before that the little bit I've said was pretty unrefined and off the cuff. \n\nAgain, can clarify if you want me to because I don't remember what I said at the time, but I probably said \"excited\" just as a means of causal speech at the time. Excited in what I think was probably the context meant \"an unexpected invitation to an event of my preference\" similar to someone saying \"hey, banana ice cream??\" and you're like \"bro wtf, yeah that's my favourite\". I didn't mean the actual emotional experience. \n\nIt might be relevant for me to also sort of say \"ok guys time out real quick\" and emphasize that my personality is still the same as it has always been, and so if we were to ever meet in person it wouldn't be out of place for me to be like \"yo, I'm super excited to hit up this restaurant, I heard they have the best Ramen in the city even though it's vegetarian, so obviously bullshit dude who paid for these reviews\" and that is just how I would talk casually (not dissing vegetarian food hit me with that miso ramen).","timestamp":"2024-10-18T08:06:47.343000+00:00","edited_timestamp":"2024-10-18T08:10:02.701000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1296417168312897628","message_id":"1296737439888572486","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":71,"userName":"jamie0773"},{"id":"1296726326719414292","channel_id":"1296417168312897628","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@arrryan0599 @hhwea @gamenightguy \nYeah in my experience it is an extremely difficult topic to bring up to anyone in real life unprompted without either hurting them and their beliefs if it lands, or causing them to worry about you if it doesn't, and I personally haven't done so in a long time. Hopefully other people have had better luck, but thematically it's so far away from the psychological Overton window that people automatically assume that if you are mentioning such things you must either be a bit odd or at your wit's end for solutions to a personal problem because they still see a lot of runway to their own problems in conventional self-improvement or knowledge. It isn't there, but you have to look yourself to know.\n\nTo your point, the unfortunate reality is that all forms of happiness that arise from \"good thoughts\" (nostalgia, longing, anticipation, pride, etc.) are the result of relief, not genuine love towards immediate experience. It is only possible to be nostalgic if there is a sense of sadness in comparison to our life today. It is only possible to hope for a better future if we are in some way dissatisfied with our present. It is only possible to proud of our achievement if we think we were insufficient before. There is no exception to this in positive affect related to our self-image, as it's caused by trying to experience love for our imagined self. This is not immediately obvious and probably wouldn't make sense if I were to communicate it to myself in the past, but it is the case. \n\nThere's been a lot of conversation in this thread already, so I'll just stick the original question, but I'm happy to respond to any of you guys. \n\nYes you are \"happier\" after self-realization because the only thing taken away is negative experience. There is no positive experience taken away other than illusory positive experience like the aforementioned. It would make most middle-class people happy to win the lottery, but this is only because they believe the money will resolve their suffering, it isn't because happiness exists in luxury or the vacations they are going to go on.\n\nAn analogy would be that your life before is like floating on a rough sea in your canoe, paddling along. Almost all of your day is spent trying to avoid the rough waves and move towards where it is calmer. This is obvious because you don't want to die to the harsh ocean, and so your life is primarily avoidance of the waves. Occasionally, you get to calm waters with just a little bit of wake, and you think you see something below the water and get really excited because you've never thought to look below the water before. After being fascinated by what's underneath you, quickly another swell arises and have in your mind \"I want to get to the calm again, so I can look under the water and see what that is\". This belief creates the culture of \"achievement\" which is to arrive at a location where the water is eternally calm and you can investigate the glimpse of something new you imagine awaits you.\n\nSelf-realization is not arriving where it is calm, it is the complete cessation of the waves no matter where you go. When there is absolute tranquility on the surface, then no matter where you go you can always see what's in the water. You partially knew this before, but not directly. You could say that self-realization allows the emergence of a sense of intuited and emotional \"depth\" to use the analogy. There is no emotional high from glimpsing under the surface anymore, but there is the possibility of diving in, metaphorically. \n\nPractically, before self-realization you are subjectively \"incomplete\". You aren't actually, but in your own experience there is a lack of wholeness or unity in experience that prevents directly putting your attention to things that are actually important to you, because many things that aren't actually important seem like they are.","timestamp":"2024-10-18T06:47:28.300000+00:00","edited_timestamp":"2024-10-18T06:51:19.659000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"328673677094682632","username":"hhwea","avatar":"e2b6daf30526bc4f6cc9fa7ba0e81ea5","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"hannah","avatar_decoration_data":{"asset":"a_f2267c3ad99c109859d15a592d7afe24","sku_id":"1458472704435945653","expires_at":null},"collectibles":{"nameplate":{"sku_id":"1382845914192023632","asset":"nameplates/nameplates_v3/aurora/","label":"COLLECTIBLES_NAMEPLATES_VOL_3_AURORA_A11Y","palette":"teal"}},"display_name_styles":{"font_id":8,"effect_id":1,"colors":[]},"banner_color":null,"clan":null,"primary_guild":null},{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}},{"id":"1264037351408144497","username":"arrryan0599","avatar":"51dbde70f92b843c858e25e03310e4ca","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Arrryan","avatar_decoration_data":{"asset":"a_e08b43c436272bc2c1e6ae85e71ab884","sku_id":"1402472280596152340","expires_at":null},"collectibles":{"nameplate":{"sku_id":"1377377712028516443","asset":"nameplates/nameplates_v2/spirit_moon/","label":"COLLECTIBLES_NAMEPLATES_V2_SPIRIT_MOON_A11Y","palette":"violet"}},"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":69,"userName":"jamie0773"}]