[{"id":"1328223182854815815","channel_id":"1324083123620941904","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Well we'll start by saying that even the questioning of your own objections is itself self-inquiry, so don't worry that you're not doing it. \n\nI'm obviously not familiar with your situation exactly, but what you're describing is usually a response to fear/anxiety around what you believe or think you are doing. Could be wrong, but let's run with that for now. \n\nNot sure if you play video games, but to frame this a bit let's start with a common scenario: a lot of people have \"ladder anxiety\" where they don't like playing ranked games because they might not perform at 100%, lose, and go down in ranking, so what a lot of people do is make a new anonymous account, and then play on that as their \"practice account\". People do this because they are emotionally attached to their identity as a competent ranked player, and think that if they experiment with bad strategies on their main account, their rank will go down, and others will perceive them as less capable or successful. \n\nRelating to self-inquiry the question is (rhetorically, you don't have to answer): what are you actually scared of finding out or doing? If you think it is important, why don't you want to do it? What do you think self-inquiry is that makes it something you want to both pursue and avoid? \n\nWhatever you might think self-inquiry is, it is only at the horizon or next foot-step of where you currently are. There is no blackhole or event horizon you're about to get sucked into like you're doing 5 grams of mushrooms or anything. Self-inquiry is asking the important questions about your experience of reality and self-identity at whatever \"stage\" you might think you are. The end result is a complete cessation of a self-identity entirely, as it is realized to be unnecessary and only harmful.\n\nIt might be helpful to note that you don't get there from a false belief like \"ok so self-inquiry is like psychological suicide? Ok fuck, I better make sure I'm really ready to do this...\" No, it's no different than anything else in that the only thing that is both engaging, interesting, and valuable is \"what do I want to understand now?\" If you are interested in meditation, follow a guide, if you are interested in intellectual understanding of emotional experiences, look that up. It all leads to the same place and the \"Me\" is just the home plate that makes sure you are actually staying on track.","timestamp":"2025-01-13T04:44:43.986000+00:00","edited_timestamp":"2025-01-13T04:45:24.400000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"195319730582716416","username":"vio04922","avatar":"443f5d00d4bdd17b2ae11829289963e8","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Vio","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1324083123620941904","message_id":"1324083123620941904","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]