[{"id":"1257602118999740426","channel_id":"1256478555433341009","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I agree with the others, I'd say that the most important part to understand that largely prevents the sort of \"ten commandments\" type phenomenon, and I hope I'm able to emphasize this as much as possible, is that self-realization results first and foremost in a change in emotional state. There can be incredible depth that comes from this, but it can be made really simple on the surface by saying that a self-realized person is not insecure. At its core, that's all that it is. What it *also* is involves the fact that nearly all human behaviour nearly all the time is driven by reaction to thoughts that are created by insecurity. Going off track but I think it was Gurdgieff who said \"You are in prison. If you wish to get out of prison, the first thing you must do is realize that you are in prison\". This immediately makes it sound big in effort, but what he actually means is the metaphor of the circus elephant being chained to a wooden spike as baby, and because it couldn't escape it then, it assumed as an adult those restrictions are permanent. Self-realization is really not a big change because it's the same as saying \"I am still tortured to this day by the imaginary friend I created when I was 3\". To someone in the torture, it is absolutely horrific and real, but to someone who has left it you realize how insignificant it is. \n\nA person who has a self-image/ego is able to have their mood altered by other people's opinions and ideas like a leaf in the wind, and a self-realized person does not experience that. It is not at all like Stoicism, which is essentially being prepared to deal with any emotional hardship, it is instead not experiencing that emotional hardship in the first place despite the circumstance, and so there is nothing to deal with other than the literal, physical situation. You don't need to deal with your anger if it doesn't arise. You don't need to deal with anxiety if it doesn't arise. For me, the most important thing to prevent belief/cult/religion from being created around self-realization is to just communicate as straightforwardly as possible what is the change in baseline personal experience is, and why I like the description \"Perfect Mental Health\", rather than something nebulous like \"living in the present\" or \"seeing things as they are\" or \"accepting reality as it is\". Despite those also being correct depending on the meaning of those words.  \n\nSelf-realization is a not a big deal in and of itself, and a self-realized person isn't special, they are just *exactly* themselves without distortion. In a way everyone has it backwards: a person with an ego is someone who thinks they aren't special. A self-realized person is essentially *completely authentic*. This does not mean you are super gentle and talk really slow. It doesn't mean you don't lie (intentionally or otherwise) or make mistakes. It doesn't mean you don't offend people, and it also doesn't mean you just \"say whatever comes to mind all the time.\"\n\nWhat I think is also relevant, is that it's not necessarily wrong for people to look for practical advice from people they think give good advice. A person who isn't self-realized can still give great advice, and a person who is SR'd can give terrible advice (me usually lol), and a person who is intelligent, has relevant experience, and is also self-realized probably gives great advice in specific circumstances and it's not bad at all if you think it makes sense and you listen to it. The only mistake is when you don't think it's good advice, but you reluctantly do it because your beliefs are \"it's in the ten commandments\" or \"well, I guess they know better than me\".","timestamp":"2024-07-02T07:41:50.287000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1256478555433341009","message_id":"1256478555433341009","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"}]