[{"id":"1298937804054593558","channel_id":"1294654651865501818","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There is nothing wrong with abstracting, there is nothing wrong with thinking. The only thing wrong is the incorrect ownership of \"I am the one doing the thinking\". There is no actor doing the behaviour. Look at it very seriously and that is the whole point of what I'm trying to communicate.","timestamp":"2024-10-24T09:15:05.584000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"210575654524026880","username":"dimefox.","avatar":"11af762583dd387f7fcdc219e76efbf2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"dime","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1294654651865501818","message_id":"1298933830521978892","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1294761626108694588","channel_id":"1294654651865501818","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Self-realization is not against any philosophical view only because it isn't a philosophy or idea, but a physical phenomenon. I've said this because it's easy to mistake self-inquiry or self-realization for philosophical knowledge/ontology rather than a subjective insight that results in a change in mental processing. A self-realized view on the nature of reality however is completely different though in that you just reject anyone else's beliefs about reality because they aren't contemplating reality, they are contemplating a small piece of reality which is the relationships between their own thoughts. \n\nAn example would be when Einstein formulated general relativity or special relativity. This was an enormous achievement by mankind because it allowed us to take something that is true about the universe and abstract it into human thought so we could share and utilize it. Einstein didn't invent relativity, it was already the case and built into the fabric of reality, he just converted it into thought. In the same way, the self-realized or non-dual perspective of reality is analogous to just \"The nature of reality is whatever it is\". It makes absolutely no difference what ideas you have about it because it is still the same regardless. No matter what you find out about the nature of reality it would fundamentally change nothing because it already is that. \n\nWith that said if you have to literally communicate the sort of \"non-dual philosophy\" if that were a thing, I've given the analogy of non-duality as \"Mario isn't *in* the video game, he is part of the video game\".\n\nThe most salient part of the perspective is that your implication of \"are there really other things, other people, etc.\" is more aligned with contemplating solipsism because it is analogous to Mario thinking \"Is the Mushroom Kingdom actually real? Is Yoshi another player or just a simulation of my mind??\" and that understanding is incomplete because Mario himself, his thoughts, that thought, and all of his experiences are itself still just part of the video game. Your thoughts can't \"escape the matrix\" so to speak because they themselves are the matrix. If you are playing World of Warcraft for example, your character in the game is not you in the same way another character in the game is not you, you are just directly experiencing the pov and experience of your particular character. It makes no sense to say \"Is my character the only real character?\" because your character is exactly as real/unreal as every other character because they are all part of the video game.","timestamp":"2024-10-12T20:40:27.172000+00:00","edited_timestamp":"2024-10-12T20:42:05.110000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"185473441866973185","username":"vistascan","avatar":"a846f9a62d880bf9e69f286ffdcfc376","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"vistascan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1294654651865501818","message_id":"1294745441778401332","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1294744250768031784","channel_id":"1294654651865501818","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"In the way you are describing it you're characterizing the objects *in* thought not thought itself. What you are describing is what I'm suggesting is what creates belief, the identification with thought, and the illusion of time. They are all equivalent to drawings on a piece of paper, and our mistake is identifying with the objects being drawn on the paper, rather than realizing the actual object is the paper/graphite taking different forms and nothing that appears on it is anything other than that. From *that* place you can invent a world of games/meaning of how the drawings inter-relate, like a video game, but it's the recognition that nothing on the paper is actually *real* per-se that allows attachment free thinking and recognition of what you are doing when you are drawing on the piece of paper aka thinking. \n\nTo maybe illustrate what I mean, the way that thinking must eventually be seen as or understood is similar to dreams. In that when you are having a dream, there seems to be as many unique objects, people, senses, and everything as any real life experience. Only when you wake up do you realize \"Oh, there were absolutely no objects in that experience, it was all one singular illusion that we call a dream\". In a dream you have many complex problems and storylines that inter-relate to each other, and you genuinely perceive you have many problems to solve, but the moment you wake up you discard the whole thing in one swoop as \"not real\". Thought is absolutely identical, in that there are no objects or different thing *in* thought. The only thing is the sensory perception itself. If this can be viscerally understood, then just like a dream being discarded the moment you wake up, thought itself while awake or asleep can also be automatically recognized as \"not real\" in the same way. I would again emphasize that this takes no effort, in that you don't come up with a method of \"figuring out your dreams aren't real while you're in them\", your brain just automatically disconnects the emotional attachment to them and nothing is scary, stressful, or a problem. \n\nWhen we are talking about passing a test or doing math/science or practically going about our day, yes we engage with semantics and have commonly agreed upon ways of using language or \"rules\" for common understanding that we call true/false/probable/past/future, etc. But this is essentially \"part of the game\" and the more important part is recognizing the nature of the game itself and being like \"oh, none of this has relevance like I thought it did before\".","timestamp":"2024-10-12T19:31:24.568000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"185473441866973185","username":"vistascan","avatar":"a846f9a62d880bf9e69f286ffdcfc376","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"vistascan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1294654651865501818","message_id":"1294654651865501818","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]