[{"id":"1449414595058864254","channel_id":"1436330362585485394","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah I mean the phrase is what triggered it for me, which was very strange because I didn't even really get it at the time. It felt more like someone saying \"look, there's the moon\" and consciously I was like \"ooooh...moon\" but your brain is like \"ok that's it we're becoming an astronaut but he'll learn that info later\".  Not like there is secret info, but it felt like your own concious knowledge is extremely low level, but that small insight was enough to trigger a much deeper and more intelligent brain structure to click and become aware of something. \n\nThe phrase itself makes perfect sense and is a great 'meditation', but at the time I didn't understand it conceptually at all as it was completely new, I was just talking to myself and thinking and it came out, but it triggered the physical event, and afterwards it made complete sense in hindsight. \n\n*My understanding, and to whatever extent experience, is that in a strange and very unintuitive way everything feeds into now.*\n\nThe point of the phrase and what it represents conceptually is there there is nothing else to feed into now. Ten years ago it was experienced by you as \"Now\". Right now you are experiencing \"Now\". In ten years you will experience that moment in time as \"Now\". You cannot experience \"everything feeds into now\" there is no other thing than now. The one and only thing in existence to you is present experience. \n\n> Is there anything more to it or is it just repeatedly noticing that these models and imagined events are always happening here, now? Does it just become gradually more obvious with time, or did you feel like you had to actually solve/resolve all the things you found agonising? There are many things that get stressed as the crux or path to SR, and eventually it's really hard to know where to even look besides watching videos and trying to understand incrementally. \n\n\nYou have to solve something, but it's more accurate to say that you have 'resolve' something. Meaning it's like a gradual disintegration that eventually leads to removing something entirely, which could happen at any moment in completeness. It's not like solving a Rubik's cube that requires an algorithm, it's more like - and pardon the terribly cringey metaphor - like childbirth. From my perspective looking at everyone else its inevitable, but to the individual in the womb it feels like a panicked escape room they can't figure out. In this terrible metaphor it's not a matter of \"do nothing and wait\" but instead it's a matter of grow the baby and when it's big enough it pops out.  Which is why I encourage people on here to go to the gym, get in shape, make money, get an education, get a job, live your life, be successful, do everything because that's life. The point is if you are *trying* to do or accomplish something it is because you want self-realization and will never find it. Here's a quote from Jim Carrey who has a bad case of Hollywood disease: \"I wish everyone could get rich and famous and have everything they ever dreamed of so they can see that it's not the answer.\" Jim Carrey has looked everywhere except at his own beliefs about who he is supposed to be. What is not appreciated by anyone is that this phrase is identical to \"I got the two bedroom, two bath home with a wife and two kids and I am still miserable\". In the Congo it is \"I got the two hut, two farm, 8 kid cocoa farm and I am still not happy\". It is not the thing or the achievement, it is the completely false belief that you ever get anything at all from doing anything. You have to wake up and do *something* but that is the question of life that is misguided by this identity.","timestamp":"2025-12-13T14:56:08.283000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1436330362585485394","message_id":"1447353683242385459","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":15,"userName":"jamie0773"},{"id":"1449407118867431454","channel_id":"1436330362585485394","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's analogous in my own experience to how I used to and presumably most people would experience a dream. In a dream something really bad might happen, you get really scared, then you wake up and in 5 seconds you're completely fine. Why don't you have lingering trauma? Because you intuit \"that wasn't real, it was a dream\" and your brain automatically discounts it. \n\nIf you say \"I am going through a breakup, and the image of this person in my mind hurts\" it is different for me (now) because there is not the \"added on\" part of hurt. If I said \"I am eating a sandwich\" you would be like \"yeah ok\". If I said \"I am eating a sandwich, and I am deeply suffering for how it burdens my soul\" you would be like \"lol what....*Why?* \n\nThe hurt comes from the subjectively invented belief of \"why\" we've constructed over a lifetime of building our identity, it isn't inherent in the memory of the experience. It might be valid for me to say \"I am eating this sandwich and it is hurting my jaw right now\" but it is not valid for me to say \"my jaw hurts because I'm remembering eating the sandwich that was too big\" this is not possible, but it is possible for our ego to create this emotion based on imagination if we still have an imagined sense of self-identity.  \n\nBelieve it or not, that's the change. If your parent dies at the age of 85 from natural causes after a good life, we all accept that many people will be really heartbroken and miserable. Any good parent would say \"no, do not be heartbroken and miserable, I had a good life and you are my child, please, do not waste a second being sad!\", so who is right? Or is it just \"how it is\"?. Without an imagined personal identity that was hurt by another person's death, there is no change in your identity or imagination of your life, just an immediate change to what is happening in front of you. You can love someone in their last moments, then they are gone, and there is no sadness, just an absence of love. \n\nThis is not just my personal experience, but also exactly what is intelligently communicated by the individual. If my Dad were to die tomorrow, he would say exactly the above, and the truth is a passed family member is supposed to represent the absence of the possible experience love towards that person, there is no need at all for sadness. A person is only sad at the death of another because they unfairly died in direct observation, or it is ego based and the imagination of your life has become worse. \n\nBreak-ups are usually a bit more complicated because for younger people romantic relationships are usually partially an expression of genuine love/attraction, but reminiscence or thought based remorse/anxiety/sadness are like the deceased relative example.","timestamp":"2025-12-13T14:26:25.820000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"457231767934468097","username":"kasper4069","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kasper","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1436330362585485394","message_id":"1447222410272182465","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":14,"userName":"jamie0773"},{"id":"1447180111542747137","channel_id":"1436330362585485394","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"All of things you've described are efforts to model your self-image/self-knowledge. You are trying to think about yourself and more accurately define what you are in characteristic. Even when you are taking the model of yourself and saying \"I have to get rid of this model\" you then modify it with an ever more advanced and complex model of yourself. \n\nThe extreme baseline that our self-image is trying to do is trying to describe what it's like to be *another person* which is our life, when what you need to observe is what it's like to *be a person* right at this exact moment as you are presently experiencing it. The complication is that we obviously are aware we presently experience something, but we then imagine that because we experience things in the past and will experience things in the future, that this is then also *me*.","timestamp":"2025-12-07T10:57:05.898000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1069551628409110571","username":"720jetski","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jeff","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1436330362585485394","message_id":"1436330362585485394","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"}]