[{"id":"1272431884185370677","channel_id":"1270633139030724700","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think another way of pointing it out is asking \"locate exactly when the past has occurred and lead to the future\" or \"when does the future happen and become the past?\" if you think about either, they make absolutely no sense at all. To us, the past is an arrow that goes left, and the future is an arrow that goes right, we logically think that neither ever touches each other. If you think about that a bit, I think it helps with also understanding that if what you experience is the present, you actually can't experience the past or future, ever. There is never a crossing point between two arrows that point away from each other than you are standing in between. \n\nTo try to make it more practical and directly relate to the \"everything is rolled up in the present\". The hardest part of dissolving your own self-concept is realizing it's redundant because your current thoughts, desires, past, future, dreams, problems, and all psychological phenomenon is being created by the current physical development that your body and brain currently is and what \"Me\" is is the experience of that phenomenon. When you were 6 and liked hot wheels and wanted to be a dinosaur when you grew up, our ego tells us when we are 9 \"oh man, I was so stupid for thinking that when I was 6, now I have learned that hot wheels are for kids, and lego is the shit. Still can't wait to be a dinosaur though\". Then when you are 15 you think \"damn, I remember the good old days of being a kid, but now I have new problems. I'm such a nerd, how do I get these girls to like me? I better find some advice on youtube from mlg pick-up artists to get all the hunnies\". Then when you're 22 you might think \"god I can't believe how stupid I was, getting a girlfriend is obviously just about being rich, jacked, and a good job, that's why I am going to be a petroleum engineer and do hella steroids\" then when you're 30 you might think \"damn, I can't believe I was so vain and wanted a hot girlfriend and a job that just made a lot of money, I actually want to pursue music and art and just find a partner who is compassionate and chill\". \n\nThis whole time we subjectively perceive this experience as \"Me figuring out my life and how things work\", when in reality it is actually just a particular organism expressing and unravelling its own character as it physically matures and is capable of new thoughts, different interests to accumulate experience, and changing objectives based on its current biological self-expression. Again, exactly like how a plant is always \"doing something\" according to its exact current state of development in order to usher in the next stage of \"what it is\".","timestamp":"2024-08-12T05:50:01.831000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1270633139030724700","message_id":"1270633139030724700","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"}]