[{"id":"1375744674869936158","channel_id":"1367980066083963022","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The fundamental resolution is that it is not necessary to have any emotional relationship to imagination, but emotional relationship to any other sensory perception is necessary. I.E. Is the emotion related to immediate senses or thought/memory?\n\nWhat you are confusing is that there is a necessary conscious judgment that must dictate \"oh, that was imagination\" vs. \"oh, that was real\". This is the \"I\" or \"Me\" that is saying \"I will decide what is real or not and what I belive to be true\".\n\nI often have dreams where I think \"oh shit, something is happening to me\", then I wake up and think \"oh nah, that was a dream\". The difference for me now is that no matter what I dream or think at any time there is no emotional relationship, concern, anxiety, or worry. There is *automatic* reception by the brain there is no problem or issue. I don't actually conciosuly think, perceive, or control anything in that regard. There isn't a bad thing that happens and then I rationalize it is \"not a big deal\", there is no conceptualized process of such that occurs in the first place. \n\nThe error is assuming that in order for this to occur we must be able to come up with a method for detecting whether or not an \"unreal\" dream is occurring and to be like \"ah-hah! This is a dream! You can't hurt me!\". But it's not the case. An actual *waking* experience must happen that causes us to realize our actual identity as individual living organisms must take place in order for the subsidiary experience of dreaming to \"fall in line\", which is the resolution of nightmares and neurotic emotional experience in dreams and waking life.","timestamp":"2025-05-24T07:58:10.589000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1367980066083963022","message_id":"1367980066083963022","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":14,"userName":"jamie0773"}]