[{"id":"1277538025156382790","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah think about that for sure","timestamp":"2024-08-26T08:00:00.706000+00:00","edited_timestamp":"2024-08-26T08:17:54.271000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259039638493073479","message_id":"1262892385793474632","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":26,"userName":"jamie0773"},{"id":"1262655749310513193","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah, as in when I say \"raise your right hand\" there is only one entity that can raise your hand and you call that entity \"Me\". It isn't \"my body\" raising \"my hand\" and it isn't \"my soul\" raising \"my hand\" it is a very familiar and obvious identity that we continually refer to ourselves as. It is the same thing as referring to \"My existence\" or \"My being\" or even just \"Being\". But we are trying to look at and recognize what each of us is, not to create a knowledge based description that we can all point to and say \"yeah that's sort of what I experience also\". We are looking directly at our own experience and what that is. \n\nIn a very brief way, when we use the word \"I\", what does that refer to?","timestamp":"2024-07-16T06:23:09.645000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259039638493073479","message_id":"1262654403542777897","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":24,"userName":"jamie0773"},{"id":"1262644408977981450","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Right, the core of the whole inquiry is that our self-image and the imagination of our past, present, and future identity is a symbol. Like you said \"it points to the real thing\". This is the assumption. The question is: what is the real thing? We spend our whole lives worried about identifications, thoughts, opinions, ideas, and possibilities because they might \"affect the real thing\". What is the real thing? What is \"Me\"?\n\nReally take this part very seriously and slowly. Like I mentioned in what I've written, we immediately want to rattle off a bunch of \"things that I relate to\" like \"My body, my appearance, my soul, my consciousness, my this that or the other\" when if we are being genuine we know this is nonsense. If you say \"pass the ball to *me*\" you aren't saying \"pass the ball to my soul\" or \"pass this ball to my consciousness\". You even know you aren't saying \"pass the ball to my body\" you are referring to \"Me\" as a very particular thing separate from \"you\" and that is what we need to examine. This is the whole point, which is to notice we have never spent the time and effort to resolve this problem, and to try to begin to resolve it.","timestamp":"2024-07-16T05:38:05.899000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259039638493073479","message_id":"1260169198022295582","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":21,"userName":"jamie0773"},{"id":"1259804248867213364","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hahha, hope it's helpful.","timestamp":"2024-07-08T09:32:18.961000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1259796167273746523","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Maybe I can try to point to a small example just as an illustration, so let's take a point like: \"...how time is actually a sensation I experience now and not a real thing, and my day to day constant existence?\" This isn't something I've said but something you've interpreted, in that yes, thinking is a sensory perception, and time exists as a relationship between thoughts, but time is not a sensation even through that logical relationship. This isn't a problem at all, especially if you frame it as your own view, but I'm just bringing it up to try to circle around the actual important part of self-enquiry, which is that when I communicate something as an idea, I obviously can't directly inject my point of view to anyone else, and that person must *interpret* what I'm saying through the lens of their own understanding and faculty of thought. \n\nAgain, this isn't a problem, but what you're skipping by is the subjective experience of this, because it so naturally seems that we are actually contemplating real logical facts or ideas like studying for an exam, when there is no exam and no facts to memorize. When you say \"yes, I agree time has to be a sensation I experience\" this is you creating a symbol in your own mind, agreeing with it, then calling it my idea. The reason there is objection or agreement with me or an external actor is because you think the idea you are reacting to *is actually an external actor*, but isn't, it is your own knowledge you are agreeing with but not recognizing it as your own knowledge. In self-enquiry we are trying to slow down and observe that we do this and don't understand why, then examine it. The very first step though is observing that this is happening outside of our previous awareness. This is the same identification that occurs when someone says \"God I hate Democrats, they are so stupid\" and we say \"HEY, *I'm* a Democrat and not stupid, in fact *YOU* are the one that is stupid\". In reality someone has become angry at their own image of what a \"democrat\" is, got angry at that symbol, we have then perceived an image that *I* call a democrat, think its us, and then logically assume \"they have insulted *me*\", when we have actually just hurt ourselves. One person is getting mad at their own reflection, the other then gets mad at their own reflection, then they start yelling at each other mistaking their reflection for themselves and mistaking their own self-harm as being inflicted by the other. \n\nSorry I know this is a long one, but this is one of the funniest/dumber examples of me doing the same thing that actually was very misleading to me at first. J.K. has a line where he says \"...then what is experienced is immeasurable\". And that was the only time I've ever heard him basically imply there was some sort of incredible state that could be achieved. In hindsight, he *literally* meant \"to perceive without measurement\" meaning to live our lives without comparing ourselves to others, our past, or future. This is another example of projecting my own beliefs at the time onto him, and then agreeing or disagreeing with what he said, when in reality my opinion of what he said was just my opinion of my own opinion.","timestamp":"2024-07-08T09:00:12.159000+00:00","edited_timestamp":"2024-07-08T09:07:31.681000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1259796165311074335","channel_id":"1259039638493073479","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It really comes down to unravelling self-contradiction and confusion within our own experience. As an example, nearly all people experience anxiety or anger somewhat frequently. Sometimes they say \"well that makes sense because of xyz\" (that too doesn't make sense, but leave that aside for the moment), but nearly all people will experience anxiety or anger, and look at their situation and at least sometimes say \"geez, I am experiencing anxiety/anger/regret/envy/jealousy/longing, but this sure is *irrational* but I guess I'm just stuck with it\". This is the absolute bare bones starting point. Absolutely all emotions are *not* irrational, and in fact make perfect sense and there is absolutely no error. It is a secondary misunderstanding *causing* what appears on the surface to be unnecessary or irrational, but it is always caused by deeper misunderstandings. The deepest misunderstanding relates to our concept of \"Me and my life/identity\" which is deeply intertwined with our understanding of what we think is our past and future. \n\nThe examples of \"You can't taste your own tongue\" is not a puzzle you're meant to intellectually solve, it's just a Koan, and meant to point out that very obviously we know that in order to taste something, you need to put something in your mouth. In order to see something there needs to be an object to see, but thinking doesn't believe it operates like this, and says \"I can think about anything and everything literally at any time. Hell, I can go outside of reality and think of the past and future, and also think of things that don't even exist\". This belief is the central reason we have \"irrational emotions\" and mental health issues in general, because we believe we can conceptualize literally anything, including ourselves, and manipulate real threats or possibilities in our mind throughout time, when this is not possible.\n\nIn a similar sense, in therapy, some people feel there is some effort to get to \"the root of the problem\" as in some core trauma or pattern of thought/behaviour that brings to light why a certain emotion is commonly experienced or a coping mechanism has developed. This is insightful to most people because they've literally never tried doing this on their own and it can bring light to harmful beliefs they have that are instantly realized to be harmful (I've mentioned the metaphor of pruning the leaves on a tree). What I'm suggesting is that with self-inquiry, you can go *far* further than just learning you have a maladaptive coping mechanism or the \"cause\" of your anxiety, and resolve the core misunderstanding that causes the emotional relationship to thought in the first place. This causes all neurotic emotional experience to end completely.","timestamp":"2024-07-08T09:00:11.691000+00:00","edited_timestamp":"2024-07-08T09:01:18.683000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"}]