[{"id":"1253089891269607545","channel_id":"1252706904128618548","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"As an example, you don't think \"I should really lose 30lbs, but that seems really long, hard, and difficult and I don't like running or lifting\". You have the idea, which is a concept of course and then when you've basically \"decided this is an intelligent 'goal' to act on\" it becomes embedded in present decision making, and becomes an immediate reaction to present circumstances like how a soccer player doesn't think about how to kick a ball, all his knowledge is rolled up and accumulated into his current kick. You don't think \"I ate 4000 cals today but tomorrow I'll make up for it by eating 1500 and running for 2 hours\" you just have a series of immediate choices in the present like \"what should I make for breakfast?\" then \"I will ride my bike instead of driving\" and \"I will order vodka soda instead of beer\". While you can still plan things if you are certain you will execute them, generally you don't plan these things, you decide them consciously as the event occurs to you because that's the only way you'll be able to tell if it's an intelligent and functional decision or not. I would lastly emphasize one more time that all of the things I've described are already how everyone operates, but because there is another layer of thought based beliefs creating emotional response layered on top of it, there is a lot of confusion and they can't see this base layer of function clearly.","timestamp":"2024-06-19T20:51:51.363000+00:00","edited_timestamp":"2024-06-19T20:57:12.626000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"jamie0773"},{"id":"1253088412655812779","channel_id":"1252706904128618548","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, welcome and thanks!\n\nI would start by emphasizing that what I'm communicating is not a perspective or new belief, it is a phenomenological *a-ha*. The knowledge or encircling information is just there as my best efforts to try to point people in the right direction and encourage them to go further in their understanding of themselves to hopefully have the change in mental processing themselves. \n\nIt seems you've really authentically examined the objective \"why/what\" of your self-image when you said *\"Self-inquiry revealed my identity as a \"good person\" stems from a need for approval, not genuine goodness. This identity guides my life, despite causing suffering. I struggle to abandon it for what i believe is only apathy.\"*\nThat's very insightful, but also it's just getting to the starting point of self-inquiry as you now have some strong beliefs you have about yourself. You have determined these objectively through the analysis of the content of your thoughts/knowledge. Self-inquiry truly begins when you begin the subjective inquiry by starting to *zoom out*, which is unintuitive, but means to examine the *subjective* meaning your own brain plasters onto things. I would ask rhetorically for example when you say \"my identity is xyz\", what do you mean \"*My*\" identity. Why does it belong to you if it is you? Who has this identity and how does it occur to you in conscious experience? \"I struggle to abandon it\" Who is abandoning what? Is it separate from you? What is the you it is separate from? Etc. Again rhetorical, just trying to get you thinking about where to direct your thoughts and attention for this.\n\n*How do you find motivation and purpose if not living to adhere to the beliefs and ideals you've chosen to build yourself around?*\n\nSame way all other animals live, which is without consciously known purpose. Your own purpose is baked into your own genetics and acts itself out as preference. Growth comes from a natural expression of one preferred action leading to another, just like a plant. One person might mistakenly say \"My life's purpose is to be the greatest musician of all time\" only because this is an ego based extrapolation of their preferences. Another person might say \"damn that's stupid, my life's purpose is to be the best parent to my kids unlike my terrible parents\". Both are ego driven ideals but the basis of both is still the person's natural preferences towards certain behaviour. People only demand a meaning to life when they are unhappy because they are saying \"Tell me what to do so I can be happy\", but the solution is realizing that believing you need to become or do certain things to be happy is itself unhappiness because it causes you to automatically view your current circumstances as disatisfactory and insufficient. \n\n*Should we use your concepts to prune negative self-associations while keeping positive ones, or completely dissociate from built-up self-views?*\n\nEmphasis again I am not trying to share concepts or ideas, but a phenomenological event. All that is necessary is to understand yourself and change will be automatic. The moment you see an error as an error your brain will automatically stop doing it. You can't consciously *try* to associate or dissociate with anything it won't work or change anything. \n\n*How do you find motivation to do hard things when you're always content? What motivates you?*\n\nOther than physical hardship which is just unavoidable, psychologically nothing is perceived as \"hard\" subjectively because you only ever act and respond to things in the present, and so no matter what you're doing it's always just one foot in front of the other, you don't emotionally conceptualize a task as \"really long and boring and hard\" or in terms of \"goals/outcomes\" you put your full attention on making intelligent decisions in response to what is immediately in front of you and your long term goals or objectives are embedded in why you perceive a certain action as intelligent or appropriate.","timestamp":"2024-06-19T20:45:58.834000+00:00","edited_timestamp":"2024-06-19T20:54:38.563000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"142217050364968961","username":"hammer1122","avatar":"f7b31aaaaea9d409de83ac89b167df6f","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"Dillon","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1252706904128618548","message_id":"1252706904128618548","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]