[{"id":"1310508253544710164","channel_id":"1302133233898618911","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah the difference is just are you aligning yourself to your preferences of what you'd like to do vs. are you aligning yourself with things you're emotionally compelled to do out of fear, avoidance, guilt, or any other emotion. \n\nYou can just imagine it like if you had a cute little golden retriever puppy, it clearly just does whatever it wants to do all the time, but also when it bites someone and they seem hurt, they're ashamed and don't do that again. Another animal might bite you and not care. It's in the nature of a golden retriever to be able to perceive and care about harming others it cares about and it won't do it again. Over time it causes the golden retriever to naturally \"act out its nature\" intelligently in relationship to its environment. This is different for other breeds of dog, it is also different for snakes, or vultures, or humans. The only difference is that humans are capable of inventing a false self-concept of \"who I think I am, what my life is, and what I should do\". This results in people who are (metaphorically) chihuahuas trying to be labradors, or pitbulls trying to be retrievers. People don't align themselves automatically to their own preferences, they align themselves with what they think they should be or what they think they are mistakenly. \n\nThis results us doing a lot of dumb stuff like feeling guilty if we don't go to the gym, then trying to find ways to trick ourselves to do it or make it easier. For me personally, I love going to the gym. It's never been a problem going because I like it. I don't like most other sports but I really like strength sports and the gym. For others though, if you dropped the belief \"to be fit and in shape you need to go to the gym\", it would be possible to immediately find another activity that would accomplish what you wanted to your own preference. \n\nSelf-realization results in immediately having the sort of golden retriever \"I'm just doing what I'm doing\" attitude and trying to make it work better all the time without confusion or distortion of your own identity. It's not a golden retriever realizing \"oh, I'm a golden retriever\" it's just the cessation of believing it was something at all, and then anything it does is the nature of a golden retriever because that's what it is.","timestamp":"2024-11-25T07:31:55.711000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302133233898618911","message_id":"1309358486743810148","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1306343460680368261","channel_id":"1302133233898618911","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The most common belief that causes many people to experience envy or sadness when they are out-achieved is because in their beliefs a person of similar or superior qualities reduces their own social value. Sadness will occur if you believe this person has set you further back on your ability to experience being loved by others (ego based love), which means they are preventing you from achieving a goal (winning an award for example) or getting something you want like a girlfriend/boyfriend. This is always slightly different for each person because your beliefs are all subjective and the emotion will occur accordingly, but this is probably the most common theme. \n\nThe comparison is not objectively flawed, in that if you got second, but they got first, then they have objectively done something superlative to you. The mistake is believing that something about your identity has been diminished when nothing has actually changed. Your IQ is whatever it is. Your attractiveness is whatever it is. No matter what happens to you, in matters of measuring yourself with thought, you are still objectively exactly the same before and after you make the measurement or comparison. It is always an error to try to assess your self-identity based on a *relative* measurement because it means you don't know what you are and mistakenly think you are the approximation of yourself you have in thought instead of realizing the actual fact. \n\nRegarding shame and behaviour, it is the most frustrating emotion for me to explain because even if you don't have a self-image, it is the only emotion that can occur because of someone else's self-image. If everyone were self-realized it would only ever occur when you accidentally physically hurt someone, but because people express emotional hurt from words and ideas, if you accidentally hurt someone with your words, which is their ego being hurt, it will cause shame to arise. The difference is that after SR *you* can't be hurt by words or ideas. The sole exception is again when you accidentally hurt someone else. When this happens it's always a bit annoying because with almost all people they are experiencing emotions while communicating nearly all the time, so you feel like you are constantly walking on eggshells. I would emphasize that this is still an extremely rare occurrence, course-correction in behaviour is 99.9% just using your intelligence to express preferences/skill and emotions are like dashboard indicators, in that they are very rare and are like special alerts. \n\nRegarding wanting to work hard etc., I go through the same process of refining my own behaviour to more appropriately suit what I want to accomplish, and also usually don't do a very good job of following through (lol), but the difference is that yes, there is no emotional relationship to the thoughts or feelings of regret, but the process is the same. What is not helpful though is if you have an ideal in thought like \"how do I work 12 hours a day on this to get ahead?\" You will usually find you basically never do so and feel bad, and what you're dwelling on is \"how do I work more??\" When you actually need to figure out how to align yourself with what you naturally prefer to do. You don't decide how much water and sunlight to give a plant and force it to adapt to what you want, you try to figure out exactly the optimal way to treat the plant in order to optimize it's growth.","timestamp":"2024-11-13T19:42:31.714000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302133233898618911","message_id":"1302133233898618911","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]