[{"id":"1351788572012974132","channel_id":"1351214584265969826","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah to agree with the other two, largely the idea of \"mine\" or \"yours\" really doesn't change. They are practical uses of thought/knowledge and part of what allows humans to operate within certain types of more complex systems than other creatures. The concept of ownership doesn't change. \n\nWith that said, if you were to say \"my house\" or \"my bag\" or \"my money\" or \"my family\" that is exactly the same, but if someone were to say \"my people's land\" referring to ethnic or religious territory, \"my religion\" or \"my country\", that is not something that is necessarily \"wrong\" or \"right\" but it is not something I would identify with at all. You still make governmental and geopolitical decisions on the same basis as before, but when I look at Canada (where I'm from) it is fun to be nationalistic or patriotic in a cultural sense, because the people in my area share common experiences, memories, ideas, and values, in the way I can make a joke about Tim Hortons and everyone is like \"yooooooo Timmieesssss baybeeeeee\" and it's just fun in the same way that I would be hanging out with Americans in Europe because all these other goofballs don't speak English. There isn't any deep dislike or any problem, it's just fun to relate to people with similar experiences. \n\nI think the best representation is the meme format \"wait, you thought xyz was real??? I thought it was a joke :(\". In that our self-image takes national or social identity to be actual \"us\" but there's no need for cultural or national identity, there is just familiarity and liking to some things that are proximal.","timestamp":"2025-03-19T05:25:10.585000+00:00","edited_timestamp":"2025-03-19T06:41:09.443000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1351214584265969826","message_id":"1351214584265969826","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]