[{"id":"1415161648855122013","channel_id":"1410408371764330590","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@pikachu_is_boss Consciousness can be referred to as an object when we are discussing it scientifically or philosophically, but that is not what \"You\" are. I am conscious and you, presumably, are conscious. If I use an objective statement like \"consciousness is the awareness and mental processing of a complex organisms sensory perceptions\" you would be like \"yeah that mostly seems right\". But if you say \"yeah that describes me\" and I'm like \"yeah that describes me\" then are we the same person? No, obviously not. Consciousness is not *literally* a description in a dictionary, the real thing is your subjective awareness. \n\nIf you wanted to look at through a lens of materialism, then you could say that consciousness emerges from an organism's brain, which is a complex network of communication through electrical activity between neurons, which is fundamentally chemical reactions producing coherent electrical signals through the interaction of molecules, which are various constructions of atomic particles, which are arrangements of force generating subatomic particles, which are probabilistically distributed interactions between quantum fields that permeate reality. Probably inaccurate on most of that, but even from that loose description, you basically had a period roughly 14 billion years ago when the universe was a really dense and simple interaction of that, and now it has evolved into a less dense but more complex interaction of that, and consciousness is an emergent phenomenon in that development. From that perspective I would personally say it is easiest to think of your objective/philosophical existence as a \"phenomenon\" reality is currently producing in itself, but that is not what self-inquiry is really about, that is more like stabbing at the questions of \"why do I exist?\" or \"what is reality?\" or trying to explain existence rather than answering the question \"What am I?\" which is about looking and checking something that is definitely real and you know for sure, rather than speculating on scientific information. If for example you had no outside knowledge of the brain or body, you can still be self-realized as they are unrelated. \n\nOur intuition to create \"Me\" or our subjective conscious experience as an object is because absolutely all things we experience during our lives with the exception of \"Me\" is perceived as an object. This includes other people's consciousness. You could simplify it a little by instead of using the word \"object\" we use the word \"word\". Basically everything that exists to us we have a word for., including ourselves. If you can differentiate something from another thing using words then by and large to you it is a different \"object\". Self-realization in this context is essentially realizing the only thing you don't need a word for is yourself, because your are it. \n\nThe tricky part is that because humans are so good at this, and can differentiate between things at such a granular level, we actually invent an extremely complex and high resolution model of ourselves, mistake that model for ourselves, and then emotionally react to it as if it is actually us. I\n\nA little version of this is we get scared of nightmares because they seem real. In the case of nightmares, what we *want* to be the solution is a technique for realizing we're in a dream while we're in it, because then the scary monster wouldn't be very scary.  Another solution would be what if you just dreamt in really bad graphics? Nothing would be scary if you had pixel art monsters instead of perfect photorealism. This is *similar* to how thinking tricks us. We believe there are objects in thought because our thinking is so high resolution it is basically indiscernible from external reality. When I say something like \"there are no objects in thought, thought is itself the object\" what I mean by that is like Ditto the pokemon, it can *look* like anything, but it is itself just ditto.","timestamp":"2025-09-10T02:27:09.519000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1410408371764330590","message_id":"1410408371764330590","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":29,"userName":"jamie0773"}]