[{"id":"1395873329683894394","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"A lot of what you asked are fairly objective questions in that there's physical explanations for it if you're interested in that. Memory being chronological is likely similar to how a computer stores a stack of memory, in that in basic storage formats the newest information just gets put in front of the one that came before it like pancakes. You can then search through the dataset with an ordered query from most recent to oldest. Your brain likely has similar sort of function even if it's related to that or to something as basic as how old the neurons are, but I don't really know the actual physical reason.\n\nFrom a subjective perspective, we have memory for very similar purpose as a computer algorithm or AI needs a dataset, in that your intelligence becomes more contextually effective with greater exposure to new information. For whatever reason, the human being entire physical purpose is to experience the emotion of love, and this is accomplished through \"doing what you're meant to do\" as an organism, which arrives throughout your life through intelligent action. For each person's circumstance and personality this will be different, but the principle is the same. \n\nI don't dispute there was an order in which you experienced things in the same way that computer memory example is the same, but just like the hard drive, what fundamentally exists is the present state of the hard drive/memory. You then look at the present state of the hard drive and it says \"10th birthday party\" and this is listed as older than \"20th birthday party\", but the idea of \"older\" or \"newer\" is an internally invented structure of the hard drive that is useful for its function. As an example of that, 4 year olds remember tons of stuff that happened ot them in the last year, but by the time that kids is 15, they will likely not remember more than one or two things that happened to them at that age. It's because those memories are not useful for function at 15 and have basically been dropped or replaced, bringing about a different \"present state\" of the brain/memory that dictates function and recall.\n\nIt's a good question actually because becoming aware that what you think and believe is just the product of the present physical growth and memory of your brain helps you realize you aren't \"doing the thinking\" the brain you have is doing the thinking and feeding it your awareness.","timestamp":"2025-07-18T21:02:15.869000+00:00","edited_timestamp":"2025-07-18T21:03:39.035000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1387108188335243316","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":34,"userName":"jamie0773"},{"id":"1298611552861032509","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'm not exactly sure what you're asking","timestamp":"2024-10-23T11:38:41.238000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1297984173495291994","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":27,"userName":"jamie0773"},{"id":"1297880395882430508","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I don't really like saying it this way, but non-duality is an expression of what reality is interpreted as post self-realization. It is nothing special, but just the absence of anything special at all and then you see what's left. \n\nWhat non-duality fundamentally means is the automatic psychological acceptance that *whatever is the case, is the case*. Which isn't the same as \"what you observe is the only thing that is real\" which is subjectivism, although it might seem that way sometimes. It is the acceptance that whatever you know, don't know, perceive, don't perceive, or anything that has occurred or will occur is always at root \"what is already the case\". It is actually a meaningful statement to say \"knowing absolutely nothing means knowing everything\". \n\nThat's the expression in terms of knowledge. From that perspective, when someone says \"drinks on Saturday?\", then there is no problem writing that down and calling it \"the future\" but that's not how it is cognitively experienced. There are lots of things, including all of your own practical day-to-day activities that are just what they are. There's nothing to philosophize or analyze, they just are what they are. Nothing of what I'm saying is an intellectual argument, but an experiential or observational one.","timestamp":"2024-10-21T11:13:19.830000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1297388524835835916","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":25,"userName":"jamie0773"},{"id":"1296750719679856670","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I just wrote this in another thread, so sorry for repeating myself but I think it's a good description. It is analogous to saying \"You say you don't believe in god, yet you say that you shouldn't commit adultery. How do you know this without the ten commandments?\" and the straightforward answer is that the origin of the ten commandments and religious morality is itself human morality at its baseline. The morality is in the human, not in the book. The human then understands themselves, translates it to thought, and then writes a book.\n\nSimilarly, when I say \"I don't think about myself\" and someone says \"how can you operate that way? I couldn't imagine operating in my life without thinking about myself\" it isn't that they are wrong or that I don't do what they are referring to, it is that what they refer to as themselves is not actually themselves. It is not the baseline. \n\nReferring to the J.K. comment, he refers to \"calendar time\" and \"psychological time\" differently because they are extremely different but use the same word. Anyone self-realized still uses calendar time in the same way they always have. I have a dental appointment next Thursday, so I write that down and will go there in the future. We are using \"time\" as a word, but the context is just \"yeah yeah yeah, everyone exists in the real world and we use these words to denote obvious physical commitments in our life\". This doesn't change, this is just linguistic small-talk basically. \n\nThe idea of \"no psychological time\" is related to an actual \"ok, sit down and think about this\" point about your actual experience of time itself and what it really means. That's the differentiation that's meant to be drawn and examined. Having a haircut tomorrow at 1pm is psychologically meaningless. We all know what that means. Saying \"time itself, what is that thing? What is your life that has time?\" is a profoundly important question that must be answered and what is being referred to.","timestamp":"2024-10-18T08:24:24.035000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1296684314423197788","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"},{"id":"1295786254591463434","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You can if you want, but then you're doing philosophy and trying to intellectually argue with your own imagination, which is your thoughts. All you need to do is check when the thoughts occur in sensory experience and its right there. Your experience itself is what you're dissecting with thought, you can just check with it directly. It is always \"Now\", it is never a different time and you have never and will never experience a different time. What you call the past was experienced as \"Now\" what you call the future will be experienced as \"Now\", you don't ever need to and can't ever be subjectively concerned with anything else ever at any point in time. There is not a single example of anything you have ever experienced that doesn't occur \"Now\". Even if you said \"yeah well what about that time I went to the store yesterday\", and this is just an illusion because the words you are speaking and the image in your mind is present memory, it is also occurring now. If you have a dream where you are a child again, that isn't \"me dreaming of the past\" it is again a dream occurring to you now. It is mistaking the content (the objects) of the thought for the thought itself which occurs now that causes this illusion.","timestamp":"2024-10-15T16:31:57.639000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1211981659688148993","username":"joesfurniture","avatar":"203e3fa7d796a2550d84ffe29c9bb1bc","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"joesfurniture","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1294919704695148554","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":20,"userName":"jamie0773"},{"id":"1294767008906477588","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It might be helpful to consider what you would be if you could only see but had no other sense, or if you could hear but no other sense. Or if you take your current sensory experience and start subtracting each one until you are nothing. At each point of this process what are you?","timestamp":"2024-10-12T21:01:50.531000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1294400353273384980","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":18,"userName":"jamie0773"},{"id":"1294069096790360127","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah you're really looking at the right thing!","timestamp":"2024-10-10T22:48:35.316000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1294057560151691295","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":8,"userName":"jamie0773"},{"id":"1294034470764150825","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"\"Yes the past and future aren’t really there, yes the thoughts of the past and future don’t actually represent anything currently real. But they are imaginative recreations and predictions respectively which are useful tools, despite being prone to inaccuracies and biases.\"\n\nThis is the part that is inaccurate, in that they are *not* imaginative recreations or predictions, this is embedding a misunderstanding of time into the model we are imagining. You aren't recreating anything because any thought you have is part of present reality. It is not obvious but all \"thoughts about the past\" are actually a freshly minted piece of reality as it currently is, not something of the past or a prediction of the future. \n\nWhile it's not necessary sort of logically argue with ourselves, you can also think of it like this: time is a measurement, like distance. Distance doesn't actually exist as anything but a psychological abstraction that actually represents \"how many things could fit between two other things\". In the same sense, time does not exist as anything other than \"what is the rate of action of one thing compared to something else?\" \n\nThe part that is confusing to us is that even though it is obvious we can't \"access anything other than present experience\" embedded into this is the belief \"there is something other than present experience that could be accessed\". It is not possible to do so as it squarely *does not exist, will never exist, and cannot affect you*. \n\nFor example, when we worry about something bad that might happen tomorrow, we experience anxiety because we observe that thought and mistake it is a possible conjugation of reality that will occur later. Because we mistake our present imagination for \"an abstraction of the future\" we emotionally react to something that does not exist. If for example you looked at a baby bear, you would think \"oh look at the cute little bear\". If we reacted to the baby bear in the same way we do to our thoughts, we see the bear, imagine what the bear will be in 3 years, get scared and say \"better not approach the bear, it might hurt me\". The only reason we react to our imagination of the future is because we don't see \"an image in the present that poses no threat because it's not happening\" we see \"a possible future event that threatens me\". \n\nWhat has to be understood is that our imagination/thoughts are the object, there are no objects *within* thought that represent or abtract reality.","timestamp":"2024-10-10T20:30:59.828000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1211981659688148993","username":"joesfurniture","avatar":"203e3fa7d796a2550d84ffe29c9bb1bc","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"joesfurniture","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1293142914129465435","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1293112155922497567","channel_id":"1287624713618718831","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"\"My life is one thing. It is the instantaneous awareness of our conscious sensory experience.\"\n\nYes.\n\n*2. Answer 1, but also, it travels across time, like a bead on a string. There is an innate sense of continuity and chronology to our lives.*\n\nNo. It isn't a bead on a string. It appears that way, but that is the structure of ego. Examine this with all of your focus because this is the error that causes suffering and the misunderstanding of what life is. Disregard the rectangle, disregard the line. Consider and reconsider this deeply. There is no bead, there is no string, and there is no time. Don't accept what I'm saying or reject it, think about how you experience it and see for yourself.\n\nIt is incorrect because all conceptualizing of past and future is itself a product of present experience. All thoughts exist in your mind right now and so are part of present experience. It isn't that \"yeah yeah I get it, I can't *literally* think of the past or future\" it is much more important that you become aware that it it literally isn't possible at all to access anything other than present experience. Not as a \"haha gotcha on a technicality!\" but as an actual, real fact.","timestamp":"2024-10-08T07:26:02.834000+00:00","edited_timestamp":"2024-10-08T08:39:37.664000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1287624713618718831","message_id":"1287624713618718831","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]