[{"id":"1415117245822009436","channel_id":"1406645851883049090","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Both what you think about yourself and what you think the universe are made of are both objective, in that you could write them down, point at them, and be like \"This is what I think\". We could then discuss or debate those ideas, prove them right/wrong etc.. Subjective doesn't refer to what you think of yourself literally, it refers to how I do not know what your experience is as I don't experience it, but you do. You can try to objectify it with language all you want, but I will not be able to perceive life through your eyes. Similarly, it must be recognized that what you are yourself objectifying is itself your subjective experience. \n\nWhat needs to be inquired into is a personal understanding and examination of subjective experience, which, like you are describing, is difficult to ascertain and give concrete characteristic to. It is in fact the case that it is impossible to give objective quality to *your* conscious experience as all thinking and efforts to objectify it are of course happening within your subjective conscious experience itself. This is why when I say \"imagine what you did yesterday\" or \"imagine what you are going to do tomorrow\" you can close your eyes and visualize whatever you want, but the moment I say \"Imagine what is occurring right now in your experience\" this is impossible and the only way to do so is to open your eyes and be aware of it. All three of those are in fact the same fundamental action anyway, but again that is for the inquiry. \n\nI think more to your question, you are largely asking the question of whether or not consciousness is generating physical reality and there is no underlying material nature to it, like a dream, or if there is a concrete, material universe that has physically constructed the brain, and the brain then individually navigates reality like a bunch of world of warcraft characters running around the same physical map, and even if your character isn't there to perceive it, the game still exists regardless.\n\nThe simple answer is that the reason this is confusing is because we are certain there is a \"Me\" that is an object or participant *within* reality and are trying to place it. Idealists will say \"the 'Me' is consciousness and reality is projected from that\" whereas materialists will say the universe is an object and \"Me\" is an object in it. From my perspective, and this isn't a physical claim just what is intuitive, is that when there is a realization that there isn't an *object* that is \"Me\" either within or subsuming another object called \"the universe\", then it all essentially simplifies down into subjective reality being \"an occurrence\" so to speak. This might be a little confusing, but it is like saying if reality were an indefinite number of identical grains of sand moving around, in certain configurations the grains of sand will appear to create shapes and images. The sand castle generated is not *in* reality nor has it created reality because it looks at itself and sees it's made of sand, it *is* part of reality. In a similar sense, consciousness is itself a configuration of reality, it isn't \"in it\" or \"creating it\" but is itself an occurrence *of* it.","timestamp":"2025-09-09T23:30:43.011000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1406645851883049090","message_id":"1406645851883049090","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":14,"userName":"jamie0773"}]