[{"id":"1328200817383178250","channel_id":"1322552121752686613","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Different people have different stories. The commonalities are that the more neurotic and deeply harmful your beliefs about yourself are, the more dramatic any experience of relief from them will be. If you disentangle your beliefs all in one fell swoop, that is also more dramatic than if you are sort of trimming the branches for a while before uprooting the whole tree. \n\nThe end result is a fundamental uprooting of automatic relationship to things we imagine to affect \"Me\" - an example would be nightmares, which we literally *imagine* affect me, but there is no \"real\" danger, but we only realize it when we wake up. Instead of having to wake up from the nightmare they completely stop occurring, same with anxiety and emotional attachment to our thoughts/beliefs about ourselves. If this is the end outcome/permanent state then it's all the same result. I like the \"Tetris Moment\" metaphor where people often experience various Tetris moments have sudden epiphany or insight, but then another level starts and they keep inquiring or looking for more. Self-realization doesn't mean you suddenly know something new, but there is an automatic cessation of the game, not more blocks and a new level.","timestamp":"2025-01-13T03:15:51.642000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"90739397099548672","username":"mootoyoutoo","avatar":"56c90cfad66faf5648301f909365a863","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"MooToYouToo","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1322552121752686613","message_id":"1322552121752686613","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]