[{"id":"1405142161204445324","channel_id":"1398307766107639868","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Not super related but I'll go on my usual partially related rants.\n\nTo relate perhaps to the dream-like or subjective experience of sudden dramatic shift in perception:\n\nFrom my own experience, what self-realization came from was having a lifelong identity that was incredibly stable, and gradually changed in response to whatever what was happening, then suddenly *everything* was different and that identity didn't work anymore. This is identical to Religious beliefs, scientific beliefs, etc.,etc. \n\nTo relate to what you're saying, I use to have dreams about achieving money, relationship, or success. These beliefs caused imagined outcomes or dreams that were characterized by the extreme \"everything or nothing\" you described with the chair.  I would then wake up and be like *frick* it wasn't real. Now I never experience those dreams but it was something that was there before.\n\nSigmund Freud would say \"You are imagining a chair in the distance, it is representative of a place to be occupied be yourself, but you do not feel capable of occupying it, that is why it is a always in the distance. What is your relationship with authority and who you think you are?\"\n\nI view that as complete nonsense despite writing it myself, but to someone trapped in their beliefs, it is helpful and accurate. The actual solution to this nightmare is the same as the solution to the waking anxiety, which is asking and resolving what is the source of *all* the problems in the first place, which is the \"Me\".","timestamp":"2025-08-13T10:53:17.510000+00:00","edited_timestamp":"2025-08-13T10:54:29.788000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1398307766107639868","message_id":"1398307766107639868","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":24,"userName":"jamie0773"}]