[{"id":"1319892116721111170","channel_id":"1319781784182849647","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Like you're saying, when I use the word \"belief\" I usually mean it as the narrow part of it's definition meaning emotional attachment to an idea or perceived truth. I don't mean it to mean 'an opinion that I think is correct'. I think it's pedantic but I would sort of say that I almost always am referring to capital B Beliefs, which are all related to self-image, so things like political beliefs, relationship to other people/parents, religion, your past/future, and again, all things that cause emotion relationship or identification. Lower case b beliefs which just means \"my thoughts/opinion on something\" is just the natural function of thought/knowledge and is what it is. I have tons of opinions on things, many are probably wrong, and the only difference now is that there is absolutely no attachment to those opinions. I couldn't care less if I'm right or wrong about anything and will change my opinion immediately if I think it's appropriate. \n\nWith that said I would also suggest that the sort of \"capital B Beliefs\" do quite literally end, as thinking doesn't operate as a sort of knotted ball of deeply intertwined belief systems. A very salient example that I remember testing a couple hours after things clicked for me was asking myself \"what are you proud of?\" and the question made no sense. I understood exactly what the question meant as always, but there was no relationship to it at all because it immediately was just completely absurd to explain why accomplishing anything would make you imagine yourself as a completely improved/different person. It was, and still is analogous to saying \"I acted in a big movie, and that really made me think 'man, I sure acted in a big movie'\". That might sound a bit goofy, but it's very similar to when you're having a nightmare and then wake up, what was one second ago completely real and terrifying is immediately like \"oops lol not real\". Basically all \"Beliefs\" operate like this and essentially vanish permanently like nightmares. \n\nI'm not at all suggesting anyone should believe anything that I'm saying. The whole point of self-enquiry is to examine your own experience and that alone, but one of the reasons that historically self-realized people have often been persuasive, convincing, or #deep, is because everyone already is completely aware of what they're saying, because it is also their own experience, the only difference is that self-realized people don't *also* have a bunch of junk piled on top.","timestamp":"2024-12-21T05:00:03.036000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"694371572026179634","username":"bakewie","avatar":"36be20b242cb655e46dd0dc5593e2ab3","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319781784182849647","message_id":"1319781784182849647","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]