[{"id":"1262632083159908402","channel_id":"1262548807137230919","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think there's probably a  little bit of a personality type that would make someone more or less likely to pursue the avenue given the current amount of information/environment around it, but I think with more clear communication it can be much less so. Same sort of thing as how Religious beliefs were everywhere 500 years ago, and now with the internet and science communication the more fundamental beliefs are pretty quickly thrown away by younger people. \n\nFor me there was even a big element of luck or maybe inevitability kind of like the George Gurdgieff stuff I described, where I was so ensconced in self-improvement and a conventional knowledge based approach to everything, that when I finally reached a culmination of all of that I kinda realized \"oh, my whole framework must be wrong\". Sort of like an actor winning an Oscar or an athlete winning a championship and still being unhappy, you kinda think \"oh, something must be wrong here\". I personally felt I was looking at the last place I thought there would be an answer, while a lot of people haven't really looked in many places in the first place or don't personally have a lot of emotional problems in their life so don't bother or care too much to try to find an answer somewhere. If someone has an ego, but it's very mild and they are overall happy in their life, then they aren't likely to feel the need for resolution, and likely won't be that motivated to resolve something. I'll again emphasize that there is no barrier to self-realization as it is fundamentally *not* believing something not some new idea or knowledge.\n\nThe reason people \"try and fail\" is usually always because they don't have an accurate understanding of what they are not going to get. Self-realization is a bit like exploring a cave looking for treasure, and then finally realizing there has never been any treasure at all, why did you believe there was?? The difficulty is that in order to explore the whole cave, not always, but usually it requires you to actually have tried other exploration methods. For me, reading philosophy, psychology, self-improvement, and having some degree of conventional success resulted in being absolutely certain that *those things* would not result in what I wanted, and so there is a sort of narrowing of focus that is automatically applied to a new endeavour. I think there a lot of people who view SR as sort of a \"fix all\" and misplace what it will do for them. If for example you wish you had more money, acquiring knowledge and a skill in an area you're interested in is much more valuable, but if you haven't tried that, a lot of people will be like \"oh, once I'm self-realized I'll just manifest it\" and then you're already doomed to start.","timestamp":"2024-07-16T04:49:07.195000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1262548807137230919","message_id":"1262548807137230919","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]