[{"id":"1310854243162394645","channel_id":"1307814042714509483","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean personally I have never had any emotional response from things that are funny and still don't. They were and still are similar to finding something novel, useful or beautiful. I was listening to some Joey Diaz highlights recently and literally couldn't stop laughing just by myself because he's so fucking unhinged, but my view of laughter is just a communication mechanism that what is being said is novel, clever, and intelligent and laughter is a form of communal encouragement and expressing an impression of contextual value in what the other person said. \n\nIt's like if someone said \"I think, therefore I am\" and Joey Diaz was like \"Who's this motherfucker think he is?\" It's just perfectly harmonizing what the person said with the actual mutual communication that audience wants, which is skilled expression of compassion/intelligence. There's no real reason for there to be an emotion involved. \n\nI don't really know because it isn't personal experience, but I would imagine that when people experience positive emotion from comedy or other \"good ideas\" it is because they've built an ego/self-image that believes they lack an experience of that kind of thing in their life and wish they had more, and so when that need is met they feel relief and happiness, and their is a feeling of love for someone or something that gives them that. It's similar to how some people genuinely feel emotionally ecstatic at raves or listening to music. I might be wrong about that and I just have never personally experienced it, but I've never felt relief, comfort, or happiness from those things.","timestamp":"2024-11-26T06:26:46.064000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1307814042714509483","message_id":"1307814042714509483","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]