[{"id":"1359688513087344721","channel_id":"1351233302442279055","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The best way to understand this is to look at how a computer stores information. All of it exists in the present state of the hard drive. At a previous \"now\" you might have configured it that way, but when you etched that memory it was \"now\" and when you access it now it is \"now\". \n\nIt can be helpful to remember that everything you experience is just the human brain. If you died and we took your brain out and put it on the table it is just a funny jello like substance. That funny jello like substance was itself generating everything you called \"me and my life\" but like a projector or computer monitor, it was always just generating a present moment electrical signal you/it was aware of. There are millions of things you have experienced but have now literally forgotten. What is the difference between a birthday party you remember and a birthday party you have forgotten? Was one real and one not real? Was one the past and the other not the past? Both were real configurations of present reality at some point, but neither exists anymore unless it is configured in your present brain as memory, which is the result of the physical and electrical structure of your brain as it currently is, not an external \"past\". \n\nThe brain on the table is obviously just a physical object that exists right now, it cannot possible produce \"the past\" or \"the future\" because anything it produces it is doing right now. You just have to realize how/why this is true while you are the brain and experiencing it rather than by looking at one on the table outside of you.","timestamp":"2025-04-10T00:36:43.311000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1351233302442279055","message_id":"1353572593952624772","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1351797438104469528","channel_id":"1351233302442279055","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> \"Doesn't the ability to remember things - remember what I was, or what sensory perception I was aware of - prove the existence of time?\"\n\nNo it doesn't, as memory is something that exists now in your brain. When you say \"I uploaded a photo to my computer 5 years ago\" and \"I uploaded a photo to my computer 5 days ago\", that can be true, but when you uploaded the 5 years ago photo, it was the present. When you uploaded the 5 days ago photo it was the present, and when you access any of them, it is the present. It exists as the present configuration of information in the hard drive. This is not a technicality or a \"gotcha\". It is genuinely real and not a trick. All that exists is the present state of the computer's hard drive that produces information for you to read. It is similar to a how a trees rings are accumulated and incorporated into its being, they aren't \"remembered\" they are literally part of its present self at is it. \n\nIt is like when you fall asleep at night and dream of what you perceive as the past or future, and then wake up and you're like \"oh shit I'm back to the present\". No, you were always in the present, it was always just your brain processing information and memory, you just interpreted it mistakenly as \"my past or future\" when it was actually just you laying asleep in your bed dreaming. If I were to ask you \"okay, you can imagine the past and future, tell me in what year do your dreams take place?\" and then any of us would be like \"uhhhh, well they don't really have a certain *time* they take place in\" and it's the same for waking state, the only real time anything occurs is \"Now\". Again, this is not a technicality, it is an encouragement to just check your own experience and discover. \n\nNot trying to be forcing or clever, but take a quote like this that is allegedly from Albert Einstein, which is:\n\n> \"The distinction between past, present, and future is only a stubbornly persistent illusion\" \n\n\nI am in no way suggesting I have anywhere near the level of physics insight as him at all, but what I would suggest is whether apocryphal or not, the quote might resonate, then what I'm suggesting is if physics says \"fuck dude, time ain't really real, it's just material interactions and the rate they occur as measured by the thought-measurement we call time\" then what I'm suggesting from another angle is \"yeah, don't know about that, but the illusion about time can end sujectively.\"","timestamp":"2025-03-19T06:00:24.426000+00:00","edited_timestamp":"2025-03-20T03:52:41.883000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1351233302442279055","message_id":"1351233302442279055","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]