[{"id":"1318494158444298272","channel_id":"1316687292378644550","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Maybe a little bit, but we all learn new knowledge or insights through refining our own thoughts in response to other people's. If no one else existed we wouldn't even know a language at all. I would have never got anywhere if not for just trying to learn or understand other people as well. When I say that people are making some form of \"progress\" I really just mean it in the same way I recognized my own \"progress\" in the past. At the time I thought \"oh man, I am learning so much knowledge this guy is sharing, it's so cool and new, this will really help me\". Then when this starting clicking I realized \"oh fuck I didn't actually learn anything at all lol\", but it was necessary to, using an old metaphor \"explore the cave to learn what is/isn't in it\". \n\nRegarding my own communication I guess you'd really have to see where I started with this hahaha. 3 years ago I thought \"well, I better think about this for a couple weeks so I don't embarrass myself\". And the way I came up with describing it was \"severing the umbilical cord between thought and emotions\". If I'm being honest, that's not necessarily *that* wrong technically, but holy fuck does that make people worry about you because it sounds so psychotic. You can imagine that a gradual move from that to \"yeah well really it is a cessation of emotional attachment to an unreal and imagined self-identity\" is a bit more palatable and psychologically accurate.\n\nI think the biggest thing that I try to accomplish now is just to instill a sense of \"there actually is something here, there is something you are looking for, it is real, it's really important to you, it's not spiritual or alternative nonsense. It is not this, it is roughly over there >, but you have to resolve it yourself.\"","timestamp":"2024-12-17T08:25:03.810000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316687292378644550","message_id":"1316771032232890428","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1316703386300710924","channel_id":"1316687292378644550","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Haha, no it doesn't bother me at all. I get a lot out of it too because I learn a lot about how to communicate more effectively. It also surprises me that so many people feel they aren't making any progress because there hasn't been any changes in their emotions or thought patterns, but from the questions they're asking the plane is picking up speed on the runway so to speak. \n\nI don't know if this is encouragement, but also from a sort of self-amusement perspective I find it funny when people are like \"fuck I just don't get this self-inquiry thing, maybe I'll never get it. I'll just go do something else for a while\" and I'm like \"hehe, you're still doing it bitch hehehe\". So you don't need to worry about that technically hahahah.\n\nThe only thing that's sort of lame for me is just how hard it is to communicate IRL, and so I basically never talk about it. When I have in the past it's usually somewhat inflammatory for the other person or conjures up a sort of \"woo\" in their mind that I'd rather avoid.","timestamp":"2024-12-12T09:49:10.460000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316687292378644550","message_id":"1316687292378644550","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]