[{"id":"1310477696626720788","channel_id":"1308491690130149426","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah no worries, and just keep in mind these are just my opinions on other people's ideas. Self-realization as a phenomenon is what I try to communicate, but I'm happy to comment on other stuff like this from my own perspective.","timestamp":"2024-11-25T05:30:30.374000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"983455552598323332","username":"jellifish34","avatar":"41cc0991821040dfac2c4ed7e25e8710","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"jellifish34","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1308491690130149426","message_id":"1308492319137333340","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1310477341985603636","channel_id":"1308491690130149426","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'm not familiar with Nietzsche's work that closely, but his criticism rings to me a lot like how stoicism always sounds very \"cold and masculine\" and is fundamentally about learning to control yourself and overcome your internal objections to reality, whereas his philosophies of power and overcoming externalities to be in complete control of your physical self and environment is just the opposite side of the same self-image. One is \"have complete internal control to minimize emotional reactivity\" and the other is \"have complete control over physical externalities in order to prevent things from happening that emotionally hurt me\". Neither is necessary as there doesn't need to be anything that emotionally hurts you. They are both caused by beliefs about how you think things should be being violated by others thoughts or actions, which is your self-invented self-image/ego.\n> \n> Lastly, while you emphasize SR isn’t psychology, self-image seems to parallel Freud’s ego and superego. Do you think Freud’s views on its functions are fundamentally mistaken?\n\nIt's parallel largely because when a lot of Eastern speakers started melding with Western psychology they didn't really have good translations for \"mind\" or \"self\" in English and so a lot of Western loan-words started being used, at least as far as I'm aware. Ego being the main one that seems to have stuck. \n\nI think Freud's views are interesting but strike me as pretty \"astrology\"-esque. Pretty groundbreaking at the time to start to categorize stuff, but in my view not the most accurate. In the context of self-inquiry or what is basically the observation and analysis of your own subjective experience, it is more helpful to just say \"yeah, ego in psychology is not the same as 'ego' for this\". \n\nEgo in this context is fundamentally the entirety of your psychological attachments. It's why the word \"mind\" was used, because it is a much larger structure than we think it is. The best word would have been \"self-knowledge\" but that then invokes the sense in people that they are going to lose their \"self-knowledge\" but really what happens is that you realize you never had any self-knowledge, you are yourself, and you have knowledge, but none of it was ever about yourself, only about other things.","timestamp":"2024-11-25T05:29:05.821000+00:00","edited_timestamp":"2024-11-25T05:36:08.582000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1310474771502469160","channel_id":"1308491690130149426","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Appreciate the questions!\n\n> Self-image and human progress: Without a self-image, I feel content but life seems bland and lethargic (no more ambition, just doing whatever gives me the easiest dopamine). \n\nSelf-image is either present or it isn't; it isn't possible to act with or without it volitionally. Whatever you imagine you are going to lose is not what you're going to lose, other than the very act of \"imagining what I'm going to lose\" is itself self-image/ego, which is your emotional attachment to (false) beliefs. \n\n> Isn't self-image serving important functional uses (instead of pointing to facts in reality), much like language? In a society where self-image is the norm, it feels essential for innovation and collaboration. Could humans have achieved progress—planes, poetry, and media—without self-images and ambitions, even if these come from emotionally-charged beliefs and causes suffering?\n\nIt serves no useful function at all only because it is a recursion of a cognitive function that already includes it, we just haven't understood why and so do everything twice. We imagine our lives and also try to immediately perceive our lives at the same time, these conflict, and causes emotional strife and confusion. It is very similar to touching a hot pan, getting burned, and then every time you even think of a hot pan you burn yourself again. The belief that self-image is important is usually because we assume that having no self-image means not being aware that the pan will burn you again. You don't lose any cognitive capacity, you just realize \"Oh, feeling pain every time I thought of a hot pan was needless suffering, I didn't need the emotion to know not to touch it\". \n\nIf humans operated without emotional attachment to beliefs at all, progress would likely have been faster and more focused in certain areas and slower in others, because there would not have been self-aggrandizement, desire for praise, desire to impress, shaming etc. that leads people away from genuinely engaging with the activities they prefer naturally and towards things they feel shamed into. The feeling of \"I really want to do X, but I'm scared to do it\" doesn't occur, but you are still able to assess necessary challenges and make intelligent decisions. You might still go to med school because your parents are pressuring you and financial support is on the line, but you don't go to med school because \"I'm scared to tell my parents no\" as an example. \n\n> SR as ‘natural’ reality: You describe SR as returning to how we’ve “always been underneath.” How do you respond to Nietzsche’s critique of Stoicism, which calls living “according to Nature” self-delusional and tyrannical? He argues that life inherently involves valuing and striving, so is SR also imposing an interpretation of nature?\n\nI'm saying this as someone who felt the only life philosophy I ever found until a few years ago that I couldn't criticize was stoicism, but it never felt right and I couldn't figure out why at the time.Stoicism misses the mark only because it is essentially saying \"spend your whole life cultivating your self-knowledge so you can act according to it as closely as possible.\" Which means aligning your self-image as closely as possible to your actual natural inclinations. What is actually the case is your self-knowledge can completely evaporate and you realize \"oh, it's impossible to not act according to your nature, you're doing it every single moment of your life\" the realization causes you to understand that you were always trying to align an imaginary compass needle with an imaginary one.","timestamp":"2024-11-25T05:18:52.970000+00:00","edited_timestamp":"2024-11-25T05:41:46.527000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"983455552598323332","username":"jellifish34","avatar":"41cc0991821040dfac2c4ed7e25e8710","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"jellifish34","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1308491690130149426","message_id":"1308491690130149426","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]