[{"id":"1346071840711508020","channel_id":"1340516931630923816","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If there's something in particular you'd like to share I'd be happy to look at it. \n\nFrom my own perspective, part of my own look into this content and what led me to this realization in the first place was through western philosophy. I was personally looking at the philosophy of how to live and how to act and it led me to Stoicism, which I fundamentally couldn't criticize, but felt was cold. \n\nAgain, happy to comment on any particulars, but the ultimate resolution that became clear to me later was that the highest dictum of stoicism was \"live according to nature\" and I could never really figure out any reason why that was wrong, but it didn't feel healthy or warming. The answer that I'm now aware of viscerally is that fundamentally it is impossible not to live according to your nature. The effort to live your whole life in order to intellectually resolve what \"My nature\" is was the mistake. The stoic ideal is actually incredibly close, but so far away, in that it is essentially saying \"Make your ego/self-image/self-knowledge identical to your perception\". It is only missing the piece of \"if they are identical you never needed one of them\". \n\nFrom my own perspective nearly every other ancient \"how to live\" philosophy is partial and misses a lot of stuff within the realm of knowledge, but stoicism nails it to the highest level, but is still incomplete, because completeness is its own erasure. \n\nThis is still a modern view, so I'll address it, but the idea is that at 25, you partially know who you are, at 45, you have a better idea, and 70, you basically get it, and at 90, if you really have reflected on your life, finally you understand your being. Self-realization causes an automatic realization that when you are 25, you understand *exactly* what you are at 25. You have no idea about your future because it doesn't exist yet. It is a change in understanding from \"I am spending my life trying to understand what I am\" to \"I understand what I am, and so I am experiencing it as it occurs to me\". It is really the antithesis of \"Youth is wasted on the young\" to \"self-report, sorry to hear you experienced that\".","timestamp":"2025-03-03T10:48:55.631000+00:00","edited_timestamp":"2025-03-03T10:51:06.477000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1340516931630923816","message_id":"1340516931630923816","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"}]