[{"id":"1253078972531740673","channel_id":"1252634595841806396","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You also need knowledge to be aware that a tiger is dangerous. You've probably seen that meme where a kid points at a bear and they overlay the \"Can I pet that dawg??\" clip. It is necessary to have memory in order to avoid recurring physical pain, humans are just much better at abstraction than any other creature and so when an animal with claws hurts you, we can abstract that to basically \"anything that resembles claws or sharp objects\" whereas an unintelligent animal might only be able to understand \"stay away from that creature next time\"\n\nOnce any sensory perception of a dangerous situation has been experienced or understood, it becomes information that we can automatically react to without thought. This applies to the automatic sense of fear when you accidentally drive through a red light, and it also applies to playing sports at a high level, and it applies to peering over a dangerous drop. \n\nThe reason I say that self-realization is \"the cessation of emotional relationship to self-imagination\" and then say \"in practice this means you lose 99% of emotional relationship to thinking\" is because the latter is more understandable and true, but only by volume because 99% of the time we experience fear it is in relationship to our self-image not actual danger like you've described. In situations involving actual physical danger you will have an ongoing sense of fear in response to how all of your senses/intelligence/memory perceive the particular danger in that circumstance. \n\nIn practice this means it is not about a \"time delay\" in that if there is no sense of past or future then what you are reacting to is \"How physically dangerous is this situation right now?\" A time bomb with 15 seconds to go off is a far more dangerous situation than a time bomb with 30 minutes to go off, but both are perceived as \"relative to right now, how dangerous is this?\" \n\nI will emphasize there isn't a conscious \"error\" that causes anxiety, it is the whole structure of self-image that has gone unexamined that causes the error to constantly occur, like distorted glasses. The error that repeatedly occurs is emotionally reacting not to a physically dangerous situation, but to one we believe could be pyschologically dangerous.","timestamp":"2024-06-19T20:08:28.133000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]