[{"id":"1260342369577074738","channel_id":"1259920368349610045","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Replace the word \"I imagine\" with \"I physically drew a picture on a piece of paper\". \n\nIf you were to say \"I'm currently drawing a picture on a piece of paper of my crush hooking up with someone else, where' the time in that?\" the answer is that like all thought, there isn't any, you are just drawing a kinky picture right now. Without seeing that however, you will interpret a time component, which is *how does this potential event affect me?* which will have direct impact on your perception of yourself which in our self-image, is believed to persist through time. It is your beliefs about yourself that involve \"past me, present me, and future me\" that primarily are the components of self-image. \n\nIf you are anxious that your crush might be hooking up with someone else, the reason there is anxiety is because there is a feared outcome. The feared outcome isn't whether or not this fact is true, the fear is how you will have to reconfigure your beliefs about yourself, your life, and your crush depending on the nature of the information. The event isn't important, it is the perception of who you think you are through time that will be affected.\n\nSmall example that might be more straightforward, a self-image based fear of someone we know really well dying is not caused by the concern of them actually being dead, it is related to how badly we believe their death would affect our own future. The phrase *I don't know what I'd do without you* is not empathetic or sympathetic, it's very sad, but is purely an expression of helplessness and attachment, and a concern for our own future.","timestamp":"2024-07-09T21:10:36.936000+00:00","edited_timestamp":"2024-07-09T21:18:00.985000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259920368349610045","message_id":"1259920368349610045","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]