[{"id":"1415103585137463366","channel_id":"1405221553980834003","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@aspectofthenerd self-improvement is fine if you understand it for what it is, which is skill acquisition or a form of physical action. If you think it is a means of going from unhappy to happy it isn't. This can be tricky though because as long as your ego/self-image is operating, then your mood is determined by your intellectual evaluation of how good your life is. This means your brain will try to measure how \"good\" your life and behaviour is and that will set your mood. So if you are obese and don't like your life, then go to the gym and get in shape, you will likely \"feel better\" psychologically, but this is because when most people are obese they evaluate this as \"bad\" and feel sad that their actions and life are not how they would like it to be. When they get in shape they will no longer believe their actions and body image are \"bad\" and so the sadness goes away in relationship to that belief. Most people experience this in some way in their life, and then assume if they just physically \"fix\" all their problems by making external reality match their internal beliefs, then they will feel better and better up to an imagined infinity. This is not the case as the actual end result of making external reality perfectly match your projected beliefs is the cessation of all negative emotions, which is just neutral. It creates a small surge of love in compensation when the suffering is relieved, and we call this \"happiness\" but it is not actually a positive emotion naturally occurring, it is relief that your suffering has ended. A great example of this is money. Ask literally any rich person if money buys you happiness and all of them say no, but every poor person can't even conceptualize that. Nearly everyone thinks money makes you happy because if you are broke, acquiring money gives a sense of relief, which is felt as happiness. If however you can pay all your bills just fine, there is no suffering to relieve and money does not make you happy, you just rest at neutral. \n\nPsychological component aside, many aspects of what people call \"self-improvement\" I do and enjoy, but it is not seen as someone changing or fixing myself, it is just an action that I would like to do. I go to the gym because I like the activity and feel it makes you look better, which I prefer. things like dressing better or working on your writing/public speaking are just activities you can get better at if you'd like.","timestamp":"2025-09-09T22:36:26.050000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"710160487886880870","username":"aspectofthenerd","avatar":"b11414cef3de8a52da6aac604c6924a7","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"ENDER","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1405221553980834003","message_id":"1405221553980834003","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]