[{"id":"1328208524781686897","channel_id":"1321168409672548352","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah sure. The main place it comes up for young people is uncertainty, the worry of wasting time, and the consequential regret. Let's say you're 21 and are thinking about going into your 4th year of chemistry at university or dropping out to start a microbrewery with your older friend who's in the industry. You are trying to maximize your enjoyment, security, but also maybe getting a big potential upside from this start-up. You know that you could just do one more year of chemistry and have a solid fall-back degree, but if you're not in early on this brewpub then you might not get the offer again in a year. \n\nYou can imagine if the brewery fails, then you're a year or more behind where you wore before, probably in debt, and will feel stupid for not seeing it coming. If you instead do your degree and the business takes off, you'll feel insane regret for missing your big chance. \n\nMost people are constantly thinking things like this between career, relationships, and where they live etc. The problem is that they are paralyzed in their action because they are emotionally attached to the outcomes they have in thought, and there is always the threat of \"what if?\" being weighed and measured emotionally. These commitments of blocks of time of our life being \"wasted\" or \"regretted' are one example of the splints being set up by the plant. \n\nWhat is not recognized at the absolute *initial* level is that what your brain is doing is taking all available information and creating a probability matrix and weighing it automatically. The reason it is so hard to decide between the two is because your brain is literally saying \"yeah either option is appealing for different reasons\". If another friend came in and said \"want to be the producer for our band?\" you'd be like \"lol no I don't even know how to do that\" and discard it immediately. Even if they became insanely successful you wouldn't really care because you couldn't do that job. Back to our scenario though, because we don't see this as \"either option seems good\" and instead see it as \"oh god *I* have to figure out the right choice\" we both waste time and worry about not being correct, constantly seeking counsel and feeling \"oh god I have to figure it out\". We also don't realize that \"figuring it out\" is literally part of this natural growth cycle and not an annoying pause between the important events. \n\nIn order to combat this kind of thing, we cope by saying stuff like \"ok, what if I try the business for 3 months and if it all goes to shit I'll stop and go back to school for the second semester, then I'll only be a half year behind, yeah that's a good compromise\". We then go do the business and 1 week in we realize that our brewer friend is a complete asshole boss and the job is way too labour intensive and we peace out with no regrets. The \"splint\" that we created was a complete waste of time, and only served as a coping mechanism to rationalize taking a risk that we we wanted to, but were scared to take. New information became immediately available which was \"oh, I hadn't considered the working conditions, how important having a good boss was, and the nature of the job itself, I was just thinking about the money and time lol\". \n\nThe point isn't to try new things because you don't know what will happen, the point is that it can be recognized that when you're imagining two binary outcomes (degree vs start-up) they are not real outcomes, they are imaginary realities you have invented in your mind and mistaken for the actual paths themselves, which creates emotional response and avoidance/fear.\n\nThere's a good expression in trading/finance that represents this which is \"I spent 6 months planning to make a knee-jerk decision\"","timestamp":"2025-01-13T03:46:29.229000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"455065309439590400","username":"shravan21","avatar":"fccb761842d477949e8200768d459a7c","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ShravaN21","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1321168409672548352","message_id":"1322845046328004608","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1322038269952917596","channel_id":"1321168409672548352","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah it's great. It is the same thing meant by \"the seed becomes the tree\". In that no matter what you do, the acorn has only one future outcome and that is to become the oak tree, it can't become anything else. \n\nWhat people misinterpret by this is that \"the future is already pre-determined\" which is not the assertion because there isn't a future in the first place. It's a much more practical and simple observation which is just \"obviously if you plant a lemon seed, you will get a lemon tree\" It is not saying \"the exact specifications of the future lemon tree have already been pre-determined\".\n\nExtending the metaphor, he just means that if the acorn stresses in its life trying to figure out how to grow a leaf, or that its branches don't look like the lemon tree over there, or it keeps ruminating on how it fucked up it's sapling years, then it is worrying over complete misconceptions about itself. \n\nI haven't used this one for a while, but its like if a vine climbing up a lattice were to plan where it's going to grow next and then builds a splint to attach to itself in order to make sure it grows exactly where it wants. It then repeats this process to grow up the lattice in exactly the way it desires. This is what people do with their thoughts/goals/imagination of the future. If instead the vine realized \"oh, I am making these splints to direct myself to where I already want to go, why am I wasting my time?\" it would stop doing that entirely and just grow how it wanted to grow, resulting it in more effectively ending up exactly where it wanted to in the first place.","timestamp":"2024-12-27T03:08:05.840000+00:00","edited_timestamp":"2024-12-27T04:12:15.428000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"455065309439590400","username":"shravan21","avatar":"fccb761842d477949e8200768d459a7c","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ShravaN21","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":true,"type":19,"message_reference":{"type":0,"channel_id":"1321168409672548352","message_id":"1321168409672548352","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]