[{"id":"1287562860347523123","channel_id":"1253100643975958669","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You are trying to analyze the meaning of the words and their significance, you want to instead address the fundamental identity and what *you* refer to when you say \"I\" or \"Me\". For example, we are all aware that when we say \"I\" we are referring to our conscious experience that is separate from another person. The reason we have neurotic emotions connected to our beliefs about ourselves is because we convert everything we have ever experienced into a mental model we also call \"Me\" and emotionally react to threats to that imagined model, which is our self-image or ego. \n\nThe reason this occurs is because we have not directly addressed or understood what the fundamentally identity of \"I\" actually is, causing us to think we are both our immediate conscious experience and also our imagination of ourselves. You are only the first one and the second is a subset of the first, but this is what has to be examined. The fundamental curiosity that I want to instill with the question stems from first noticing that while we are obviously one thing, we actually believe we are many things we identify with in thought, namely our past, future, and characteristics we believe we have. How does this entity relate to our actual conscious experience and why have we created it? Is it necessary at all?","timestamp":"2024-09-22T23:55:07.668000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1264037351408144497","username":"arrryan0599","avatar":"51dbde70f92b843c858e25e03310e4ca","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Arrryan","avatar_decoration_data":{"asset":"a_e08b43c436272bc2c1e6ae85e71ab884","sku_id":"1402472280596152340","expires_at":null},"collectibles":{"nameplate":{"sku_id":"1377377712028516443","asset":"nameplates/nameplates_v2/spirit_moon/","label":"COLLECTIBLES_NAMEPLATES_V2_SPIRIT_MOON_A11Y","palette":"violet"}},"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253100643975958669","message_id":"1287556660243599482","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"},{"id":"1287507940089008212","channel_id":"1253100643975958669","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's the difference between thinking of the word \"Mom\" vs thinking of the person. If you are just repeating \"I\" over and over again you are chanting a ritual, but the intention behind it is what is meant to be held and consciously addressed. \n\nThe most direct means of finding out what the self is is by simply directly discovering in thought what it is. Think *directly* about \"I\" and what \"I\" is and the discovery that it is a word that actually doesn't point to any object, but is instead a direct and permanent experience results in self-realization.","timestamp":"2024-09-22T20:16:53.658000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253100643975958669","message_id":"1282547152182317080","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1253105449952088185","channel_id":"1253100643975958669","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What he's saying is meant to help someone by giving them something to aim at in the same spirit as someone would say \"Give chess all your attention and understanding will follow\". By giving your intelligence a target it may be very confused, but it will always be making an effort to try to resolve the question being asked and make some form progress or deeper understanding over time. Ramana suggests holding onto the \"I\" thought because it is ultimately the only thing that must be completely understood and all the other psychological baggage will automatically fall away when the insight into what \"Me\" is unravels. This isn't to say walk around every day thinking \"I\", \"I\", \"I\", \"I\", which is no different than crossing your legs and saying \"Ohmmmm\". Nothing is fundamentally going to happen as a result of that other than perhaps relaxing you, as ultimately you are just sitting and making noises. \n\nRamana is sometimes called \"The Mystic's Mystic\" because nearly everything he says is correct from a self-realized perspective, but if you aren't there most of what he says is indistinguishable from guru spiritualism or religious dogma. Great guy to read, but make sure you cast a wide net of other speakers too because it's easy to get lost imagining self-realization is some magical state when you listen to him.\n\nThe teaching of what he's saying is bit like telling someone what they're looking for is \"Home\". It's still entirely up to the person to figure out what that is, how to get there, what they're missing, and resolve their own misunderstandings, but when they finally figure it out they will say \"ah, he was right. This is home\". \n\nSelf-realization is the same in that when you arrive there you realize \"Oh man what was I thinking, I've known myself the whole time\" the problem is that we also believe we are a host of identifications other than our self which distorts our view of the world, our emotions, and self-understanding.","timestamp":"2024-06-19T21:53:40.842000+00:00","edited_timestamp":"2024-06-19T21:55:03.894000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]