[{"id":"1262635055633924127","channel_id":"1261342667862835270","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You are not anything other than the immediate sensory perception that you are aware of. This doesn't mean \"when I look at the tree, I am the tree\" that is obviously nonsense, it is realizing that the signal you are experiencing, in this case 'sight' is what you are. When you are thinking of something you are thought, when you are seeing something you are sight, when you are hearing something you are sound. The effort to create an \"object\" that is doing the hearing or doing the seeing is false because the only way you can do that is by using another sense to invent it. If you had no sensory experience you would not exist. \n\nI think it's also more relevant to address the search for \"so what does this mean?\" component. We can take for example the component of \"what does this mean?\" and use an analogy related to meaning that a lot of people ask, which is \"What is the meaning of life?\" and basically ask \"why are you asking?\"\n\nFundamentally, there is no meaning of life because you are life. There is no meaning to life because life is what you are and what is unfolding every second you exist. Life is a fact, it isn't a meaning. This is not usually a satisfactory answer to someone asking that question, because what they actually mean is \"I am unhappy, but when I feel I am doing something that matters, I am very motivated and content. What is the meaning of life so I can do that and then I'll be happy?\" This is a completely different question. \n\nThe reason it's important to understand what you fundamentally are is not related to having a new belief or fact to help you deal with a situation or create meaning, it results in a fundamental change in psychological processing, because for example, if I were to say \"The only thing you are is immediate sensory perception\". If we just take this as a hypothetical, it would imply that when you are anxious about an upcoming social event, or angry about the next presidential candidate, you might tell yourself \"well, if I'm just immediate sensory experience, then why does this bother me??\" The important part is that you don't believe you are, and so these events do significantly bother you.  The meaning/implication is if you get down to the absolute root of \"What/who am I?\" these events and experiences literally stop having psychological effect permanently.","timestamp":"2024-07-16T05:00:55.888000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1261342667862835270","message_id":"1261342667862835270","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]