[{"id":"1435745235711033426","channel_id":"1427012694439104684","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What started my self-inquiry stint was a few months prior to that experience when I lost a lot of money trading and felt a big rift between my imagined identity and what was presently experienced in front of my eyes and other than being like \"lol that was bad\" there was a sense of \"something is really strange between my actual life and what I thought it was\". \n\nI forget if it was before or after this I tried psychedelics a bit because I started reading about all this sort of meditation/inquiry/spiritual/psychedelic stuff and they all have overlapping communities. That was a really interesting experience partially because of the hallucination component which kinda gives you a sense of how intelligent and interconnected the brain is beyond our active intellect, but it was more the feeling of love I got from that which opened my eyes a little bit. \n\nThen later I had the two day experience I've described and it really made me like \"oh, this is completely sober and such an intense, complete feeling of love and fulfillment I can't believe this exists\". In a way you can say psychedelics are kind of a \"magical\" experience for someone very skeptical/clinical in their attitude, but that experience was definitely mystical. That encouraged me because it was caused by the resolution of my long-held belief in the need to be successful and afterwards resulted in a little chip being completely gone, but I assumed that it was a \"satori experience\" and that mystical state could be permanently achieved and that's what \"enlightenment\" was. \n\nNot at all what it is, that state is just emotional love and only comes from relief from long-held suffering or what is essentially life fulfillment (for that point in your life), but self-realization is real but is as I've described before as the cessation of insecurity and neuroticism entirely (no beliefs about yourself or the world). \n\nIf it is another angle for you to approach, you can ask yourself what you believe to be true about your life and instead of asking yourself why it must be wrong, which is trying to convince yourself of another belief, just ask yourself \"well, let's assume I'm 100% absolutely correct about how I think my life, what are the implications of that?\". If we use my trading loss as an example, the main part that made me be like \"the fuck?\" is that I thought \"damn, if I don't make this money back I'm going to be miserable\" but given the situation I also was like \"that literally might take me 10 or 20 years\". If I just assume I'm correct then I'd say \"Ok, it is impossible for me to feel happy for the next 20 years\" I would look at that and say \"that is fucking stupid I must be wrong about something\". To be fair this was pretty obvious so it made it easier, but you can do the same with your own beliefs or dissatisfactions. A good example is a breakup. If your highschool girlfriend breaks up with you, it's common for a guy to be like \"She was the one and I will never experience love like that again\", then ask yourself \"wow, that's so true, tell me how you know that's true?\" \"well, she was like 7/10 pretty and liked pokemon like me\", \"wow that is irreplaceable, she must have never done anything to annoy you\", \"well actually no she annoyed me quite a bit\", and then after a while your might realize \"well, not thrilled about it but I guess I was over-reacting\". It's this same process that is talk therapy, and again self-inquiry is just drilling further down.","timestamp":"2025-11-05T21:38:59.050000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1427012694439104684","message_id":"1427012694439104684","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":25,"userName":"jamie0773"}]