[{"id":"1328236432434790483","channel_id":"1318539042983247903","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Imagine we are business partners and we are implementing a new plan for the next 6 months. I think it is a terrible plan and we're going to fail catastrophically. I am very depressed and anxious nearly all the time, and I am angry at you because I think you're going ahead with harmful ideas that will ruin things for everyon. You think it is a great idea and we're going to make a ton of money. We haven't done anything yet. Who is right? Who is wrong? Is either person right or wrong?\n\nThe actual answer is that literally nothing has happened yet. It is a complete falsity to have any relationship to a perceived outcome because nothing has occurred. This is what I'm referring to, which is an emotional attachment to past regret/mistakes, and future anticipation of outcomes. Neither are real, and entirely contingent upon our own imagination of what you think is true. This imagination is always false whether it actually happens or not. \n\nBoth people can express their current opinions, but it is only necessary to realize you are expressing your current forecast, and not a future outcome. I am not suggesting this as an ideal that we all say \"yeah yeah, I guess it hasn't happened yet so I can't pretend I know what will happen\" I am saying this must be perceived as actual reality for there to be no emotional hurt.","timestamp":"2025-01-13T05:37:22.932000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"617160836083089427","username":"steamedhams4974","avatar":"2fd24eb46640f2e5813dadbf3c8fb6b6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"steamed hams","avatar_decoration_data":{"asset":"a_b9f89cd88eabf437777bf35f55e6126f","sku_id":"1402472280642289775","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"185590609631903755","identity_enabled":true,"tag":"Ыend","badge":"3e1695b59c9f89e89258e7c42cc4ef5e"},"primary_guild":{"identity_guild_id":"185590609631903755","identity_enabled":true,"tag":"Ыend","badge":"3e1695b59c9f89e89258e7c42cc4ef5e"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318539042983247903","message_id":"1325925590024454316","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":33,"userName":"jamie0773"},{"id":"1322034476175331389","channel_id":"1318539042983247903","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Not exactly the right description of me but I'll run with those beats hahaha.\n\nIt is correct that when you get what you want you will be happy, but this is only because the belief that demands the action stops operating and you experience temporary relief, then your brain will extrapolate your present situation into a future forecast and demand you then get that, causing unhappiness/ambition/stress to quickly reoccur. The underlying cause is the belief that your life must progress and improve in an objectively measurable and socially valuable way. It's rooted in the belief that you are consciously acting to \"build\" your life rather than identifying yourself as the entity experiencing it as it occurs. The analogy I always use is it's like a seed thinking it has to \"figure out how to become the tree\" when in reality is just automatically occurs to it no matter what it does. \n\nIt's this belief that then draws a line from your \"past self\" through your present identity, and then extrapolates an imagined ideal future for you to live up to. The reason it is partially helpful to actually achieve your goals is to see that essentially \"no matter where you go, there you are\". You are still just the same sensory experience but now in a nicer house/car, etc. It is still necessary to experience it yourself in the way that you want to in order to realize it to be the case. If it helps, this is still self-enquiry. Everything you do is self-enquiry, not just sitting and thinking about it. It's analogous to how guys like Ramana say that formal meditation is for novices. You are always meditating at every moment of your existence, but formal meditation can be a helpful introduction to figuring it out, self-enquiry in the way we talk about it here is the same. \n\n\nWith that said, the automatic assumption is \"oh, wanting money/nice stuff is wrong and there is some change in my brain that will make me not care about that anymore\", that is also a belief that isn't the case. If there is no self-image and no pressure to create something for yourself, the right amount of effort/conventional success is an automatic response that occurs in direct relationship to other people in your society/culture/environment. Metaphorically, the automatic function of you as an individual is analogous to a neuron in a brain, in that your function is based on your own innate qualities that are acting in response to the other neurons around you. There is nothing wrong at all with making a lot of money or living a materialistic/glamorous lifestyle if you want to. The more important part is figuring out if you actually do want to or if it's the result of trying to resolve existing problems in your life through creating an imagined future outcome. Just becasue it might be partially this doesn't mean \"oh I should have nothing\" is therefore true. It is usually the case if you really think you'd like to be conventionally successful there is a partial truth that has then been extrapolated. \n\nThere is a very \"spiritual\" quote that I like, which is \"the universe doesn't give you what you want, it gives you what you need\". This is usually used by hippie type people to do anything but actually work hard towards an external goal, but it is actually a banger of a quote because if you were to ask me now how much money/external success I would like to have the automatic response would be exactly what I need to do the things I would like to do.","timestamp":"2024-12-27T02:53:01.333000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318539042983247903","message_id":"1318539042983247903","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":31,"userName":"jamie0773"}]