[{"id":"1334837872246788116","channel_id":"1329476495587934300","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey sorry for taking ages to reply.\n\nWhat you're saying makes a lot of sense and is an in depth, intellectual examination of your own experience. I am not suggesting that what you are doing or experiencing is incorrect, but what I'm suggesting is that there is a more primordial realization around the nature of what actually is the \"Me\" who subjectively experiences all of those things that causes the emotional and thought experience you've described to no longer occur. \n\nWhat we are trying to examine is not \"oh geez I shouldn't be experiencing anxiety or worry in this situation\" it is instead \"I *do* experience xyz, it is what it is, now I will try to understand what that subjective experience actually is\". \n\n\nIf we take an example like you've described, imagine you give a presentation, it doesn't go so well, and you are embarrassed. What I'm suggesting is that I used to be exactly the same way and so totally get that, but now if I were to give a presentation, it doesn't go so well, I'd be like \"eh, that really sucked, I didn't really have a positive impact, but I'll try to do better next time\" and there is no embarrassment. The reason for this is a fundamental change in emotional function that results from a completely separate inquiry which is the \"What is 'Me' or 'I'\" that I have always experienced in my life. \n\nNot to be super dramatic, because it's not like that, but the concern and anxiety over a class presentation completely evaporates when there is awareness around what your existence as a human fundamentally is. This doesn't mean the woo-woo \"I'm a soul experiencing the world!\" it means literally \"you exist, obviously, so what is that exists that you are?\" Not where you came from, not what happens after you die or some nonsense belief, what, exactly, are you right now? The answer to this question, subjectively, causes things like our anxiety, sadness, or ambition around our life goals or how other people think of us to evaporate completely automatically, while still being happy and content engaging fully with life.","timestamp":"2025-01-31T10:49:08.832000+00:00","edited_timestamp":"2025-01-31T10:50:43.593000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"233007836429418496","username":"hunter221","avatar":"0fbda587679ccbdff20f31ec1cd9847f","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"Hunter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1329476495587934300","message_id":"1329476495587934300","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"}]