[{"id":"1316677693315743829","channel_id":"1316409817694470144","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean the most surefire way would be to hook them up to some sort of brain-imaging device, then make them scroll twitter or imagine embarrassing or sad things and see if there is activation in the part of your brain that has emotional response. \n\nIn terms of practical questions to just ask someone, it would be if they ever have any emotionally stressful dreams or experience anxiety or anger at all. You could ask them what they think about that they regret, are proud of, or makes them worry. They also have those \"big five personality tests\" that you can take, and all the neuroticism questions in particular don't really make any sense because they are all based on assumptions of a base level of social anxiety/worry. \n\nIn general it's very hard to be like \"damn that person must be hella enlightened\" because you don't suddenly start acting a certain way, you stop experiencing reactivity and emotional stress to things you did before. The only thing I can think of that is very unusual for most people is having no reactivity to a conventionally \"negative\" event or communication at all. Like if you spill wine on someone's clothes, usually there is a split second reaction of anger or panic, then they can catch themselves and respond in a civil way. It's really rare for an insult, accident, or bad news not to even register in someone in a way that they even subconsciously externally communicate it. \n\nBut also in general if you were trying to get other people to be self-realized it's the same as on this Discord, in that anyone can say \"yo I had the click guys\" and I have no idea if it's true. You can generally figure it out pretty quickly by how they try to communicate something, but it's not really my concern. You can be literally Jesus Christ or Buddha in here if you're annoying everyone you're getting a 24h suspension lmao.","timestamp":"2024-12-12T08:07:04.775000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316409817694470144","message_id":"1316409817694470144","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]