[{"id":"1272415665097015349","channel_id":"1265536080992669808","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"In my opinion the best indicator that you're moving in the right direction so to speak is that gradually over time you are able to understand with more clarity what other people are trying to communicate on the topic and see the misunderstandings in things you've previously communicated yourself, which is effectively the the process of learning. If this is occurring then even if you are coming at a concept or idea you are not understanding, you will have a different approach or angle that facilitates further insight or prompts a different question or follow-up. I've emphasized before that this process is a lot more physiological than people realize, whereas we usually think \"I am the one doing the learning\" and want to just hammer out hours and hours of thinking or analysis in one day, when in reality there's more of a natural demand and searching for information for your brain to automatically metabolize and learn from itself over a period of time. \n\nAs I've said before the final realizations requires a sort of sudden insight that what you were pursuing or trying to accomplish the whole time was a bit like chasing your own shadow, but it is almost always necessary to go down that route to understand why and what you thought you were pursuing or trying to understand in the first place.","timestamp":"2024-08-12T04:45:34.899000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1265536080992669808","message_id":"1265536080992669808","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"}]