[{"id":"1318502106289668147","channel_id":"1311796230137057431","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@wtfaustin Thanks Austin for the ping. \n\nThe fundamental misunderstanding undergirding all of them is the belief that there are objects that exist in thought. For example, Einstein was brilliant, but none of his discoveries were new physical phenomena. They were always occurring, all the time, since the dawn of our universe (as far as we know). What he actually discovered was a way of translating observable physical phenomena into a form of human language/thought. Other human beings could then look at that thought and say \"holy shit, that explains exactly what I experience too, it is correct!\". What Einstein discovered was a completely new human thought, not a completely new physical relationship. He discovered/created the knowledge, not the thing itself.\n\nThe same theme is why Santa, Religious belief (specific characteristics of a 'God'), and beliefs about \"Me\", are all false and misunderstood. It all comes down to a mistaken characteristic of thought that thought does not have, which is the belief that thought abstracts and points to real objects, when in reality it doesn't point to anything, it itself is just a very fluid and amorphous object. Similar to how a photograph can *appear* to be nearly anything, but it itself is a singular object that has no connection to another thing. \n\nThis is the reason that for me, and what is a fairly common \"trigger\" realization, is seeing that ten years ago you were \"Me, now\", today you are \"Me, now\" and in ten years you will be \"Me, now\". You don't actually ever experience anything else you ever think about because you can't think about now, which is the only thing you actually experience. I know this is a bit frustrating, but it is like instead of seeing the carrot that is always in front of you and the alligator snapping at your heels, you instead look at the apparatus and realize \"oh, the carrot is on a stick, I can never touch it\" and \"oh, the alligators are on a leash they can't ever touch me\". Then instantly you realize \"oh shit, no point in either even existing to me at all, it makes no difference\". And that is the sort of \"end of the past and future\" and residing in the present that is often talked about.","timestamp":"2024-12-17T08:56:38.724000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"589819099090255894","username":"cyu3281","avatar":"adeb6222dd06ae9c5fefa05b91054d97","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Steam","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1311796230137057431","message_id":"1311796230137057431","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":61,"userName":"jamie0773"}]