[{"id":"1292746770828361738","channel_id":"1292723880904884290","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Good timing, I've been playing hella hearthstone while treadmilling so I'm also down with the \"fuck what do I listen to in the background\" camp lol. \n\n*JK is often like “do it fool! Before it’s too late!” While other teachers are like “there’s nothing to be done, don’t worry about it and just live your life deliberately and honestly”*\n\nYeah you're totally right in that it seems contradictory. Ramana for example says lofty things like (paraphrasing) \"try like you might, that which is meant to happen will happen, and that which isn't will not\". I know you've heard this a quadrillion times, but What he and all of us are referring to in that particular context is the analogy I use a lot which is \"the acorn becomes the oak tree, it literally can't be anything else\". The point being that even though an acorn is drastically physically different than an oak tree, in the same way your life as a child will be drastically different from everything you do/create/explore/experience by the time you're 50, nevertheless you just did what *Austin* was naturally going to do given the reality you interact/interacted with. It's not pre-determined literally, it's just the baby becoming the adult it already is automatically becoming. \n\nThe reason there is confusion is because that is referring to the objective nature of life and who you are physically. It is again a pretty banal and an \"obvious\" (not deep) point if you really get down to brass tacks. When anyone is referring to self-realization the phenomenon, then comes the notions like Ramana has said as (paraphrasing) \"The greatest gift you can bestow upon the world is your own self-realization\" which is not exactly truly accurate in some senses, but in the most \"comedian's comedian\" or \"mystic's mystic\" way it is accurate: there is nothing more important in an individual's life *to that individual* than self-realization because it is psychologically their own release from their psychological sheathing. It allows them to genuinely experience no emotional suffering and cracks open what is basically a new emotional DLC which is the capacity to experience genuine emotional love in relationship to sensory experience. If you've been listening to Osho or some other speakers this is what \"true love\" refers to and is something I had literally never experienced in the past before outside of rare event related \"experiences\" that are related to resolving big problems or drugs/psychedelics. \n\nIn this case every speaker suggests \"yes, it is extremely important you dedicate your time and attention to try to understand and do self-inquiry. Self-realization is not just the most important thing in your life, it is what you are already trying to experience emotionally through other means but you have misdirected your attention\". The reason I and other speakers on this particular point sometimes seem a bit blasé is because it goes back to the previous paragraph. Not trying to sound lofty, it isn't like that, but there is automatic awareness that even though we understand what you are looking for, you the the individual/seeker might not currently be aware and need to have other experiences or ideas first to know what you are even looking for. Again, not trying to make it sound special, but from my own perspective, like the old \"you can't help someone who doesn't want to be helped\" there is a more important \"you can't give someone an answer to a question they aren't asking\" because the only means of giving you or anyone an answer is for you to say \"yes, that is correct, thank you\" meaning it is actually your idea already, you have just come to realize it.","timestamp":"2024-10-07T07:14:08.239000+00:00","edited_timestamp":"2024-10-07T07:16:26.358000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292723880904884290","message_id":"1292723880904884290","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]