[{"id":"1298610264756846595","channel_id":"1292920925582266458","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What J.K. is referring to is - as you're largely addressing - is that nearly all external physical conflicts arise from deeply internal misunderstandings (conflicts) =. If you' don't have problems in your own life, you don't seek to resolve anything through forcing others to behave or act in a certain way. \n\nJ.K. and myself are not suggesting that you should take a situation you normally react to and \"not react to it\", but instead start to question why you react to it in the first place. \n\nIt is the case that he's referring to a genuine \"change in understanding\" that causes a change in emotion and behaviour to happen automatically, but even if that is not the case for the individual it is still valuable to consider because movement towards it can occur. \n\nThe difficulty of \"bro, just tell me what to do\" is that there is nothing to do. It is already the case that most people believe things about themselves and their lives that are harmful, and what is being communicated is the effort to analyze and end those beliefs.","timestamp":"2024-10-23T11:33:34.130000+00:00","edited_timestamp":"2024-10-23T11:34:14.800000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292920925582266458","message_id":"1296888780992548896","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"},{"id":"1296752613437472809","channel_id":"1292920925582266458","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@pikachu_is_boss Just in the context of this point, I would add that the purpose of the question \"What am I?\" or \"Who am I?\" or \"What is 'Me'?\" is as an introductory question like \"Economics 101\" that is meant to plant a seed of \"you didn't know this exists, but this is something to be understood too\". It is the \"once upon a time\" and the rest is what you're doing and inquiring into, and there's no wrong way to do it. It's just a new field of inquiry that has always existed (as it is literally your own existence), but I'd say myself in the past and most people in the world have never considered. The resolution is also in the same question, and I understand everyone's frustration that there isn't a \"method\" but it functionally can't work that way unfortunately.","timestamp":"2024-10-18T08:31:55.542000+00:00","edited_timestamp":"2024-10-18T08:33:20.581000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"617160836083089427","username":"steamedhams4974","avatar":"2fd24eb46640f2e5813dadbf3c8fb6b6","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"steamed hams","avatar_decoration_data":{"asset":"a_b9f89cd88eabf437777bf35f55e6126f","sku_id":"1402472280642289775","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"185590609631903755","identity_enabled":true,"tag":"Ыend","badge":"3e1695b59c9f89e89258e7c42cc4ef5e"},"primary_guild":{"identity_guild_id":"185590609631903755","identity_enabled":true,"tag":"Ыend","badge":"3e1695b59c9f89e89258e7c42cc4ef5e"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292920925582266458","message_id":"1295925102919155743","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"},{"id":"1294113104157741129","channel_id":"1292920925582266458","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah hopefully most of it's covered in the essay I think going back to the \"being really fucking honest with yourself\" part, there needs to be emphasis that you aren't trying to get an outcome, you are trying to see exactly what you think, then *automatically* you will notice errors in what you believe and change it. \n\nAn analogy would be if someone said \"I want to be a better podcaster, any tips?\" and the only important tip is talk for ten minutes on any subject uninterrupted into a microphone, (I highly recommend trying it with this subject) then listen to it back and you will automatically notice a dozen things you don't like, which will cause you to automatically fix it over the next few iterations. You might instantly for example realize \"oh fuck I was way too far away from the microphone\" which is a mistake you weren't even worried about at the time but became instantly aware of and fix. \n\nIn your particular example, I would encourage you to flesh out what your describing and explore it more over time. I think when you said *\"When I look at my own beliefs written out as honestly as possible, and really consider that if they were never fulfilled I would never be happy, the only conclusions I can draw are something like \"man, I'm an awful person\"\"* Like I think even just from this you have to notice that this already wouldn't make sense to almost anyone you said this to, or if they said it to you you would equally think \"uh, what?\". Even though I know you're glossing over the details, it doesn't make sense that you could start with \"I have unfulfilled wants that make me unhappy...So anyway my conclusion is I'm an awful person\". It's like, uh... what are those unfulfilled desires you glossed over, nuclear genocide?\" \n\nEven if it is for nuclear genocide, the notion of \"I'm an awful person\" or \"It would be better if I didn't think this way\" *that itself doesn't make sense* as it necessitates the belief that such an act is not a good or desirable thing, yet also believing you need to do it. There *must* be resolution to this through further examination in the way we've talked about because they are directly contradictory yet are both things we want.","timestamp":"2024-10-11T01:43:27.490000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292920925582266458","message_id":"1294097823842832444","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1294057080197484605","channel_id":"1292920925582266458","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@creikey \n\nI can give a couple of examples, but you have to do what subjectively makes sense to you or else it's not personally relevant and won't change anything. \n\nFirst, like Guy mentioned, you are addressing your own beliefs similar to how you would if you were talking to a therapist, in that the most important thing when you are trying to figure out and resolve your beliefs is being absolutely honest with yourself. You cannot resolve anything if you skirt around the issue and soften your opinions for fear of expressing something socially innapropriate. If you are talking about someone you are envious of for example, don't say to yourself \"I dislike how they act arrogantly in front of others\" because that's not actually what you believe. Instead directly say \"I am angry at them because they are more successful than me but I don't think they deserve it as much as I do\" or \"I am angry at them for flaunting their success because they are misleading people into thinking they're cooler than they are and I want to correct that mistake by lowering other people's opinion of them\". \n\nTake a belief about someone's experience of time like \"I am currently discontent with my life (ambitious) because I want to make a lot of money in the future so other guys respect me and girls will be attracted to me. Right now I don't have either\". What you will notice is that our instinct to resolving this belief is never to question the time component, but instead question the other parts. Bring this up to nearly anyone and they will immediately reject the idea \"girls are attracted to money\" or \"you need money for guys to respect you\". While this part is also inaccurate, what you actually need to be asked (or ask yourself) is \"what if you never get more money than you have now?\" The only answer you can possibly give is \"then I will never be happy\", because that is the only resolution to your current state of discontent as defined by the belief. The only other alternative is \"if I try really hard to make more money and can't, then I will give up and settle for something more mediocre\" which is how most people cope with that belief eventually, just not consciously until it happens. \n\nNevertheless, if you are anxious, lonely and insecure, and believe that you must get something you don't have, which is your relationship with time, but knew that you would not get it, then you can never be happy. I would hope it is obvious that this intuitively *does not make sense* so the zooming out can occur because we become aware that something must be wrong with our understanding or belief about our past and future. The main point here is to *become aware* that the base structure of seeing our life as a constant movement towards an imagined goal in the future is itself the digging of a hole that then demands to be filled, rather than itself being additive in a positive way. \n\nTake another example like \"My Dad died a year ago, and it still depresses me to this day\". Again we take this question and don't necessarily need to go into \"why are you so attached to him?\" even though that is really good thing to inquire into as well, but instead say \"so when are you going to be over it?\" and the unfortunate answer is that usually people say \"never, but it's been getting better\". How? If he died yesterday or died 15 years ago why is it any better now than then? Usually people say \"I have learned to deal with it and met new wonderful people in my life\". Ok, but that doesn't answer the question. Why does the duration between now and then make any difference at all? Why does the memory of yesterday harm you more than the memory of 10 years ago even if both are of the same event? \n\nWhile I'll leave this one up to you, the hint is that it's because we don't actually care about a past event at all, we care about how disrupted our self-image is from the event - the event is not the cause of sadness.","timestamp":"2024-10-10T22:00:50.337000+00:00","edited_timestamp":"2024-10-10T22:04:21.649000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292920925582266458","message_id":"1293296477887791104","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1293128229376229378","channel_id":"1292920925582266458","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I am making a lot of assumptions here because you are your own individual with your own beliefs, but generally speaking what you are trying to resolve with self-inquiry is the false relationship you have with time. You have invented an identity called \"Me\" that specifically has characteristic and duration that affects your relationships, friends, past, future, and self-identity. Self-realization is about resolving and permanently dissolving the incorrect relationship you have emotionally invented with your past and future. If you are asking \"what am I attacking? What am I looking at??\" the answer is time. You are trying to understand and resolve your relationship psychologically with time. The reason we all cringe at the idea of \"what even is time bro???\" is the sign you need to take it seriuosly. Self-realization comes from that.","timestamp":"2024-10-08T08:29:55.044000+00:00","edited_timestamp":"2024-10-08T08:43:15.847000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292920925582266458","message_id":"1292920925582266458","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]