[{"id":"1395878625965904034","channel_id":"1390788850913247342","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There's no how other than self-inquiry that eventually leads to subjective lightbulb moment that causes the physiological structure to operate differently and automatically. \n\nFor me it was realizing that there is no need to be concerned about an imagined past or future self because they are never subjectively experienced. Ten years ago I was \"Me\" now, today I am \"Me\" now, and in ten years I will be \"Me\" now. All experience is contained within exactly what is happened at the present moment and there is no other experience and never has been. The ego/self-image is really just the effort to convert \"Me\" into a thought and then imagine it over and over again in the past and future, but this is both unnecessary and can't be done because the only \"Me\" that exists is exactly what you're currently aware of, and so you can't grab it with thought to project anywhere. \n\nThe reason your self-image exists is an unresolved recursion where you know that you are your own concious experience that's happening right now, but within that concious experience you can think, and thinking can contain what you're concious experience has been or will be. This is like the infinite reflections in an elevator type thing because it just chases its own tail forever. It is resolvable however in examining and realizing why thought cannot contain consciousness or be \"about\" conscious subjective experience.","timestamp":"2025-07-18T21:23:18.601000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1008171159113699399","username":"randy_dev","avatar":"50e6c5e16ebad18fc3a65e70b9b4fb58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"randy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1390788850913247342","message_id":"1390788850913247342","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]