[{"id":"1307795189099794514","channel_id":"1302005810552897606","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What you're experiencing is the action of your self-image trying to resolve itself. The reason it is constantly active is because currently it thinks the solution to itself is in external resolution to its internal confusion. You could say that what your self-image wants to do is set the world straight, when resolution is actually in setting yourself straight. \n\nRuminations are your past, and plans for the future are obviously the future. What your brain is trying to do is find a way to solve the problems of the past by aligning them with present action that threads into an idealized future. Essentially you currently believe that resolution to any unease you have is the complete intelligent alignment of your past, present, and future into a single integrated whole. \n\nBecause this is impossible, your brain has to constantly iterate and improve its current model of this relationship in order to help you act. What is it necessary is to understand that the resolution to this ongoing relationship is not in conforming to this alignment, but realizing it cannot ever be aligned or resolved. It is not possible to ever \"have your ducks in a row\" psychologically, because both your ruminations and idealizations are imaginary. There has to be an observation of \"this system of operation doesn't actually work, there must be something I have missed\". \n\nThe realization is that all of these functions are already completely integrated, and this looping/recursive function is unnecessary. Ten years ago you were \"Me, Now\", today you are \"Me, Now\", and in ten years you will be \"Me, Now\". You don't need to ruminate and you don't need to imagine the future unless by intention because everything is already solved in responding to the immediate fact occurring to you now. Resolving this \"inwardly\" instead of trying to solve your environment is what silences your inner dialogue and allows it to strictly be responsive and outwardly oriented, rather than looping internally.","timestamp":"2024-11-17T19:51:10.741000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302005810552897606","message_id":"1307275779922595870","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":19,"userName":"jamie0773"},{"id":"1306682863508389958","channel_id":"1302005810552897606","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The sort of \"chasing your own tail\" feeling is just that - like capybara said - absolutely everything that you think you are is your self-image. Saying \"hmmm, my suffering is caused by my self-image, how do I get rid of it?\" is your self-image talking to itself. It is not possible to think about yourself and it not be your self-image. To go past this you have to observe the structure of *all* thinking itself, which is a moment to moment sensory perception. What you are going to realize is that all thinking occurs one word or image at a time, instantaneously *to you*, you are never in it. \n\nAs an example, this is intuitive with all our other senses. What you are currently seeing is always *what is happening now*. You can't see yourself, yourself is the one seeing. All vision, hearing, and touch is like a direct signal from the outside world streaming into you right now that you are aware of. Just for the sake of imagination, visualize that all thought is the combination of all these senses being turned around and shot straight out. All of this happens in the current moment, about the current moment, and only contains the current moment. This is in contrast to \"thinking about myself\" which is a confusion about how this signal works where instead of shooting straight out of you directly in the moment, we imagine it loops back around and circulates inside of your head, or bends through space and time to different objects or past/future. \n\nLast analogy, but imagine you were playing a virtual reality game as a human, and you just held down a button to move forward, held down a button to hear, and instead of pulling out a keyboard to type a complex message, there was just a button called \"think\". When you don't need to think you just move the character around. When you need to hear, you push the hearing button, and when you need to think or talk you press the thinking button. What we are trying to recognize is thought as a linear and automatic sensory process with no \"content\" inside of it.","timestamp":"2024-11-14T18:11:11.654000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1302005810552897606","message_id":"1302005810552897606","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":16,"userName":"jamie0773"}]