[{"id":"1260354031478636636","channel_id":"1259770568815808582","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah, just pursue what seems to be fruitful and what you think is intelligent at the time!","timestamp":"2024-07-09T21:56:57.350000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259770568815808582","message_id":"1259827792938401844","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"},{"id":"1259827418902822964","channel_id":"1259770568815808582","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"With regards to incremental improvement it is exactly the same as anything else. Would it be helpful to read one self help book a week? For some yes, for some no. Would it be helpful to take therapy? For some yes, for some no. Will some people do nothing and just kind of \"grow out of\" their problems? Some yes some no. Will some people do self-inquiry and resolve big psychological problems while not going all the way? Some yes, some no. Will some turn it into a cure-all spiritual belief and end up on a wild goose hunt? Some yes some no. It all depends on your individual circumstance and beliefs about your life, and how those things will cause you to reconfigure those beliefs and circumstances. For example, if some people were given a million dollars tomorrow, in a few months they would lose all of it and become even more depressed than before, for others it would completely turn their life around and be a great benefit. Some people get jacked and finally feel confident in their lives, while others get jacked, are still depressed, and start chasing dragons that make their mental and physical health worse. In all of these cases, things are happening to you, and you are forming opinions and beliefs about them that form a psychological state, and understanding the cause of that is ever-present and affects your whole life.","timestamp":"2024-07-08T11:04:23.128000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259770568815808582","message_id":"1259821165988282411","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":18,"userName":"jamie0773"},{"id":"1259820459059314780","channel_id":"1259770568815808582","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If you take someone who is living in terrible suffering and sadness because they believe in hell, and they believe they are a horrible person, their life is a mess, nothing went they way they wanted or hoped, and they are certainly believe they are sentenced to eternal damnation, all I can communicate to them is \"Hell doesn't exist\". \n\nIt is exactly the same as self-realization, as it is just seeing that all of your past, your future, and beliefs about yourself are not real, and are self-invented. This doesn't mean \"your thoughts aren't literally real\" like we all are aware of. In the same way a devout Christian will argue tooth and nail for their belief in heaven and hell, it's not because they don't acknowledge they might not be provable, but because it goes right down to their core of their lifelong self-identity, past experiences, belief in god, and all sorts of other memories and ideas. The more entrenched someone's views, the more difficult it is for them to remove themselves from it, but ultimately there is only one source of the suffering and it is the conflict in one's own beliefs about themselves and their life. If what I'm describing doesn't resonate with you and doesn't seem like something appropriate, by all means I encourage you to try other things and avenues, and they might be really helpful. It might be better to choose something more practical and revisit some of this stuff later through fresh eyes, it isn't going anywhere and incremental self-improvement and those types of things might be more appropriate.\n\nAnd to your last question, sort of, in that it can help you resolve your own beliefs only because the whole point is to question your beliefs. There is no tool or method acting upon you, you're doing it. It's like saying \"will studying help me learn something?\" It depends entirely on you.","timestamp":"2024-07-08T10:36:43.772000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259770568815808582","message_id":"1259817447654166609","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"},{"id":"1259809016905990194","channel_id":"1259770568815808582","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Extending the tree metaphor, conventionally, thoughts and emotions are perceived as separate phenomena, but ones that appear in parallel: \"I thought about my traumatic past, and that thought made me sad\". This is *perceived* as correct, but only because they haven't been examined. These appear as two separate leaves on the tree, but are joined by the branch, which are \"Beliefs\". An example of a belief is the belief in Heaven/Hell or more practical, the belief that social interaction contains some sort of risk to our identity. The former results in emotional reaction to thoughts we are sinning and will be punished, and the latter causes anxiety in social situations or the imagination of how others perceive us. Both are created by our specific, subjective beliefs about either. One is an obvious \"Religious belief\" while the other is a less obvious \"What I think is true about my life, who I am, and the threat of other people's judgment or behaviour harming that\". Both are beliefs and based on the same thing which is our self-image.\n\nWhere the branches join is the trunk, which is the identity we call \"Me\", which is everything we conceptualize our life as. Our past, our future, our identity, our social status, our age, our attractiveness, our political beliefs, what we think is right, what we think is wrong, our religion, our dreams, our regrets, absolutely everything we believe is attached to \"Me and my life\" this our self-image or ego, which is the entirety of self-knowledge (what we know about ourselves). \n\nWhat exists beneath this is the connection between our entire self-concept of existence, which is the entirety of sensory perception of thought, and the actual, genuine \"Me\" that experiences thought. Resolving the circular conflict between \"my conscious experience of reality\" which occurs in the present, and the imagined perception of our past, future, and identity that exists in thought, results in self-realization, which is the \"goal\" of self-inquiry, and is the complete psychological uprooting of the tree, and consequently there are no beliefs about oneself, and no neurotic emotion arises \"when you think about yourself\", because you realize it has always been a mistake to do so in the past. There can be small and helpful insights that help an individual, the same way therapy can be both helpful or harmful to someone, but there isn't anything to do or practice, just an effort to understand. \n\nThe reason I wanted to lay out a sort of framework for the whole thing is to contextualize the essay, and to sort of address what we're trying to resolve. You have to drill into those sort of layers in your perceptual experience, and while there really aren't layers or levels to it, conceptually I wanted to emphasize the sort of scope we're trying to cover and separate it from \"ok so breath in and focus on your breath\" type of thing, or \"ok so the past and future aren't real, just my thought so how do I use that?\".","timestamp":"2024-07-08T09:51:15.750000+00:00","edited_timestamp":"2024-07-08T09:57:00.232000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1259808999184797706","channel_id":"1259770568815808582","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Right, it's not supposed to translate into incremental improvements or meant to be \"used\" in some way. It's not about emptying your mind or focusing on anything, but when completely understood there will be instant change in emotional processing that results in no emotional relationship to self-imagination. In essence there is no avoidance of thinking or imagination, it is that they don't result in anxiety/anger/etc. arising. \n\nFrom where you're coming from maybe I could sort of describe the layers of what we're trying to examine. In conventional talk-therapy, the reason many people find this helpful is because it causes them to express and navigate their beliefs, opinions, and memories about their life. Most people have never done this because it is emotionally uncomfortable, and so can help them \"prune the leaves on the tree\" of their beliefs and maladaptive behaviours by bringing to their conscious awareness \"oh shit, why was I doing *that* or thinking *this* that clearly makes no sense\". That's usually the end goal of talk-therapy because it makes someone's very dire life substantially better to the point they can self-repair the physically problematic components. Usually there isn't considered to be more than this because both the practitioner and the patient likely both suffer from anxiety, anger, jealousy, envy, pride, guilt, regret and have both been taught and assume that's just life, and all you can do is improve or cope with it. This isn't the case, but beginning to think about and understand your own subjective experience of your life is the start of self-inquiry. This is also around where most Western meditative or spiritual practices address, as it's generally utilized as a form of self-treatment for emotional qualms or as a tool for helping us cope with stressful or undesired emotions. I don't have a problem with either of these tools, and meditation when taught well is just another angle to come at what I'm trying to communicate in the end.","timestamp":"2024-07-08T09:51:11.525000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259770568815808582","message_id":"1259770568815808582","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]