[{"id":"1449419389194469527","channel_id":"1445487300187263107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"He's describing the realization that ends the structure I've described in the comment you've responded to. He is completely correct: self-realization is an instantaneous and permanent event that is realized now and happens now and then persists for every now that is experienced. \n\nWhat he means and what I mean is that there is absolutely no *other time* that things occur. This is tremendously hard to reconcile because we view our lives as an 80+ year monolith of information. You have years and years of childhood and years and years of future life you will experience. I am saying, and he is saying, that you don't. You have exactly present perception. This includes present memory, which is those other things. \n\nYou have present perception, which includes present memory. Present memory is your past and your projected imagination of the future.\n\nThis means you have your present perception of your imagined past and future. \n\nThis means the *only* thing you are aware of is present perception. \n\nThis is his assertion, and my assertion, that if you want to be enlightened/self-realized/yapyapyap/endyourinsecurity you must realize it has to occur now, because nothing else has ever happened to you. It's not a philsophical logical argument, it's saying \"if you can accept that perhaps your past and future do not exist, then you might be able to accept reality is not what you thought it was, and your brain will too\"\n\nNot to be harsh, but an *anti-example* of this is when someone says \"I have been traumantized\" or \"I will be successful\". Both of these are absolutely, completely, irreconcilable, because they are by definition unable to be fulfilled. You can't fix the past and you can't live up to the future. The reason is not because you aren't good enough as most people assume about their present, mediocre behaviour, but because there is no future ideal or past failure. If you can accept you are exactly are as you are and that is always what you have been the problem is solved, but our self-image/ego says \"no, I am special and good and have been hurt and will be better\".","timestamp":"2025-12-13T15:15:11.294000+00:00","edited_timestamp":"2025-12-13T15:18:15.540000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"104977073616982016","username":"sephiroth02","avatar":"87547bb46246d0c9733365dd4d3a1f41","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"seppy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1445487300187263107","message_id":"1447681509724131567","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1449416623919464749","channel_id":"1445487300187263107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*so you´re basically saying there´s no reason to be frustrated or upset because I´m not getting it right now?*\n\nYou will feel whatever you feel as you figure it out. \n\n*But do you think deliberatly engaging with the topic speeds up that process or would you rather say that anyone will engage with it as much as they can naturally given their experiences and predispositions?*\n\nThey are both the same, but to be more practical, yes you need to engage. The only reason I'm saying they're the same is because your whole life is in service of self-realization and self-actualization. If you use the metaphor of a sunflower, if I plant the seed, it grows into the flower. this is inevitable. If I give it a consciousness, perhaps it has some greater freedom, volatility, energy efficiency, etc, but it becomes a sunflower no matter what it does, that tape runs its course. You are the same way and whether you get it or not, you will act yourself out as a human being. At every moment you are experiencing that growth, learning, and life, and realizing what that itself is is always available at any moment as much as it as any other moment. From that point of view it might not be obvious when you are a sprout, but it might become more obvious as you have a few leaves or your first petal, but it becomes more clear. Eventually the awareness of the sunflower aligns with the sunflower and you're like \"oh, lol, that makes sense\", and there is nothing else to worry about.","timestamp":"2025-12-13T15:04:12.001000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1445487300187263107","message_id":"1447338862241251388","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1447176720657420329","channel_id":"1445487300187263107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Maybe it would be helpful if I summed it up this way: your self-image/ego is your desire to be loved. Your actual nature is *to* love. \n\nEverything you do in your life externally is only effective if it is to express love for another (humanity/family), and all internal confusion and neuroticism is trying to resolve our beliefs in order to convince ourselves that others love us.\n\nself-realization is the cessation of the belief you need to be loved and that is the end of self-identity. \n\nIt's not something you need to \"get right now\" it's something your brain is trying to resolve and will get there as it experiences and learns about itself. You and no one needs to get it right now, it's part of human development in our present day and something to resolve with time and experience whenever it finally there.","timestamp":"2025-12-07T10:43:37.448000+00:00","edited_timestamp":"2025-12-07T10:47:14.097000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"505078593492090901","username":"xylca","avatar":"6512d934b75485a9c3adf2acba90f353","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jon","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1445487300187263107","message_id":"1445487300187263107","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]