[{"id":"1328999892265341029","channel_id":"1328431566606827591","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I really had two \"A-ha\" moments, the first was very experiential and blissful, and after a few days it felt like a huge burden of ambition about what my life was supposed to be was lifted off my shoulders, but there was still other beliefs about myself operating that caused things like anxiety, etc. to still occur. \n\nThe realization at the time was \"oh, my life is like a video game, I can just do whatever I want, there's no need to succeed or live up to any expectations\" and that relieved the beliefs causing stress/tension around success, which caused guilt or a feeling I wasn't always acting efficiently or using my time properly. From this I was like \"oh, maybe this J.K. guy and others are actually saying something more and I should keep looking\". \n\nThe second \"click\" was 3 or 4 months later and was way more subtle but permanent and actually changed the way I thought/experienced things. This occurred when I was thinking \"Oh, I am Me. In ten years I will be Me, ten years ago I was Me, and I am always just Me\" and that basically caused me to realize there was no need for experiencing time or duration in my life at all and a huge pocket of memory in my brain just shut off. Because this is usually a bit scary sounding I use the analogy of realizing you were running two clients of the same game at the same time and you finally alt-tabbed and closed one, then everything runs perfectly. This wasn't a dramatic realization at the time but caused all neurotic emotions to completely end, all nightmares, all thoughts about myself, etc. Metaphorically it feels like cleaning your home to be perfectly clean, then it is just always like that and never gets messy again. From that place there was a few years (somewhat ongoing) of making intellectual sense of what occurred from a subjective perspective to communicate it to others, but the experience has been the same. The major experience the first few days after this was a bewilderment that basically all of my psychological problems were not real and ended instantly, and going around basically \"testing\" what was new/different. The biggest one for me was experiencing no social anxiety no matter what environment I was in, which was very strange to me. \n\nYour mileage may vary though, there are other people who had it all happen at once, more incrementally, or haven't had it occur but think it has so it's not really worth worrying about how it's supposed to happen. The outcome from my observation of people that I've listened a lot to is pretty much always the same though.","timestamp":"2025-01-15T08:11:05.940000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"469794118814531586","username":"kaankayhan","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaan Kayhan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1328431566606827591","message_id":"1328431566606827591","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]