[{"id":"1265176922145427529","channel_id":"1264641290713305209","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What he is fundamentally referring to, like what Julien said, is that when you are angry and lash out at someone, moments or hours later we think \"oh god, that was such a mistake, I can't believe I have such a temper, I guess the next time anger comes over me I will try to control it or remove myself from the situation\". The belief is that \"anger happens to me\" the same way \"I have an anxiety disorder\" is the perception that the emotion is separate from you and happening *to* you rather than being a piece of you. It's the same way when we are on a bridge and looking over the edge and think \"wow, what a view!\" and then think \"damn what if I jumped lol\". We immediately say \"the first thought was me doing that, the second thought was intrusive and *not me*\". Both are equally the function of the brain producing thoughts automatically, our ego/self-image is the identification with the former but not the latter. \n\nThe reason J.K. brings this up is because if you treat emotions like ancestral remnants or evolutionary leftovers that just \"happen to you\" it results in being permanently influenced by their true cause, which is your beliefs about yourself and the world, causing you to experience negative emotions all through the day your whole life. Your mood is frequently ruined by other people behaving in ways you dislike, and past mistakes and future longings haunt you constantly, and the only resolution we recognize is to conform to those beliefs by resolving them through action. If someone acts a certain way that angers us, the only thing we can do is avoid that person or confront them and try to coerce them to act in a way that doesn't anger us. Instead, if there is recognition that anger is part of yourself, and comes paired with certain thoughts, those connect to beliefs, and those beliefs cluster to form your self-identity, then through *understanding* them, they actually completely resolve and stop arising at all.","timestamp":"2024-07-23T05:21:24.090000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1264641290713305209","message_id":"1264641290713305209","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]