[{"id":"1281351642427687015","channel_id":"1279091892973473793","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There is nothing wrong with \"doing\" what you are describing, the suffering is caused by misunderstanding what you are capable of doing and what the activity is that you are doing. \n\nIf I were to describe the fundamental situation you are experiencing it is being \"trapped in time\" created by your thoughts. \n\nYou don't lose the ability to think or make plans with SR, you lose the emotional relationship to your self-image and the thoughts you have about yourself because you realize you have never been able to imagine the past/future or yourself. Anything you think of is not yourself and does not connect to your existence through the channel of time. \n\nThe realization is sometimes called \"waking up\" beacuse it's like feeling like your life is going horribly then suddenly you wake up and are like \"whoops was just a dream lol not real\" and you instantly drop all the problems you just had in the dream world. You don't instantly drop your problems like that with SR, but you instantly drop your emotional relationship to them because you realize that the problems don't exist in reality or in time, they exist in your imagination and beliefs that you have invented in thought. \n\nThe basis of the realization is almost always dependent on realizing that you cannot think about the past or future, your brain can only produce images in the present based on its current configuration and hardware and that is what you are observing. The thoughts themselves don't need to change, you have to *realize* what the thoughts themselves are and their limitations.","timestamp":"2024-09-05T20:33:57.917000+00:00","edited_timestamp":"2024-09-05T22:31:33.485000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1279091892973473793","message_id":"1279091892973473793","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]