[{"id":"1435735941254877234","channel_id":"1385677114459558028","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"For me personally it was about 5 or 6 months after really looking into self-inquiry and this stuff specifically, but some people it's really quick if the circumstances are right and some people never figure it out their whole lives. Usually it seems common for people to be trying to actively \"figure themselves out\" in some way with philosophy or meditation for several years and then self-inquiry is like a new angle that really helps things click for them. For me it was more like a specific event that made it really obvious that something was almost like \"two things\" in my mind and it suddenly made it really clear I didn't get what was going on. If I hadn't had that sort of rift it probably would have made things a lot more confusing. I think it depends largely on your background in that even though I never looked into this stuff, it was kinda like a \"last place for me to look\" type of thing so I was less distracted by what might cause a lot of people to take some detours and tangents. \n\nWhen I say it's important to just sort of get your foot in the door it really means having a curiosity and interest in resolving what you aren't sure about. I remember as an example for most of my whole life having really severe anxiety and just constantly trying to figure out what the cause was and why it was the case. It never really occurred to me it was even possible for it to literally just stop entirely, but that's what eventually occurred. Sort of a like a rubik's cube it's very common for people to be like \"yeah I just can't fucking do it\" and even though they are bothered by their emotions and insecurity for the rest of their life, they've firmly decided they aren't going to try to solve the cube and seek different means. The resolution is in getting that \"click\" where everything falls into place, but it is usually very confusing. \n\nThe good news is that how long it takes you is not really important because while it might seem like self-realization is a like a little hack that makes your life better, it is in fact just the realization of what your life is, which you are unknowingly trying to solve with your pursuits and desire for success/avoidance of failure. As an example, it's easy for our ego to be envious of someone more successful or feel bad when we publicly fail, but the underlying reason why is because we are trying to achieve an enduring belief that we are sufficient, capable, and worthy of admiration and love from other people. This is a purely an egoic structure, but the reason we want success and to avoid failure is purely to arrive at an imagined external state of material success that we finally give ourselves permission to relax and feel safe. Again this is not necessarily obvious, but the place you finally arrive if all your external dreams come true that resolve your insecurity is just the ability to feel normal/safe/content which is our default state of happiness.","timestamp":"2025-11-05T21:02:03.079000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"758602499573153803","username":"streamsurfe","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1385677114459558028","message_id":"1425374180328738946","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":20,"userName":"jamie0773"},{"id":"1435733116160442520","channel_id":"1385677114459558028","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not particularly important to see that they do connect, but it becomes obvious when an external worldview ends and immediately there is your own internal relief, which might allow you to see it was all about yourself in the first place. I've probably mentioned it before, but an example would by my Mom, who has had a really bad case of Trump derangement syndrome for the last 8 years. In her mind and her friends who feel the same way, this is an awful, lying man who manipulates and deceives dumb rural American voters to cede him more power to advance his own self-interests. It's not that this can't just be an opinion, there's some of that I agree with myself, but the difference is it ruins and possesses hours of my mom's time every day and consumes her social life with anger and hostility. She thinks that her belief about Trump is 100% external, in that she is rationally evaluating a real external phenomenon, concluding this person is doing irreparable harm, and then being constantly angry at what she perceives as some other guy doing something bad. \n\nThe root of this is not actually her relationship with a real external force or worldview, but her own hostility and anger at how own image of what a person represents. She isn't actually angry at Trump, she has literally never met the guy and only watches endless negative soundbites,  but has created an imagination/belief/symbol in her mind and connects it as responsible for all negative things she experiences in her life and surroundings. She thinks housing crises, inequality, immigration, homelessness, EVERYTHING is Trump's fault because of the beliefs she has built. If he was shot and killed tomorrow, in her own words \"I would finally be able to relax if that man were dead\". That is the entire point. What she has constructed is a worldview that has re-wired all of her problems, insecurities, and personal issues into a single structure that blames a perceived externality and tries to destroy it to make themselves feel better. \n\nUnderneath this root of us trying to create beliefs that simplify and then resolve our own insecurities is really the misbelief in a past and future like I've described before. Recognizing that nothing can be different than it is currently and the only truth that exists is acceptance that things are exactly the way they currently are (without character like good or bad) is where you resolve the entire tree of emotional problems. This isn't to say you can't be like \"damn, this politician x or y is doing a terrible job and I want to try to change it\" but it isn't with a temporal/emotional attachment of \"it shouldn't be like this\" or \"how did this happen\" which causes emotional stress.","timestamp":"2025-11-05T20:50:49.524000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1385677114459558028","message_id":"1416104662318452867","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":19,"userName":"jamie0773"},{"id":"1401137097313747026","channel_id":"1385677114459558028","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"When I'm describing this hypothetical Andrew Tate it makes sense, but in the passing of our own lives it doesn't, and so,why? \n\nIt is our self-image/ego that says \"Yeah I get how *Andrew* is fucked up, but how do I realize my own fucked upidness???\"\n\nWhat is that? What is your own arc? I would encourage you and others to take the little made up story I wrote above and put yourself in it. What is the \"I was this, I learned this, now I'm this.\" part of your life?","timestamp":"2025-08-02T09:38:35.868000+00:00","edited_timestamp":"2025-08-02T09:39:57.999000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1385677114459558028","message_id":"1396036805958172703","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"},{"id":"1395886250728099880","channel_id":"1385677114459558028","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@pikachu_is_boss The difficulty is that self-inquiry is not objective but because objective understanding is the only thing that can be communicated with another person and is the only thing we are ever tested on or learn it is very difficult to break out from that perspective. All you really need to do is get your foot in the door and your brain will naturally resolve the rest once you get going in the right direction. \n\nMaybe this will help with regard to practical examples. \n\nLet's say you are a classically narcissistic high-achiever like Andrew Tate. I'm speculating here as again it depends what he specifically believes, but it is very likely that his beliefs about himself are that he is superior to other people, that women choose men, and by extension, him, through comparing the objective characteristics of different men and choosing the ones at the top. He believes money is finite and you must out-compete other people for it. The natural insecurities of this type of person mean they cannot relax or enjoy themselves because they feel guilty if they aren't working or \"self-improving\", they can't settle into one relationship because a single partner, no matter how amazing, will never be on the same \"level\" as them permanently, meaning they can't experience love for any significant duration of time. They feel angry frequently because they view any mistakes by other people as \"wrongs\" done unto them that wouldn't have happened if they were as capable. There's a million more things that may or may not be true, but this kind of behaviour is natural with that sort of belief system about yourself. You suffer primarily from anger and ambition, and rarely experience genuine love.\n\nSo let's say you're Andrew Tate and the above happens to be exactly what you believe and you are looking at it and say \"yeah that is what I believe because it's correct and that's how the world works\". Everytime a new challenge comes up, you find a solution that philosophically fits into your framework to deal with it. Oh, my brother is younger and better looking than me and just as smart? Fuck, that makes me angry and jealous. How do I resolve this? Oh I know, we can work together and view ourselves as a team. We are brothers after all, then his success is my success and it's our combined output that is what is worth measuring and comparing. This resolves the anger and jealousy. This process will continually repeat with every new life challenge being resolved within the existing belief framework. This is our ego/self-image and what everyone does throughout their life. Continually adding and refining their self-identity to be as internally consistent and rational as possible.\n\nLet's say Andrew then gets in a car accident and is severely disabled by it. He speaks slowly with a slur, is in a wheelchair, and both his brother and girlfriends begin to disassociate with them. This would likely be such a traumatic event because his life has suddenly fallen into such a state that it is utterly irreconcilable with his self-image. In every metric that he cares about he has been made worthless and it would never be possible to get even close to \"living properly\" in his mind. In this situation for the sake of emotional preservation, he would have to completely obliterate his previous self-image and invent a new one. The idea that his entire past beliefs about himself have to end is obvious to him because it literally no longer applies. Thinking the way he used to would hurt him. A new identity must now be constructed to live in relationship with. \n\nWhat I'm suggesting is that the complete destruction of our self-image can occur easily in this scenario, because we can finally and obviously see its existence, but it is then replaced with a new self-image. It does not need to be replaced it can just end completely, and there doesn't need to be trauma for you to realize there is no actual helpful function of a self-image in the first place.","timestamp":"2025-07-18T21:53:36.486000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1385677114459558028","message_id":"1385677114459558028","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":8,"userName":"jamie0773"}]