[{"id":"1316660443237847051","channel_id":"1308494742308388907","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I am suggesting that when you say \"I am typing this message\" that is correct. But the point is to dive deeply into what \"I\" refers to as a singular point or object. As it stands, we all recognize \"I\" is just one thing, which is \"Me\", but this is not at all how our brain operates or acts, as we respond to many different things we think are us. \n\nIf you woke up tomorrow and saw that all your money had been stolen from your bank account, your heart would sink, panic would set in and you'd think \"My life is ruined\". If you found out your partner cheated on you, most people would say \"My relationship is ruined\". What exactly is lost and who has lost anything?\" There is deep emotional attachment to losing our money because we belive it is part of us. There is deep emotional attachment to losing our partner or status because we believe it is part of us. Is it actually though? What is the root \"Me\" that is the singular thing we are all the time? \n\n*But in situations where the \"I\" is threatened and my real self is not threatened, there's an unnecessary conflict/suffering because of the imagined threat? *\n\nEssentially yes, but the realization is that there is no \"I\" thought. All thoughts about yourself are fictitious, in that we invent the identity \"Me\" at a very young age, but it is no different than an imaginary friend in thought that is not actually a real entity, yet we worry about it our whole life. There is only your real self and the thoughts you have about yourself are an unnecessary subsidiary that only causes emotional suffering, nightmares, stress, bad dreams, etc. The root of all of it is a false perception of a past and future identity that is both unnecessary and *can't* exist, not just that it is imaginary. \n\n*Is what you're saying that, after this realization, I don't even end up in a situation where I need to \"catch\" the thought, because I'm in that moment just aware it's a mental replay and nothing more?*\n\nYess sort of, in that things like anxiety, anger, emotion in dreams, etc. all completely end along with the accompanying thoughts. Like even in the rare instances something startling happens in a dream there is just a visual stimulus, you don't suddenly jump awake or get scared like before.  \n\nThere isn't any longer a necessity to \"catch\" a thought and distract yourself or concentrate it away, it simply doesn't arise. There is freedom to consciously think about whatever you want and there is no attachment to it. Thinking about a breakup is no different than thinking about a bunny for example. You're pretty much always in a state of contentment/peace except in extremely rare situations where there is physical danger or you've hurt someone accidentally.","timestamp":"2024-12-12T06:58:32.036000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"143575878876528641","username":"gutana","avatar":"fa8e4fc5480896be5798ba6e172cc548","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"gutana","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1308494742308388907","message_id":"1311083832014930051","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1310492850265391186","channel_id":"1308494742308388907","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Not relationship advice in any way, but deep down what your brain is actually trying to figure out is just an extremely surface level and intuitive \"what would be the most intelligent course of action right now\" which could be a number of things, but what I would highly recommend is also really helpful for self-inquiry, which is just \"be really, really fucking honest with yourself\" to just *see* what you actually want, even if it's based on self-image or not. \n\nBy giving yourself permission to actually just speak your mind to yourself, you can actually become *aware* of what your current situation is and then that very awareness automatically causes clarity. If you write down to yourself or talk to yourself in an audio diary you can actually hear your beliefs about your relationship in real-time and see what they are. If you come up with a bunch of stuff like \"I think I am more attractive than my partner and could do better\" or \"I think I've outgrown my partner and our relationship is becoming more and more distant\" that is different than if you have a lot of \"they seem less and less interested in me and my day to day, I think they are losing interest in me and I am anxious all the time of them leaving\". \n\nDepending on what the pieces are it will become more obvious if it's a perfectly fine relationship that can be resolved with communication, or if it just isn't going to work, or if it's fear of loss anchoring you in something you don't want.","timestamp":"2024-11-25T06:30:43.283000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"143575878876528641","username":"gutana","avatar":"fa8e4fc5480896be5798ba6e172cc548","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"gutana","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1308494742308388907","message_id":"1308496199606861855","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1310485763732930581","channel_id":"1308494742308388907","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The realization results in you seeing not that you can't think about yourself, but that what you've always been thinking about was not yourself. \n\nAs an example, when you are deciding whether you want to buy strawberry or blueberry jam, you are thinking and comparing the two and perceived experiences in thought and then acting on one that you prefer. Self-image doesn't enter the equation because we do not perceive \"Me\" to be in either thought, we are just just comparing what we perceive as two external objects. This is actually how *all* thought operates, we just mitakenly believe that sometimes \"Me\" is an object that exists in our thoughts and can be hurt by other thoughts about what might happen to \"Me\". In reality this is not the case and all thoughts are about \"external objects\". In reality there are no objects in thought at all, thought itself is the only \"thing\", but for the sake of making it more simple, I'll just say that all objects in thought are of \"other things\" and never yourself (you're the one thinking). \n\nBecause of this, the way that you know what \"You\" want is the same way you choose between two flavours of jam. Absolutely all thoughts and expression of preference you experience operate in exactly the same way. You are always thinking about external objects and external action, there is never actually a \"Me\" that needs to be in the thought to do anything because you are the operator doing the action. \n\n> I know it's said around these parts that it's a \"light-switch\" kind of phenomenon, but I've also heard in other places that it can be more of a slow dissolving of self-image. \n\nJust my own experience, but it's sort of analogous to Tetris, in that you can have incremental \"Tetris moments\" that are partial insights that dissolve certain beliefs, but there is only one \"realization\" underneath all of them that is like pulling the entire thing out by the roots and there is nothing left. A lot of people who talk about ego-dissolution being slow and gradual are usually very spiritual and have largely misunderstood the whole thing as a belief system that is essentially analogous to self-improvement. If you are very anxious for example, by improving your social skills (which happens naturally anyway) and having better friends, the amount of positive experiences you have will heighten, which will naturally cause your beliefs about the danger of social interaction to become smaller, causing less anxiety. This is not related to self-realization or ego-dissolution, it is just belief modification from self-improvement. The belief is still exactly as strong, just less harmful. \n\n> ask myself \"who am I\" and look in my experience to see what I can find. Thoughts come up, and I do my best to not identify with them but I struggle.\n\nI think it might be helpful to know that it is not possible to choose whether or not to identify with thoughts. The belief that thoughts can be about yourself causes you to automatically identify with them in the same way emotions will arise in dreams and you have no choice but to experience them. The inquiry isn't to try to dissociate with your thoughts or convince yourself they aren't you, etc. It is instead to immediately acknowledge \"I am hurt by these thoughts about myself because I think they affect me. What is the me that is truly being affected?\"","timestamp":"2024-11-25T06:02:33.722000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"143575878876528641","username":"gutana","avatar":"fa8e4fc5480896be5798ba6e172cc548","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"gutana","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1308494742308388907","message_id":"1308494742308388907","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]