[{"id":"1258648312718823515","channel_id":"1258635899315556415","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Obligatory 100 pushups, 100 sit ups, 100 squats, and a 10km run everyday.\n\nI mean my only advice would be for my past self, and so your mileage may vary because I can only speak to my own experience, but if I could give some guidance to that guy I'd probably say \"your intuition that all the people you are reading/listening to are all trying to communicate the same thing from a different angle is correct, there is something there to understand that is really important, but what you are trying to figure out isn't a new philosophy, information, or technique for dealing with your life, what you are going to come to realize is that the way you have been conceptualizing that life this whole time has been harmful to you and is the source of the emotional stress you experience. What you want to look at in particular is your relationship with time, and to question exactly how thinking and your self-concept relate to that.\"\n\nAgain my personal bias, but what I did and what I wouldn't change at all in hindsight would be listening/reading a whole bunch of different people who talk on this stuff (J.K., Osho, U.G., Eckart Tolle, Ramana, Adyashanti, Rupert Spira, Mooji, Tao Te Ching, Gurdgieff, Buddha, Zen, and also just looking at famous quotes and stuff like that) and trying to triangulate the core element they are all speaking about. I think it's definitely the case if you just keep coming at it from the same angle because it's your preference then it's easy to create a belief about what it sounds like that person is describing so you kinda keep running into the same wall over and over again.","timestamp":"2024-07-05T04:59:02.307000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1258635899315556415","message_id":"1258636154128044114","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]