[{"id":"1322023344014364683","channel_id":"1316871248575205386","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If someone were to say \"well, we all experience anxiety\" almost all people would nod along and say \"yes, yes, seems true\", even though it isn't true. If someone were to say \"Well, we can all shoot fireballs out of our hands\" everyone would say \"no, wtf are you talking about?\". How does anyone actually know this statement to be true or false? In both cases you refer to your own experience, and then extrapolate to other people. Because most individuals experience anxiety, others affirm it, they then believe that everyone else does as well and it's a baseline human experience. The fireball example is obviously false because no one themselves can shoot fireballs out of their hands and so they immediately deny the claim. What has to be recognized is that absolutely all knowledge is only accepted by an individual when it aligns directly with their own subjective experience. The root of absolutely everything in your existence is just \"checking with yourself\" to see if it seems correct or not. \n\nWhen I describe self-image or its affects on people emotionally, some people will think it seems accurate and some will not. When I describe that there is no fundamental identity of \"Me\" it is also something that some people think might be true and some people think is nonsense. In either case it doesn't matter what the person believes about what I'm saying, there is only a genuine understanding and change of experience if you investigate your own relationship to your own conscious experience and understand what it is. \n\nThe difficulty that most people have is they think what is being communicated is knowledge that will be externally validated like an exam, and so try to \"get the idea\" from someone else and then compare to what they experience in order to try to get the two to line up. What must be recognized is the source of absolutely all understanding is already just your subjective experience. You can't be \"wrong\" about what consciousness is because it is quite literally the only thing you are. All you have to do is *check*, not actually learn anything externally. It is this \"checking\" that results in genuine understanding because the conclusions you arrive at are acausal and just \"how it is\" to you subjectively.","timestamp":"2024-12-27T02:08:47.219000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316871248575205386","message_id":"1320248084764164168","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"},{"id":"1319916795095941130","channel_id":"1316871248575205386","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The one sentence answer is that intellectual agreement is thinking someone else is on to something and realization is seeing that your own beliefs were mistaken. \n\nThe \"realization\" component is really about understanding that it isn't a small error you made on the surface, like \"oops, set the oven to the wrong temperature\" it is a deeper realization of \"oh, I misunderstood the entire concept of cooking\". A small example would be \"oops, it should be 350 not 400!\" and then someone is like \"you know, your food is always burnt because you're doing it in Celsius instead of Fahrenheit\", and the person is like \"holy fuck\" because they have suddenly understood every single terrible dish they have ever served was caused by this small but severe error.  The realization component is exactly the same in what we talk about here. It ultimately isn't like \"oh, I didn't realize I can shoot fireballs out of my hands, but I can!\". It is extremely subtle, but incredibly impactful, just like the previous example.","timestamp":"2024-12-21T06:38:06.819000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316871248575205386","message_id":"1319894196068548669","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1319886216950452254","channel_id":"1316871248575205386","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"This isn't the exact question, but the root is the difference between self-enquiry/self-realization and a philosophical field like Ontology, which sounds almost identical if someone were to describe it. If you're not familiar, ontology is essentially \"the philosophy of self/consciousness/being\". A lot of those people will come to very similar philosophical beliefs as Buddhists or non-dualists, but also similar beliefs to Nietszche or very ego driven idealists as a result of concluding a self-identity in thought that we relate to is part of being. \n\nThe reason I bring it up is because Ontology as a field is a form of knowledge, and so people who are interested in it come up with arguments and perspectives from examining their own subjective point of view, but then they turn them into ideas/knowledge and argue them with other people to try to convince each other who is correct. Something like consciousness is viewed not as \"something that I literally am and experience constantly and so am an absolute authority on\" but instead as \"what is the nature of all of our shared knowledge of this object called consciousness? What do all of our conscious experiences have in common when we share them in thought?\" \n\nAll self-image/ego/self-knowledge operates this way, in that there is always \"Me\" affected by an external \"that\". Emotions are like this when we say \"I was overcome with anger. I wasn't acting like myself\". This is nonsense and no different from \"I got angry because I felt you were hurting people with your actions/ideas\". \n\nThe point of all that is that it is one thing for me to communicate what thinking/memory/knowledge is subjectively, and you can then say \"Yes, that seems convincing. I largely agree with that view and would describe it similarly. So now what?\" I am suggesting that this is an intellectual belief that you have found convincing or roughly describing your own experience. I have thrown out a piece of knowledge, and observing it, others then say \"yes, I like this piece of knowledge, it is quite like my own experience, 8.5/10\". What must be done is your own observation and examination in order to realize that my description isn't important not technically precice, but what is actually being described in your own conscious experience is exactly so.","timestamp":"2024-12-21T04:36:36.421000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316871248575205386","message_id":"1319776027978895444","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1318494574997536860","channel_id":"1316871248575205386","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's a large piece. If you take that large piece and resolve your own relationship to it, that is pretty synonymous to self-realization, as what you're describing is most of what ego/self-image/self-knowledge is. \n\nIn essence you would say \"I see what thinking is, I see what memory is and it's relationship to thinking, now, what is my relationship to that?\"","timestamp":"2024-12-17T08:26:43.124000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1316871248575205386","message_id":"1316871248575205386","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]