[{"id":"1346076557789368341","channel_id":"1341927334047121418","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What he is largely speaking to is the misconception around what meditation is. In both our modern world and partially in the religious world (buddhist/hindu, etc.), meditation is viewed as \"clearing the mind of thoughts\" or as \"ignoring thoughts\" or \"accepting thoughts as they are\". All are concentrative efforts because you get a mat, you sit down, and then, like yoga, you \"do\" something. You require instruction in order to perform a hypothetical or imagined activity. This effort to \"do\" something is what he is referring to as concentration or effort. If you are trying to \"do\" something it is because a teacher has given you instruction, or that you think you are going to get something. \n\nIf someone says \"ok, sit down and *not think* or *accept your thoughts without judgment*\". You are then going to sit down, thoughts will occur, and then you will repeatedly react to your thoughts at various intervals, and then judge yourself as \"yeah, didn't do much reacting, good meditation sesh\" or \"damn, I was still reacting, got room for improvement\". You then create another idea which is \"well, I reacted less than last time, and so next time I will try to react even less, and that will be an improvement towards greater meditation\". This isn't meditation and the teacher is also usually lost, but it is what 99% of people think meditation is, whether it is traditional, buddhist, hindu, or western mindfulness. \n\nThe actual effort of meditation traditionally, was to experience your thoughts and perception, and become aware of what subjective experience actually is, which causes an automatic cessation of emotional relationship to thoughts and ideas (what we talk about here) and that causes you to realize you are never in control, but also never affected by your thoughts or imagination. From this place, meditation is permanent and automatic because instead of trying to always experience a clear blue sky of thoughts, there is instead no effect of clouds in the first place. J.K. is to some degree describing *that* whether it is necessarily helpful to many people or not.","timestamp":"2025-03-03T11:07:40.270000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1341927334047121418","message_id":"1341927334047121418","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"}]