[{"id":"1405160171512270983","channel_id":"1403805681697685637","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Let me preface all of this with I'm not trying to be difficult, but hopefully rhetorical in some way to others. \n\n> Self-realization historically seems to mostly be brought about through meditative practice. It doesn't seem to be something you realize on accident out of deep contemplative thought, seemingly because emotional thought patterns obscure one's perception. It seems sort of worthless to be telling average people about self-realization when our minds are not even close to a ripe enough state to actually experience the realization ourselves. \n> \nWhat do you think self realization is?\n\n> It seems like we should instead be working on \"the basics\" like quieting the mind so the phenomenon can become possible in the first place. Is it necessary to have a clear and quiet mind to experience the phenomenon? \n\nWhat do you think self-realization is?\n\n> Did Jamie personally do any meditative practice or did the phenomenon sort of just pop out of nowhere?\n\n> So maybe ultimately what I'm saying is that Jamie should become a meditation guru. \n\nWhat do you think self-realization is?\n\n> ( Some feedback about your explanation of SR: I think it would be helpful to a lot of people to clarify that self-realization isn't realizing that your own perception is an approximation of yourself, but that your self-image isn't even close to what your true self is in the first place. A lot of analogies in the \"What is Self-Realization? Full Explanation and Walkthrough\" explanation like the one about IQ seem to imply that your \"true IQ score\" would be part of your \"true self\", when IQ has nothing to do with the true self at all. It is sort of clarified later with, \"self-knowledge just becomes knowledge,\" but I was left confused for a while about why only perceiving an approximation would mean you can't think about yourself.)\n\n\nIs this what you think self-realization is?","timestamp":"2025-08-13T12:04:51.502000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"710160487886880870","username":"aspectofthenerd","avatar":"b11414cef3de8a52da6aac604c6924a7","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"ENDER","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1403805681697685637","message_id":"1403805681697685637","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"}]