[{"id":"1306330725687230554","channel_id":"1301958013405495397","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean pretty much everyone who is self-realized did it through some degree of effort and motivation. It's only afterwards you basically stop operating that way specifically. There's nothing wrong with being motivated to do it, it's just funny a bit in hindsight because the motivation itself is caused by ego, meaning you are suffering in order to get rid of your suffering. There's nothing wrong with wanting to be self-realized, it's just probably not exactly what you think it is, meaning the direction the motivation pushes you is often unhelpful. \n\nIf I could go back in time I would absolutely tell myself that this is what I was looking for my whole life and that I should really look into it. I really think though that you to some degree have to be \"ready for it\" in that what led me here in the first place was just through living my normal life and then eventually, after exploring enough ideas, experiences, and bad events there was a sense of \"this isn't right, something is fundamentally incorrect about how I think and live entirely\". This little wedge made it *way* easier to figure things out because I basically knew everything I wasn't looking for, and so your brain excludes a ton of possibilities it might not otherwise do. \n\nIn the way the self-improvement people get trapped in the thinking of  \"I'll get jacked and rich first, then I can relate to people and get a girlfriend\" and spiritual people think \"I'll get enlightened first, then everything my life needs will come to me\" the reality is that both people think they are transcending something that is holding them back, when they are actually just excluding things that would let them live holistically. What the former learns is \"oh, there is no arrival at my perfect, physical state, it's just a hedonic treadmill with no moment where my life finally starts\" and the latter learns they weren't trying to become detached from material life, they were trying to arrive at a state where they would get whatever they wanted without working for it, which itself is the desire for power/wealth. Both are seeking resolution where it doesn't exist, but they really believed they were motivated to go in the right direction. It is actually very helpful and often necessary for people to live according to their beliefs in order to realize their falsity, and that is itself a helpful insight that can open their awareness to what's underneath that whole structure. \n\nWhat you're understanding is the entity that is itself experiencing a dynamic and changing life. You're trying to understand the conscious entity that is this transformative information processor we call \"Me\". If you feel you're stuck or plateauing on your understanding of this stuff, take a break and have some other experiences, get more information about your life, and that will actually make it way easier to make sense of it all.","timestamp":"2024-11-13T18:51:55.455000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301958013405495397","message_id":"1301958013405495397","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]