[{"id":"1346081505059012702","channel_id":"1342264988575989932","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah I don't think I have a lot to add other than if you take the idea of \"Santa\" that every kid has, imagine you were to say \"ok, we're going to get to the bottom of whether Santa is real or not, so first of all kids, what is Santa and Santa's actual characteristics?\"\n\nYou would then get 1000 kids argue for hours over what Santa is and is not capable of. Can he go faster than the speed of light? Does he know if you're good or bad? How many presents can he carry? Why doesn't he give presents to muslim kids? etc. etc. The kids themselves cannot agree on the characteristics of Santa, yet all of them believe in an entity they call \"Santa\" who has base characteristics of being red/white and gives them presents. \n\nThe point to be recognized is wait a minute, it's not actually the point whether or not a physical being called Santa exists, the *actual* point of contention is that we have 1000 kids who have *ideas* about Santa that literally no one agrees on. Instead of saying \"ok, what is the real Santa????\" instead say \"what is the real *idea* of Santa???\"\n\nThis cannot be resolved, in the same way any belief cannot be resolved, because the actual entity may not even exist, but the ideas in the mind of human beings is what their existence is. This is easy when it's Santa or even something like Genesis, now that we have scientific models that supersede it on evidence, but the reality is the same that no matter what the thoughts point to, the only real existence is in imagination/thought of the individual that holds it.","timestamp":"2025-03-03T11:27:19.791000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1342264988575989932","message_id":"1342608789563637882","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":13,"userName":"jamie0773"},{"id":"1346079133221916692","channel_id":"1342264988575989932","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'll read down and respond to the others but to directly answer your question I'd say that the biggest word for me is \"belief\" because it just doesn't relate, but part of that is because the way I've worked on trying to communicate the whole thing is centred around the separation between emotional attachment to ideas and just \"thoughts\" to some degree, and so it's partially one of the words I harp on a lot. \n\nI would say personally I immediately lost relationship to words like \"pride, guilt, regret, longing, hope, envy, jealousy\" and forms of thought-based comparison that relate to past or future. This was an instantaneous and automatic \"why the f would you care about that?\" that I tested right after my perspective changed and was a basis for what I try to communicate now. \n\nOther than sort of \"details\" like that, I don't think you would ever notice anything different about how I communicate if you knew me in real life. With the things you work on or the people you are *extremely* close with it is an enormous difference, but in most cases it is just perceived as you not getting annoyed/anxious/sad/emotional with any frequency anymore.","timestamp":"2025-03-03T11:17:54.301000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"343943455711428639","username":"illiamw_","avatar":"bcfc1d98a585c1c8efc453ee56a92646","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"illiamW","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1342264988575989932","message_id":"1342264988575989932","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"}]