[{"id":"1365708986816532523","channel_id":"1319773846156345414","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It seems that way to me, but I fundamentally don't have a strong view on it as the subjective experience remains the same. All of my material/physical points of view are related to explaining the creation and cause of the senses we experience and they seem to me to be physically explainable and very analogous to a computer, with some exceptions like that our consciousness seems to be constrained but probabilistic and on a normal distribution, whereas silicon processing always snaps to a binary 0 or 1 or yes/no.\n\nI don't see any current explanation for the source of individuated consciousness and don't see how anyone can resolve that, which is the sort of \"soul\" that people talk about.","timestamp":"2025-04-26T15:19:56.103000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319773846156345414","message_id":"1363884376093495469","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1319881545485652032","channel_id":"1319773846156345414","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"While the more spiritual types usually argue that \"everything is consciousness and is one 'all'\" in a way similar to a dream, I would personally suggest that I don't see how this is resolvable or a concrete conclusion. My personal and uneducated view (at the moment) is that consciousness is created by the body/brain and is a material process, but what I don't have an opinion or conclusion on is why it appears to be individuated. In that assuming we are both conscious and both have conscious experiences, why is that my experience is mine and your experience is yours? What is the cause of the unique separation/embodiment that each person has of themselves, which is essentially what people refer to as \"the soul\" but I don't see any explanation for it that has ever made any sense to me. That I don't think has a logical conclusion in the same way there isn't a conclusion for \"where did the universe come from?\" that isn't just an assumption or guess. \n\nIf you're asking about a material source for consciousness, as in \"what part of the brain causes the lights to go on?\" so to speak I have no idea. Based on what I observe the role of consciousness to fundamentally be, I've heard vaguely compelling arguments that consciousness is \"caused\" by the reticular activating system, sense perception being layered into memory, or the more obvious \"consciousness as the tv remote\" that seems more intuitive to us. I have no idea about any of these, but my vague intuition is that consciousness seems more likely to be the entire electrical network of the nervous system itself, and that entire signal is being directed and interpreted by some part of the brain, very similar to how a computer uses hardware to generate an electrical signal, and then read and display that electrical signal with a display. Again I have no idea but I don't think consciousness is \"In\" any of those parts but consists of sense organs that translate external physical phenomena into electrical signal, then the electrical signal is transmitted throughout the nervous system, then some part of the brain interprets the signal as conscious experience. Just like a computer you can do a lot of things to end up with \"no signal\" on the monitor, but unplugging the whole thing is not the same as running it with no monitor or hard driv eor cables, etc.","timestamp":"2024-12-21T04:18:02.657000+00:00","edited_timestamp":"2024-12-21T04:21:21.186000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319773846156345414","message_id":"1319773846156345414","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]