[{"id":"1281356621469061220","channel_id":"1257926794057875517","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Like Ishaan said, I really mean \"doing the best it currently can\". \n\nIntelligence itself is really just *there* in the same way you perceive objects with your eyes or when you stub your toe it hurts. Vision is an electrical signal in the brain that produces images, pain is an electric signal in your nervous system that indicates physical damage, and in the same way intelligence is essentially the nervous system/brain trying to create order in relationship to personal genetic makeup and preferences. It is essentially the way in which you perceive your sensory experience and is bit like entropy in the universe in that it's not like an object itself, but the way in which experience is structured/organized/perceived. \n\nPsychological suffering emerges as a result of creating a self-identity when you are very young, and as far as most people are concerned they do it because they think it is necessary and very important. Same reason people belief in religions or have faith, it's because in their experience it seems the most rationale and true enough to believe in order to help them function and make better life decisions. Essentially for every person at all times their intelligence is always doing the best it can, it's just that it hasn't been refined down and used to examine your own primordial experience/self.","timestamp":"2024-09-05T20:53:45.013000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1257926794057875517","message_id":"1278900543405690924","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"},{"id":"1277550004642250752","channel_id":"1257926794057875517","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is the same as saying \"what if the weather was different?\" \n\nWe can all imagine it, but the reality is that \"*it wasn't*\". \n\nThe constant demand to say \"well, things *could have been different*\" is fundamentally not real. There is absolutely no world where things are different, but to feel or pretend they could have been is our self-image/ego/self-knowledge.\n\nTo your direct question of \"so is everything everyone does the only thing they could have done in any situation?\" the answer is that the question does not have resolution because you have to assume that something else could have happened, when there is only really one state of reality at all times. It might sound like a cop-out, but it's really much more important than that, which is not the usual question of \"is everything I do pre-determined?\" and instead look at the question of \"from where is any decision I make?\"","timestamp":"2024-08-26T08:47:36.838000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703251615674662916","username":"mr.niceguy312","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"mr.niceguy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1257926794057875517","message_id":"1277545045209124937","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1277543455937134602","channel_id":"1257926794057875517","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Its related to realizing the self because all thought operates in the same way this accumulated soccer player acts. Every single instant of every single moment of your life is \"the optimal action the body has accumulated up until now\". The first and only stage of realizing the self is seeing that \"that which acts\" is this optimal and perfectly up to date intelligence.","timestamp":"2024-08-26T08:21:35.505000+00:00","edited_timestamp":"2024-08-26T08:21:57.529000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"703251615674662916","username":"mr.niceguy312","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"mr.niceguy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1257926794057875517","message_id":"1275652129310244898","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1260357717034532904","channel_id":"1257926794057875517","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The signal that is produced and shown on a computer monitor is whatever is being pushed through the cable into the screen. It is not possible to show a \"photo from the past\" because even though we might look on our hard drive at a middle school photo and say *that is my past!* in reality the data on the computer is a present configuration of the hard drive sending a signal to the screen. To the hard drive it is the present, to the processor and motherboard it is the present, to the cable and to the screen it is the present. Only in subjective interpretation can we say \"that is the past\". Physically, it is the present. Why this is important is because I could ask a question like \"if you can remember the past, can you recall every single thing you have ever experienced in linear order?\" Obviously not, we can just remember a small number of salient events and the order they happened to us in. Just like a hard drive, we don't store *everything* we store a small number of salient events. There are some events you can recall right away, there are some events you can recall conditionally, and nearly 99% of your life is completely lost to time and your brain cannot remember. They cannot remember because the data is not currently recorded in the physical state of your present brain, just like how a hard drive only contains whatever is currently on it. \n\nSmall extra example, imagine you have a bunch of photos on your computer hard drive. You say \"those photos are from the past\", but then your pc crashes and you have to factory reset your pc and hard drive. Now your hard drive is completely empty. Where are your photos? They are completely gone. You might say \"oh, I uploaded those photos in the past, so I can roll back the hard drive to recover them\" but you can't. You can't roll back the hard drive because the hard drive never held the past, it only holds the current state of its configuration, and you just reset it, meaning all the data was wiped.\n\nAnother example is how a professional soccer player don't remember every single tip they've ever learned in order to kick the ball properly, all the things they have ever learned are amalgamated and automatically incorporated into their currently ability to kick. This is because the process of learning changes their brain and nervous system into a new present state, and that machinery then acts.","timestamp":"2024-07-09T22:11:36.055000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703251615674662916","username":"mr.niceguy312","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"mr.niceguy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1257926794057875517","message_id":"1258111494198001736","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1257969137158979686","channel_id":"1257926794057875517","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Thoughts are a sensory perception produced by the brain. Not sure what you mean by \"do you own them\", but they are a result of the present neuronal configuration that's in your noggin. It's the same as how when you taste a piece of chocolate \"You\" are tasting it, obviously, and that taste is determined by the structure of your taste buds and their interaction with your brain. But in the same way you have no control over what tastes good or bad to you, or what things taste like in general, you aren't able to think of anything that isn't what you as a particular human being are currently able to think of as determined by the present configuration of your physical brain.","timestamp":"2024-07-03T08:00:14.235000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]