[{"id":"1366078115830562866","channel_id":"1346675382694182932","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There is nothing wrong with using thinking and analysis for modelling, that is what it's useful for. Thinking is for problem solving, communication, creativity, and transformation of experiencing information into novel utility. What thinking isn't is an actual pointer to the real thing. When Einstein came up with special relativity, that wasn't new, it has been the case for the entire existence of our universe. What was new was translating that understanding into a language humans could interpret in thought. \n\nThe subtlety that needs to be looked as is that a weather model is not *literally* modelling anything in the future, it is projecting the present. If the weather model is accurate 90% of the time, most people would say \"damn, the weather station is really good at predicting the future weather\". The 10% of the time is wrong they just say \"well, can't be perfect\" and don't think a second more about it. The reality is that no matter how accurate the model is, someone who actually understands how it works knows that it is literally impossible to actually know the future, you can only model inferred extrapolation on present information with greater statistical accuracy. The entire \"it got better at predicting the future\" is complete fallacy as there is no future involved. \n\nThe reason this is important is that if you don't understand it, our intuition is \"well, as the weather model gets better, it is more able to see into the future and make more sense of the past\". This is completely wrong. It doesn't move at all. It only more accurately uses known data to extrapolate present information. Our brain works the same way. There is an illusion of past and future we invent, but it is all just \"what I currently know\" that has forgotten 99% of everything it has ever experienced, mistakes the 1% it remembers as \"past reality\" and then extrapolates that data as \"the future\". All of it is just \"what I can currently think\".","timestamp":"2025-04-27T15:46:43.318000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346675382694182932","message_id":"1346675382694182932","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]