[{"id":"1272422465708097567","channel_id":"1267640248196923502","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The very short version is that the Buddhist phrase \"There is no self\" would be much more easily contemplated by a modern audience if it was stated as \"There is no self in thought\". It is essentially saying that whatever you think you are, you are not. All thoughts about oneself are like saying \"I am over there\" when the only fact is that no, you are right here.\n\nThe error in self-image isn't the belief that you did something bad in the past, it is the belief that is attached to the event that is carried around as a self-concept. \n\nAs an example, you said \"because I believe I am a person who has done bad things in the past that I am responsible for, etc etc. I have all of these thoughts and emotions due to that belief, and all anybody can really tell me at the end of the day to end those thoughts and emotions is \"yourself doesn't exist\". This is a cluster of thoughts about what you think is a physical timeline that are all interconnected which actually are not. \n\nIf you have done something harmful to others that you wish you didn't do, I'm not saying that it didn't happen and that you aren't responsible for it, what is the case is that because of all of the beliefs that you have accumulated about yourself, you have invented a self-identity from it that you then use as a lens to operate in relationship to others because you believe it is yourself. \n\nAs an example, if I were to play a game of tennis and lose it, I would be like \"darn, I lost that game of tennis\". That is the entirety of what I would experience. It is the same thing anyone would experience who is just a casual tennis enjoyer because they don't have an identity related to it. A person who did might lose a game of tennis, get mad and say \"FUCK, I shouldn't have lost to such a shit player fuck you you lucky asshole\". This person experiences anger because in their self-concept they believe that their ability to play tennis at a high level is socially valuable, and this other person just got lucky and hurt their reputation. Similarly, a person might lose the tennis match and think \"wow I lost again, I'm such a fucking loser. I'll never get good. My dad was right. I was always a loser and I'm always gonna be a loser\" and be weeping uncontrollably. Both of these people have very entrenched beliefs about who they are that get attacked by their tennis performance because they *think* something is happening to their life and identity when it actually isn't. At its core their emotions are being created by a false perception of reality created by their imagination, which is the operation of \"what I think I am has been hurt\"","timestamp":"2024-08-12T05:12:36.291000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1267640248196923502","message_id":"1267640248196923502","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"}]