[{"id":"1287517165427101806","channel_id":"1260632268054069330","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"While it isn't currently obvious, the reasons there is regret in the first example and anxiety in the second example is because there is a misunderstanding of our experience of time. \n\nThe way the experience changes is to be exactly like the memory of physical pain. When you hurt yourself, you experience physical pain and then learn not to hurt yourself that way again. You don't need to experience a burning pain again because of thought in order to know not to touch the hot stove the second time. In the same way, it is possible to freely think about something you did that harmed another person and simply think \"yeah that was bad, won't do that again\" without emotional suffering. You can freely anticipate \"yeah my boss is probably going to mad at me tomorrow\" and there is no suffering. You just think it in your mind and there is no emotion attached to it because it's not happening, just like the hot stove and feeling pain. \n\nThe reason there is emotion attached to those thoughts is because we believe we are literally our imagination of ourself, there is the belief that a past action or experience has harmed that imagined entity and there is a belief that a future experience will harm that entity as well. There is emotional attachment to an imagined entity called \"my life\" that extends through all time past and future. \n\nWhat must be examined is \"is this actually me?\" and the realization that everything you ever worry about, past and future, only has direct impact on the imagination of yourself. When you have regrets, it's always about things that have changed the way you think about your life. When you have anxiety, it is threats to what you might think about your life. Absolutely all psychological neuroticism is caused by threats to \"what I think about myself\". The realization is that absolutely nothing you think about yourself ever actually affects your actual self at all. Absolutely all psychological problems anyone every experiences are threats to an imagined entity and they *never* land. It's exactly the same way a nightmare can't actually hurt you because all nightmares are imaginary.","timestamp":"2024-09-22T20:53:33.150000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"185473441866973185","username":"vistascan","avatar":"a846f9a62d880bf9e69f286ffdcfc376","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"vistascan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260632268054069330","message_id":"1262775839544573982","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"},{"id":"1262640620418105404","channel_id":"1260632268054069330","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Self-image causes us to believe that \"yes, I only have my memory of the event, but also the event did actually happen\" This is the recursion of believing two things. If I had all of your memories, I would also believe that this event happened to me, and you could say \"oh, no you just have my memories. The event didn't happen to you, it happened to me, you just have the memory of it as well\". In actual reality, there is absolutely no difference at all. I could say \"oh, no I have the memory because the event actually happened to me, you just have the memory of it\". How do you resolve this situation? How do you figure out who the event actually happened to? \n\nThe resolution is that who the event happened to has absolutely no significance at all, as neither person can know. They both just have memory of it. The event does not exist as it's not part of the present state of reality. What is part of the present state of reality is your memory. The significance is the realization that your are doing something twice that your brain doesn't need to be doing. Your brain believes that you have memory of an event, AND that an event happened to you. This is two things it is evaluating. In reality there is no past event, there is only the memory of it. This is the source of why emotional processing related to self-imagination ends, because you realize that anything that is not currently happening to you only exists as memory, and has no danger in it.","timestamp":"2024-07-16T05:23:02.636000+00:00","edited_timestamp":"2024-07-16T05:24:06.939000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"185473441866973185","username":"vistascan","avatar":"a846f9a62d880bf9e69f286ffdcfc376","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"vistascan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260632268054069330","message_id":"1260824102881722460","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":13,"userName":"jamie0773"},{"id":"1260793128282095647","channel_id":"1260632268054069330","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Self-realization is about emotional relationship to self-imagination. If you get your leg cut off that ain't coming back hahahaha. If you mean emotional relationship to thoughts about a physically traumatic event, then yes those emotions also stop arising.","timestamp":"2024-07-11T03:01:46.186000+00:00","edited_timestamp":"2024-07-11T03:02:13.829000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"455065309439590400","username":"shravan21","avatar":"fccb761842d477949e8200768d459a7c","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ShravaN21","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260632268054069330","message_id":"1260657870178091049","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1260792992827052163","channel_id":"1260632268054069330","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What we call the past is the memory of something that occurred to us in the present and we have recorded that in our brain and can continue to access that perception as thought. If you have a photo that you uploaded to your pc hard drive, it may say \"uploaded 1/4/2017\" but that is an illusion because when you uploaded the photo it was \"now\", when you're viewing the photo is \"now\" and to the computer, it has no concept of time, it just has a bunch of data that currently exists on the hard drive as it currently is. \n\nTake your example with your scar. If I swapped consciousness with you, I would immediately have all your memories. I would know exactly what happened to you in your past, how much it hurt to cut your finger, and how it affected subsequent events. I would not have to relive those experiences. If you suffered in prison for 10 years, you might say \"what, you don't know what it was like to suffer in prison for 10 years! You just swapped consciousness with me for 10 seconds!\" But it doesn't make a difference, I literally *was* you. The ten years of suffering in prison is rolled up into present memory and that's what I experienced, it's also what you experience. \n\nI'm not suggesting the past doesn't exist as in \"there was never an event before now\" I am suggesting what most people *call* the past in thought doesn't exist. The reason recalling a traumatic event from the past doesn't create an emotional response is for exactly the same reason thinking about cutting your finger doesn't cause your finger to hurt. The misunderstanding of how time operates in thought causes us to re-experience trauma every time we think about that trauma because it is something we believe is an external event that happened to us in the past, not present memory we are using to think. This also causes the \"this ruined my life\" thought, which is a misunderstanding because what it ruined was your own imagination of what you dreamt up what your life is supposed to be, which is your self-image, not your actual life.","timestamp":"2024-07-11T03:01:13.891000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703251615674662916","username":"mr.niceguy312","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"mr.niceguy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260632268054069330","message_id":"1260632268054069330","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]