[{"id":"1256471958275489842","channel_id":"1255744869054283816","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Wouldn't be surprised if part of it is. In hindsight you realize your self-image is quite literally always active because it's what you think you are, and everything you ever experience is happening in relationship to that, but Idk if it's part of the DMN. It felt like there was an empty space in your brain for a few days afterwards that's used to think about yourself and produces emotions in relationship to that. When that turns off you get a much stronger electrical connection to a lower, larger part of your brain that I've always presumed was your memory, because the self-image is made of memory as well. \n\nI remember as a test because I couldn't believe all of my negative emotions just immediately stopped, asking myself a more tricky question like \"what are you proud of?\" and it felt like an electrical current was trying to go to that empty space, couldn't, and instead went to that lower portion of the brain and instead of having an emotional concept of \"something that made me think highly of myself\" you immediately thought \"There's nothing I'm proud of, just things I've done that I was really pleased with how it turned out\". There's never been a concept since of \"this thing went well, therefore I feel good about myself\" There is just \"I liked how that thing turned out\". The first thought only occurs when that part of the brain is active while the second can occur both when there is self-image and when there isn't. \n\nJust for context most people like feeling proud of themselves, so I should point out that it's not a worse experience not to feel proud, because you then see that pride comes from a feeling of lack that a certain accomplishment resolved for you. Pride is actually an experience of relief. If there isn't a feeling of lack you just enjoy the thing you did and feel pleased to have created something beautiful or helpful for other people.","timestamp":"2024-06-29T04:50:58.973000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"jamie0773"}]