[{"id":"1294043295584092220","channel_id":"1292919228252422164","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You just need to do whatever appears valuable to you directly right now, and as your understanding develops then it becomes more and more obvious as to what is actually being referred to and you will naturally want to resolve that. As an example, if you read a high-level math paper, it will basically be impenetrable because you haven't learned the pre-requisites. The good news is that self-realization isn't at all technical or *hard* per-se, but it's a bit like the Gurdgieff quote that is like \"You are in prison, and the first step to getting out of prison is to realize you're in it\". This means that questioning little things like why you are bothered or dislike a politician can help build insight, you do have to ultimately *become aware* of why this directly leads to and causes the need to question your own self-identity and nature of your own ego. When you're 16, the idea of learning pre-calculus to get a good grade, get into MIT and make a good career might be really appealing, but by the time you're 25 or 30 you might have \"been there done that\" and be trying to use your knowledge to really solve a very hard and important problem. Even after you do so and win a Nobel prize you might think \"ok wow, now what? Is that it? I don't feel any different than before??\" and you begin to question why you ever did the things you did in the first place and realize you must have missed something in how your life was supposed to work. \n\nYou certainly don't have to achieve anything materially grand or have conventional success, but yeah, generally there is a sort of \"path\" that must be experienced by someone in order for them to even become aware of what they need to do or consider to resolve the root issue of their own emotional structure. If you see value in questioning why you dislike a politician because it bothers you enough to want to do something, then do that. If you think that you really want to resolve the root of the whole thing then yes, all that is necessary is resolve the \"What am I?\" or \"What is 'Me'?\" question.","timestamp":"2024-10-10T21:06:03.829000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292919228252422164","message_id":"1293294532045045890","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1293126806035238912","channel_id":"1292919228252422164","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hmmm. Ok so maybe I can respond to some of the bullet points and then you hit me with your thoughts.\n\n*Some understandings I've had since joining seem more philosophical in nature, like:*\n\n*\"Oh, humility is just the absence of vanity. It's not an actual thing, it's just the absence of a thing\" (your example)**\n\nHumility is the absence of vanity because it is simply not caring about how you are perceived, it is just doing what you think is intelligent and fun. \n\n*\"Oh, confidence is not an attribute someone has, it just means they aren't currently scared\"*\n\nConfidence isn't being \"not scared\" it is self-expression without the need for validation. \n\n*\"Oh, I can't force myself to do chores because to force myself there would have to be another me to force the first me, and there isn't one\"*\n\nIf you have chores you think you should do, then do those chores. All you have to be aware of is \"hey, there are some chores I think I should do. I don't really want to do them, but fuck, it would be smart if I got them done\". \n\nWhen you said: \n\n*there are also understandings which feel more self-realization related, like:*\n*\"Oh, I can't be aware that capybaras exist without thinking about them, thinking seems to be necessary for knowledge?\"*\n*\"Oh, there is no difference in experience between memory and imagination, both are just thoughts\"*\n\nAre these things that I have said or others have said? I don't really relate to or understand these points and they are bit convoluted to me. Happy to elaborate so let me know.","timestamp":"2024-10-08T08:24:15.693000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292919228252422164","message_id":"1292919228252422164","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]