[{"id":"1334832237505417236","channel_id":"1329879091192533042","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah it's really about observing that we don't act in obvious preference to our thoughts and to then examine why. I'm usually talking about a distinction between emotional reactions to our categorizations of thought vs our sensory preferences, which is ego/self-image vs reaction to immediate perception.\n\nIf you like peppermint ice cream and not vanilla, we naturally know this automatically with no involvement of thought. We just know this obviously. We like touching soft things rather than sandpaper. When it comes to \"preferences of thought\" that is where our ego/self-image comes in and creates emotional response to our perceptions of other things. \n\nIf you, for example, are a diehard progressive who lives in Portland (as someone from the PNW so it's like 90% of my peers), it is likely that you might meet someone from Mississippi with a charming southern accent and think \"wow, what a cool and interesting person\". With absolutely no other interaction with them, someone might say \"yeah, but they voted for Trump\" and this trips all the contradictory belief wires in your mind, and suddenly you re-contextualize all of their behaviour as a backwards, small-thinking redneck. You loved them yesterday and hate them today, entirely because of how your thoughts about them changed. \n\nTo give a \"yeah well I don't do that\" example, take your own parents. Think about how you viewed them at age 8 vs age 15, vs however old you are now. As you become an adult you realize \"oh fuck, my parents were literally just like me. They had no idea what they were doing. A huge part of our childhood criticism of our parents is our own imagination that they know what they are doing and understand the world, when in reality they are totally clueless in most areas. Only once you are around their age or understand how lost they were can you look back in time and be like \"fuck, they really did their best not knowing anything really\", despite their actual behaviour not changing at all, you look at them differently. Their behaviour didn't change, your thoughts and beliefs about their behaviour did.\n\nThe underlying effect of SR is for this to not occur emotionally. Instead of saying as a teenager \"I am treated this way by my parents because they don't understand me, fuck them\" with anger, as an adult we say \"my god, they really did their best and I didn't appreciate them\" with sadness. Instead, neither occurs and there is just \"I am being treated this way currently by this person and have to react as intelligently as I can. As a kid you don't know why they are acting this way, but as an adult you are more aware and empathetic. In either case you don't get pushed further away or pulled closer together, you just interacted with the person as they are.","timestamp":"2025-01-31T10:26:45.405000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1329879091192533042","message_id":"1329879091192533042","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"}]