[{"id":"1375749440639336510","channel_id":"1318103328072405032","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"\"I would accept that my thinking and beliefs could be just as flawed as my behavior and actions, \"\n\nSure, you cannot then come to a conclusion as you are suggesting all forms of perception other than immediate response to sight, sound or other senses are flawed. From this point of view there must be a \"something else\" you are comparing them to that is correct that you mentioned you will correct them according to. \n\n> I don't see this connection at all, it's possible for somebody to be really good at thinking about what they should be doing, and being correct in their conclusions, while at the same time being incredibly flawed and bad at executing on their beliefs of what they should do. In fact it seems exceedingly reasonable that it is far easier to imagine what you should do than actually do what you should do, so this makes sense\n\n\nThe basic metaphor I would bring up is \"If I someone is so sure about anything, become a meteorologist and predict next weeks weather\". You will be thinking and concluding your whole life and never be 100% correct. \n\nRelatedly, the response to a similar topic is \"that is ridiculous, I know I exactly how to get in shape and become fit and physically attractive, I just can't do it!\". \n\nIt might seem categorically different, but it is exactly the same thing but not understood, in that a weather system is predicted upon a current model and projected into the future by a computer, while your own fitness is predicted upon a current pattern of behaviour in relationship to your environment projected into the future. \n\nThe difference is when we think about the weather we say \"oh, it's a model, but it may or may not happen\", but when we think of our health/fitness/success, we say \"oh no I just have to will it into existence, there is no probability or circumstance to it at all\". \n\nWhat I'm suggesting is that there is a resolution and commonality to all of this, which is predicated on realizing our own limitaitons of thought, self-identity, predicative capacities, and all of this centres around the \"Me\" that does it and takes ownership.","timestamp":"2025-05-24T08:17:06.837000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318103328072405032","message_id":"1328207184038985730","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":41,"userName":"jamie0773"},{"id":"1328197821731573871","channel_id":"1318103328072405032","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Other than your beliefs about laziness or cowardice being nothing other than an imagined comparison with your beliefs about yourself being compared to your beliefs about others, even if you run with the idea \"no, I am flawed person who constantly makes mistakes, I am not perfect like I want\" then the conclusion is still the same. If you are a flawed person who cannot execute on the plans/ideals you have created in thought, it is also the case that your own flaws cause your thoughts and goal planning to itself be flawed. This is in fact the case for all people.\n\nA root issue for most people's neuroticism is they think their actions and behaviour are all flawed, but their thinking and goal setting is perfect. If you kept telling your kid to jump 40 inches and every time he could only jump 10 you berated him and expressed your disappointment, everyone around would think \"damn, that parent is completely delusional and can't accept reality\", but when we do it to ourselves we think \"my plans, goals, and thinking are all perfect, but all of my actions failed to live up to it and I'm a failure\".  The error is in our thinking and beliefs, not in our behaviour and actions.","timestamp":"2025-01-13T03:03:57.423000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318103328072405032","message_id":"1322059566480883795","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":30,"userName":"jamie0773"},{"id":"1322053523382468712","channel_id":"1318103328072405032","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@creikey The simple answer is that you are judging what is \"intelligent\" by how effectively it gets you the achievements or goals that you currently want. You are assuming that what you want to get is \"correct\" which are the beliefs you currently hold. It's analogous to asking your 5 year old self \"what do you want by the time you're 10\" and then when you're actually ten the things you want are completely different than what you wanted at 5, but every single iteration you're like \"no, this is definitely what I actually want\". The things you currently want are not necessarily actually going to result in what you expect they will bring you, but are a byproduct of your present beliefs. It doesn't mean they're bad or wrong, it just means that the outcome of their fulfillment is not going to give you what you think it will give you necessarily.\n\nThis might be more evident if I were to say \"what is the goal of life?\" If you are not sure, then how can you even know what you are doing is efficient/correct or not? If one person thinks \"its the maximization of pleasure and diminution of pain\" and another person says \"It's cultivating power\" then when one person says \"I had sex 5 times today and had a bag of Oreos, I'm killing it\" and the other says \"no you're not you idiot, that isn't cultivating power like me who is eating nothing to get shredded and working 15 hours a day to become more influential\". \n\nWho is right? Straightforwardly they are both lost in their beliefs, but each thinks the other isn't using their intelligence at all, and they are each using their own at 95%. The actual reality is they are both using their intelligence at 100%, but what they *think* they are doing is completely misguided and a neurotic waste of time. \n\nA question that comes up sometimes is \"if I want to be the best at something, would self-realization be bad for me because I wouldn't have as much motivation to get there?\"\n\nIf you are genuinely destined to be an incredible basketball player because you love the sport, the competition, and the audience so much, then it would likely make you even better. If you are like Mike Tyson and are literally still suffering to this day from the belief you don't deserve love or admiration unless you are the best at something and can externally confirm it, then self-realization would likely *not* help you become the best boxer in the world. What most people then get wrong is thinking \"ok so what you're saying is that self-realization might not help me with my goals?\", but they don't see that their goals are a form of suffering. They aren't a form of success or self-betterment, but a coping mechanism for their own unhappiness and harmful beliefs about themselves. \n\nIt is absolutely the case that you are always operating at 100% capacity, but our own beliefs come in and say \"well, I am the judge of what I was supposed to be doing, and because I wasn't doing that, I was only operating at 60%!\" which is the introduction of a fantasy.","timestamp":"2024-12-27T04:08:42.541000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318103328072405032","message_id":"1319803298496380960","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":25,"userName":"jamie0773"},{"id":"1319783307969298503","channel_id":"1318103328072405032","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's because your experience of life at its absolute core is the result of the growth and development of the physical organism, which is identical to a seed growing into a tree or a puppy growing into a dog. The actual external actions that you do or accomplish are entirely a byproduct of that combined with your physical time and place. In the sense that if you take an acorn and plant it in shitty ground, it will be small and frail. If you bind it, it will become a bonsai, and if you put it in ideal conditions it might be very large. In our self-image/ego we are attached to this outcome, but the primary fact is that no matter where you plant it, it is always operating at 100% to as intelligently as possible to grow and develop into itself. \n\nYou can see how this operates when you think about the things you were concerned with when you were 5, then 10, then 15, then 20, etc. The things that are \"problems\" to you constantly change with your age, development, and life circumstances, yet in each instance each issue seems to be very real, very serious, and our entire world. In each case the problems we invent, goals we have, and things we are confused about and try to resolve are the consequence of the current state of our brain and its capacity to create thoughts and understand things. This is not obvious to us, but our brain itself is no different than tree's leaves or a plant's flowers, it is a part of our physical genetics/nature/body, and its behaviour and capacities change through the entire life-cycle of the creature and create all of our thoughts/imagination. Self-realization causes you to see that you are \"along for that ride\" rather than being like \"I am doing the learning\" or \"I am doing the creating\" or \"I am making the decisions\" you are instead experiencing the learning/creating/doing of the nature of the person that you are at any given moment in time.","timestamp":"2024-12-20T21:47:41.008000+00:00","edited_timestamp":"2024-12-20T21:49:34.748000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318103328072405032","message_id":"1318562672312324116","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"},{"id":"1318513023316656159","channel_id":"1318103328072405032","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I would just suggest that any real life experience is just as valuable as any introspection or thought based analysis. It is likely the case that it is necessary to do both to help your own understanding. It might be helpful to sort of think of it as \"theory vs practice\" even though it is more like \"gathering experiences for me to reflect on and understand\". You have to live to reflect on what living is. \n\nAt the end of the day, the realization causes you to have no separation between any form of categorization of thought or activity, and so, believe it or not, you are doing self-enquiry every moment you are alive. Don't ever worry that you are misspending your time, your time is being spent correctly at all times, it is only your self-image/ego saying \"no, I should be doing this instead\". \n\nAgain, if it is helpful, and I genuinely mean this and encourage others who also worry about not spending their time efficiently or correctly, is that you actually can't do that. You are always spending your time perfectly efficiently, you just haven't realized it yet, hahaha. If you want to take a month to not even think about this stuff at all, you will find that it is the most helpful thing you can do.","timestamp":"2024-12-17T09:40:01.546000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"567527137444364299","username":"issa5545","avatar":"0c5939aff8dcae86d26bdc53ca2c96cf","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Issa","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1318103328072405032","message_id":"1318103328072405032","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"}]