[{"id":"1415200943967830017","channel_id":"1358012106229944320","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> For example, my friend has been meditating/self inquiring (idk how consistently) for about 6 years now. He says that the purpose of mediation is to (sr obviously) but to use meditation to find the places that ‘the self hides’\n﻿\nI guess no need to beat around the bush, but usually what people are trying to do is along these lines and it is to some degree part of the core misconception that has to be unraveled. \"The Self\" doesn't hide and it is not an object or objects to find. How could \"The Self\" hide in your conciousness when that's what it is? How will you find something that you already are? This isn't like a pop quiz where you can just \"remember the answer\" but what has to be seen eventually seen is that there is no fragmentation in consciousness. It unfortunately or fortunately is actually a simplification not a complex puzzle that is solved. When we say \"The Self\" there is a godly or ethereal characteristic to it, but you have to go the opposite direction. You exist, who knows why, who knows for what reason, but you do exist, that is for certain. What is that? When you say \"Me, I exist, Me\", what are you *actually* referring exclusively to? The realization that the self or \"Me\" is *only* present experience with no exception or alternative is essentially the \"oh shit how did I not see this before oops\" kind of moment rather than a \"I have done it. I have ascended\". When I say something like \"you realize you're always meditating\" it's not because you just permanently toggled it on, it's more like realizing that when you're \"meditating\" you actually aren't really doing anything. True meditation is more akin to the realization that for every second of your entire life you thought you were \"doing something\" when you fundamentally weren't. I think Gurgieff said \"the first step of getting out of prison is realizing you're in one\", but a bit more relevant version for today's audience would be something like \"The first step to getting out of church is realizing you're in one\". \n﻿\nAgain, meditation is find if you're into it and feel like doing, just do it as much or as little as you'd like however you'd like to do it, I'm not knocking it just trying to give some colour so you don't think you're trying to levitate or something.","timestamp":"2025-09-10T05:03:18.204000+00:00","edited_timestamp":"2025-09-10T05:03:58.559000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":19,"userName":"jamie0773"},{"id":"1415200937613721690","channel_id":"1358012106229944320","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> He is on the path of Zen Buddhism, and he says that meditation is essentially the most guaranteed way to achieve SR\n \nAll the best to them, I've personally not really ever done much formal meditation but no reason not to have multiple angles of attack. I found it very helpful to listen to different speakers on self-realization but meditation just never appealed to me. I don't recommend any combination, I found it's usually intuitive what you need more or less of and to approach that naturally. \n\nWhile I've harped on this before a lot, it is extremely, extremely important for self-inquiry to ask questions like \"What exactly do I think I'm going to get?\" In the case of SR, if you imagine it is a state of heightened sensory experience or permanent bliss (bliss in the western meaning of euphoria/rapture) then you can \"be on the path\" your whole life and only get more and more lost because it doesn't lead there. Not judgment towards anyone as it's just funny from my perspective, but I often find it amusing on this Discord when people ask questions of \"how long should it take??\" everyone here is like \"I've been self-inquiring like 6 months and still don't get it :(\" and someone else will be like \"Bro I've been at it a year I'm so cooked\", whereas in real life every meditator and spiritual practitioner I've met is like \"yes I've been meditating for 13 years\" and it's like \"yeah no one's keeping count though right?\" hahahha.\n\nI'm only mentioning it because the pursuit of something like that for a lot of people is religious/spiritual and is really just another belief system or perceived form of self-improvement. Similar to the idea if you just bodybuild enough, because you have improved, eventually if you extrapolate, there will be a super saiyan moment where you finally phase shift into something different. Self-realization is not about getting what you want it's fundamentally the absence of false beliefs about who and what you and your life is.","timestamp":"2025-09-10T05:03:16.689000+00:00","edited_timestamp":"2025-09-10T05:05:05.004000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"1027670361829036073","username":"leafsheepsolar","avatar":"cd391e8a6f399b78ffda23488f3cb908","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"leafsheepsolar","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1358012106229944320","message_id":"1413399359176970312","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":18,"userName":"jamie0773"},{"id":"1359712823260745888","channel_id":"1358012106229944320","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The end result of self-inquiry or formal meditation is the realization that your natural and permanent state is one of fully integrated and constant meditation. You can do self-inquiry with your legs crossed and eyes closed or while you're sitting on the bus, it doesn't really matter as it's just directed thought, analysis, observation, and/or attention. Formal meditation is also a good tool and a different approach to identifying what the \"Me\" fundamentally is. \n\nA lot of formal meditation currently is not towards self-realization but more the belief that through practicing the skill of observing our own thoughts and processes that attachment to negative thoughts or harmful patterns of thought can be diminished or eliminated. This will not lead to self-realization as it's an effort to avoid negative experience and pursue preferred experience or indifference, which is itself a preferred experience. It is a concentrative effort to move from state A to state B through some method. \n\nThe underlying effort of genuine meditation or self-inquiry is to identify the fundamental \"Me\" that we believe is affected by all of our imagined problems and experiences in order to realize not that our problems or thoughts aren't real, but that the \"Me\" affected by them was not what we always believed it was. \n\nThis process occurs automatically in response to observing that previous beliefs we had about ourselves or nature are incorrect. If for example you are walking to the north pole and have been struggling for weeks to find it and can't figure out why, then finally you look at your compass and realize you were reading it backwards and were actually going south the whole time, you automatically realize \"oh, oops lol\". This is what causes automatic change in psychology and our point of view, which is observing or articulating our beliefs about ourselves and our lives, and the moment we articulate something contradictory or nonsensical your brain will automatically fix it as it arises.","timestamp":"2025-04-10T02:13:19.308000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"551768653402734592","username":"greyandout","avatar":"dc8918ab5cbf0cfbbfd2c3a90f40a018","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"GreyWorm","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"492371812722802688","identity_enabled":true,"tag":"HG","badge":"f44e81e3643194067e800245c2377a89"},"primary_guild":{"identity_guild_id":"492371812722802688","identity_enabled":true,"tag":"HG","badge":"f44e81e3643194067e800245c2377a89"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1358012106229944320","message_id":"1358012106229944320","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]