[{"id":"1258620687267135599","channel_id":"1257983399621034059","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"We try to think about an imaginary alternative world because we believe that we are able to imagine the world in our own mind and that this abstraction is a pointer to the real world, but this causes us to essentially not just burn our hand when we touch a hot pan, but to experience the pain again whenever we even think about it. It is important for this reason to examine very deeply \"how exactly do I experience reality? and further, to try to figure out when other people have wronged \"Me\" what exactly is that entity? \n\nFor example, when someone insults you, why does this cause suffering? If you look at it closely, you will notice \"I am hurt by someone's else's insult because what they said has changed my beliefs about myself\", if you look at why a bad experience in the past has harmed your life, you will notice that the literal harm occurred the moment it occurred, but it continues to cause you harm because it has changed your beliefs about yourself and your life. Absolutely every problem that exists in thought can be seen to currently cause you harm because of how it affects the beliefs you have about the state of yourself and your life. In essence, our sense of psychological suffering is always caused by things changing what we believe about ourselves. This is our self-image. \n\nThe resolution to this comes by starting with noticing \"hmmm, all of my problems are caused by what I believe about my life and what is/was/will happen to me, what exactly is my life in the first place? What is the actual identity I call \"Me\" that seems to constantly have something good/bad happen to it?\"","timestamp":"2024-07-05T03:09:15.886000+00:00","edited_timestamp":"2024-07-05T03:13:23.356000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":8,"userName":"jamie0773"},{"id":"1258620683617964093","channel_id":"1257983399621034059","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, very sorry to hear about all your bad experiences, really unfortunate series of events to have to go through, I know when you're really in it how bad it can feel and just wanting that to go away.\n\nThe first thing I want to touch on is with self-inquiry, what we're trying to examine is going to be an effort to understand our present state and subjective experience. Typically the way that we conceptualize our life is like you're describing, which is to think about all the things we remember happening in our life from our past, collecting all of those experiences together to describe why or how our life got to \"how it is now\" and then we imagine and extrapolate that information to try to resolve it into a better imagined future. We then try to objectively analyze and measure our life based on constructing relationships between these events and try to \"fix\" the problems in our life. This is our natural mode of using thought but not what subjective inquiry is about. \n\nBecause there's a lot to address, if you haven't already, I really highly recommend going through the essay I wrote on the side bar a few times to sort of anchor yourself a bit in what we're trying to examine. But to take a few pieces of what you've said, you can start by examining a few things. Take the fantasy of wanting to enact revenge. If you ask yourself \"what *is* the desire for revenge?\" you can begin to unravel your understanding of yourself as you currently are. For example, depending on what you subjectively believe, revenge will contain different emotions, but generally the predominant emotion is anger. Anger is perceived in relationship to our self-image when we believe that we have been harmed by someone else, the anger is then experienced because it allows us to harm them in return without feeling guilty about it. That belief itself causes us to perceive the target of our revenge as a \"bad person\" who should be punished, and in fact we would be doing a *good* thing by hurting someone else. \n\nThe reason this occurs in our self-image and why it is a distortion is because it's caused by the misplaced belief that our life *could* be different than it presently is. As a small example, if you believe that your life would have been *slightly* better than it is now if someone didn't hurt you, you will be slightly mad. If you believe your life would have been *way* better than it is now you will be furious. The distortion arises because even though we don't actually know how our life would have been if something didn't occur, we think we can sort of roughly estimate and say \"my life *probably* would have been about like xyz, so my anger is in proportion to that. The error that is being made isn't that we can't exactly estimate what our life would have been, the error is that you can't estimate at all what your life would have been because your life cannot be any other way than how it is now. It isn't that life might not have gone the way you thought, it's that it can't, and what is being imagined does not and cannot exist.","timestamp":"2024-07-05T03:09:15.016000+00:00","edited_timestamp":"2024-07-05T03:11:26.315000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"647791051481939969","username":"blintzknight","avatar":"b76155f2b62f5410f86923bf391e7f15","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1257983399621034059","message_id":"1257986544854237216","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"}]