[{"id":"1395860679738659039","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yes pretty much. I'll use a practical example because it makes it easier, in that if you watch a bunch of finance videos, you have pundits on all the time who are talking about how the market is about to collapse and the economy is going to blow up. You have some people talking about how Trump is going to cause WWIII and what China is going to do. You also have some people saying \"follow the money, more money means markets go up! I expect the sp500 will be up 20% by year end\". All of these people have different emotions based on what they think will probabilistically happen over the next couple of years, and then react in fear or greed in relationship to those ideas. In reality, absolutely nothing has happened yet other that a person having a thought about the current information they're privy to. The difference between a self-realized person and someone who's attached to their imagination is that they perceive their prediction as an actual possible real event they are predicting in the future and react emotionally to the impending arrival of that future. A self-realized person just sees it as \"what this person is currently thinking about\" because that's exactly what it is. It is unnecessary to be emotionally or intellectually attached to the 20% modelled outcome that world war 3 will happen within 4 years, you just react to each incremental step moving toward or away that direction as it occurs.","timestamp":"2025-07-18T20:11:59.887000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"745395430791315477","username":"juba.hu","avatar":"596e62ed926774f517d0162a9a894ab3","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"𝙟𝙪𝙗𝙖","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1385569381773479968","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":15,"userName":"jamie0773"},{"id":"1395854539936235532","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If I have dream that I am a penguin, am I penguin? If I have a dream that I am a stripper named Crystal am I Crystal? If you say yes, then I wake up and say \"oh shit whoops that wasn't me I'm actually Jamie\". Then naturally I will be constantly confused on a nightly basis what I am or what is real. \n\nSimilarly in a video game, if I put on a VR headset and play as Mario, why not just say \"I am literally Mario\", because you obviously aren't. You are playing *as* Mario and experiencing that world. This is obvious because we have external information from the game world. What is *not* obvious is why this applies to us in our human experience when we don't have external information. \n\nOf course day to day in our practical world I would just say \"yeah I'm Jamie what's up\" but this is the exact reason why people have developed an imagined self-identity, which is they are observing the behaviour of the human they are and trying to build a psychologically model of *what that is*. The reason we can't just say \"for all intents and purposes, if you're always experiencing what Jamie is experiencing why can't you just say you're Jamie\" is because this is the *exact* error that creates two identities and two sets of emotions. One set of emotions related to our real identity, which is immediate perception, created by out brain and body, and one set of emotions related to self-imagination of that brain and body and what it experiences. The reason I'm specifically saying I don't psychologically identify with anything is because identification means imagining yourself and then confirming or denying that identity. You don't need to identify yourself because you are already being yourself all the time.","timestamp":"2025-07-18T19:47:36.044000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1385285746792861819","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":14,"userName":"jamie0773"},{"id":"1385164286808166470","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It doesn't work that way because nothing is pre-ordained or programmed to happen. If you press A to jump you are saying \"yeah it jumped because I pressed A\". It doesn't work that way because nothing in our world has happened yet. There are not controls over the future and there is no free will only because nothing has yet occurred. I know this sounds difficult or annoying, but it is unfortunately basic and correct, in that nothing can be \"decided\" because nothing has yet happened or will happen, there is only what you are currently doing and are aware of. To be a bit more \"dramatic\" I am saying there is no future and there is no past. Get familiar with the present because that's all there is and all there ever will be","timestamp":"2025-06-19T07:48:21.083000+00:00","edited_timestamp":"2025-06-19T07:50:10.172000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1385160848678588549","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1385157813294071878","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I personally don't identify with \"awareness\", there is no object I would identify with, that is probably just the best expression of what we all experience as the sole \"Me\" that exists. It's not a positive identification with a \"thing\" like awareness or consciousness or the soul, etc.. It is the expression of self realization that is \"ok so what do you actually think you are then??\"\n\n It is a linguistic statement referring to the actual biological perspective that there is no identification with anything. Not as a philosophical conclusion like \"oh I thought about it a lot and believe this now\" but as a statement of personal fact that is \"I do not psychologically identify with anything at all\". \n\nGoing back to the common example I give, the experience of life is like being aware of Mario's experience in the Mushroom Kingdom. You do not identify as Mario, you do not identify as the Kingdom, you are just aware of what Mario experiences as he acts out his life and are bound to that. It is the same for the person you currently are. \"You\" are aware of what that character is experiencing, learns, and acts out in their life.","timestamp":"2025-06-19T07:22:37.677000+00:00","edited_timestamp":"2025-06-19T07:23:36.260000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1385156070028218418","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1385154907786706964","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I didn't do that shit, Jamie did. Fucking idiot.","timestamp":"2025-06-19T07:11:04.950000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1385153769511194674","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1385149440490213486","channel_id":"1382257309648158841","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, thanks for writing, \n\nWhen I suggest we are operating at 100% intelligence all the time, it is in reference to the fundamental observation that just like planting a seed or when a little baby animal is born, it automatically grows into and becomes what it *must* be. This is exactly the case with all people, we just do not acknowledge or understand this beyond a physical level because we perceive ourselves as \"do-ers\" of all actions that we act out. It is the case that you also act out and \"do\" what you yourself are. \n\nWhen you suggest something like \"well, I can consider a better way to manage my time, a better way to schedule my day, and a better way to give energy and motivation to my life!\" Yes this is true, but who is saying that other than yourself? This grand new idea is nothing other than your own being coming up with a new way to imagine its own life and experience. Metaphorically it is Mario levelling up and becoming Mario 2.0, which is just more of itself. You are saying \"My idea of myself has become better because I have more efficient and better ways of judging my idea of myself as better\". \n\nSelf realization is a discrete phenomenon that results in what I'm describing being straightforward in that there is no longer ownership over individual action. I don't feel responsible for any natural talents or defects I might have and I don't feel responsible for any good or bad ideas. They are just what I think are intelligent behaviors that I give a go and if they don't work or do work then this person will come up with something new as a result. In the same way that I have no idea what I'm going to write 20 sentences from now or say 10 words from now, absolutely no one does. It is the recognition that \"you\" are not in control of anything and don't actually exist as an entity, but are in fact the awareness of sensory experience as you become aware of it or how your body produces it. \n\nIt is not the case that you can't do the various things you've described in order to \"self-improve\" I am suggesting that you aren't improving anything, you are becoming yourself and are unaware of it. You are trying to say \"well this action will be objectively better, no?\" and the answer is \"well, you tell me. What if you were the only human being on earth and had no one to reference, would it be an improvement? On What? Who is judging and who is benefitting?\". Is there improvement? Is there change? or is there just you yourself acting and becoming more \"Me\", just like a seed becomes a tree, etc.","timestamp":"2025-06-19T06:49:21.445000+00:00","edited_timestamp":"2025-06-19T07:55:14.882000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"1008171159113699399","username":"randy_dev","avatar":"50e6c5e16ebad18fc3a65e70b9b4fb58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"randy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1382257309648158841","message_id":"1382257309648158841","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]