[{"id":"1287511347642499167","channel_id":"1283100544164167763","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is not a good idea to try to stop thinking about what other people think of you if you care about it. Self-realization causes this to automatically no longer occur because it is realized that what you were previously concerned with was preventing threats to your imagined self-identity. When it is seen that your imagined self-identity has absolutely no connection, ever, at any point in time to your actual self then your brain automatically stops that function. It is related to our beliefs about our ability to conceptualize past and future because our self-image is itself our imagined identity created from the past and what we try to modify in the future. What must be observed is that it is *only* our past and future, and that our actual selves never experiences the past nor future and has absolutely no contact with this imagined self at all. The imagined self is no different than the invention of an imaginary friend that is *distinctly* not even related to you at all.\n\nAfter SR it is helpful to think about what other people have communicated or expressed to you in thought because it helps you treat them more compassionately, help them, and improve your ability to not harm them in the future. There is no value however to thinking about what they think of you with regards to your own self-esteem.","timestamp":"2024-09-22T20:30:26.082000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"144643282683691009","username":".byran","avatar":"76b399888b141f59412598e32963fd83","discriminator":"0","public_flags":512,"flags":512,"banner":null,"accent_color":null,"global_name":"Byran","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1283100544164167763","message_id":"1283100544164167763","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]