[{"id":"1310470295441772575","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Your question is sort of similar to the famous \"Rat Park\" experiment if you want to look that up. Not exactly the same but somewhat insightful. Fundamentally if you had Soma like in Brave New World, which for the sake of this example put you in a blissful state without inhibitive physical side-effects, then yeah I think a lot of people would just be on it literally all the time. If you had a drug that induced a state of a love 24/7 with no side effects I think a lot of people would just take it and do nothing until they died. This again is likely why so many people are addicted to opioids because it seems to mimic this. The problem is that as a human there are basically no drugs without side effects, and you build a tolerance really fast so it's never the pure experience after the first couple of times. Your virtual reality example is kinda just stretching everything a bit too far because there are way too many assumptions to really make anything insightful. You can just think of pleasures as stimulative experiences for each sense physically, and love is an emotion like fear, anger, or sadness that is cognitive and based on perception. If you start tweaking people's senses, memory, and how they work then you aren't dealing with a hypothetical situation someone is in, you are inventing a new organism that doesn't exist in a world that doesn't exist and then I have no idea what would happen. \n\nThe examples of different pleasures are exactly as significant as the pleasures themselves. For example, just a personal preference but I've never really been that into music, and even when I've heard \"the perfect song\" for me at the time it was a pretty mild experience. It's just that the emotion of love as an actual state is so much better than anything else that if you experience it once then everything else is pretty surface level. If you haven't experienced it, which I hadn't my whole life other than glimpses, then you wouldn't know and so aren't aware how important it is and that it's really what you're growing into and trying to create. It's not like the monks who mistakenly give up worldly pleasure to try to achieve enlightenment, that is religious nonsense, it's just the main quest-line of your life and all the sensory pleasures and preferences are like side-quests and boss fights that are satisfying and rewarding in their own way and give you more insight on how to progress. \n\n> So, would you say love is only experienced with other people? I thought love was similar to what you're describing about the magnet but applicable to anything—if you're attracted to something and it's not based on ego or beliefs, isn't that love? \n\nIt wouldn't necessarily have to be as if it's a law built into the emotion, and I'd have to have more personal experience over some time to be more specific, but in my experience it as the very least never for activities or objects. I personally don't experience any emotion doing any activity at all, other than some are more interesting and engaging than others. The only thing that is of relevance is who you are doing them with and your connectedness to them. Again what makes it difficult is that when people use the word \"love\", 99% of the time it is a bit of a captive relationship of \"I would be hurt if this was taken away from me\", which is not actual love, but a push-pull with a negative emotion and the feeling of relief from that emotion which is a small pang of love.","timestamp":"2024-11-25T05:01:05.794000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1308134392916476047","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":115,"userName":"jamie0773"},{"id":"1307778629484281888","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> In here would you say if health and money wasn't an issue and not just that but your hunger/taste buds got \"reset\" every time you drank a milkshake so every time you drink one it feels like the first time you are drinking a milkshake, then would you ever pursue anything else\n\nIn the spirit of what I think you're asking, then no, just because something tastes really good and is a very novel experience doesn't elevate it to some sort of higher objective or experience in life. It's still just a pleasure, like listening to new music every week when it comes out. Even if you could keep listening to new songs endlessly and all of them were exactly your taste, it would still just be a very small part of your life and you would still go about your day pretty much the same. Having something that is always a novel, new experience isn't even always desirable, in that a big part of the joy of going to a new restaurant for example is being able to share that knowledge/experience with another person (relates to love), not to accumulate an infinite number of novel memories for yourself. \n\n> if you were receiving pleasure eternally meaning you wouldn't get bored or distracted by other emotions \n\nEmotions are adjacent to pleasure and not connected in any way. Pleasurable experiences are sensory perceptions, like physical pain. Avoiding excessive physical pain is definitely a psychological priority, in that usually excessive pain indicates sickness or severe injury that might kill you. Your brain does prioritize this over achieving love because you can't experience anything if you're gone. Pleasurable experiences of the senses include things like good music, tasty food, stimulating new ideas/novelty, sex, and anything related to interacting with the environment. I wouldn't disagree that saying \"the highest form of sight is beauty\" or \"the highest form of taste is something delicious\" or \"the highest form of sound is music\". A lot of classical philosophers thought achieving this was the meaning of life, same with Religions, which was to elevate physical reality to the highest satisfaction of the human senses; hence churches, and hymns, etc. \n\nLove is not this, but an emotional state like sadness, fear, shame, or anger. It is extremely rare (at least in my experience), and I personally had never experienced it previously except very briefly as a child, for an afternoon the first time I did psychedelics, and then finally \"completely\" for a day or two leading up to self-realization after a partial insight that relieved a lifetime of needless ambition. Since then it now occurs in relationship to people I'm attracted to romantically (I imagine this function changes dynamically depending at what stage of life you are in). \n\nExperientially it operates exactly like how a magnet has a field around it, and things that enter that field emit an attraction. The intensity is then modulated by the level of rapport/communication you have with each other. It's exactly like how you usually have anxiety around someone you like, and as they walk up to you it gets more intense, and then peaks when you are communicating. That just gets replaced with something positive instead of fear, and it feels like it emanates outwards rather than anxiety, which feels like it's stuck inside of you. \n\nTo add to what you said, you're right in that you could make the argument that if something was *so* pleasurable why would you do anything else? In the spirit of that argument, emotional love is that experience. If you experience it once you know instantly that it's what the entirety of your life is about. If you were to liken anything to \"why wouldn't you just do X all the time?\" it wouldn't be food, or music, or sex, but something like hard drugs that do change your emotional state. It's likely the reason that so many people throw their entire lives away on opioids, because I imagine they put you in that state temporarily.","timestamp":"2024-11-17T18:45:22.621000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1306702643074302054","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":112,"userName":"jamie0773"},{"id":"1306679886978482287","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I would fundamentally suggest that yes, having eternal pleasurable experiences would be better than physical suffering or staring at a wall doing nothing, but pretty much all pleasurable experiences are just to encourage the survival of the organism or the species ie. sex, nutrient dense food, physical comfort. If you lack these things then our self-image causes us to often feel emotional suffering for not having them which creates an illusion of happiness when we are able to have them, but that is typically a form of relief or just \"contentedness\". Don't get me wrong, if it made no difference to health or I could just do it, I would be drinking milkshakes on the daily and would rather be a billionaire than broke, but all of those things satisfy the senses, not anything emotional. Nothing wrong with pursuing these things at all, but only as a means of seeing for yourself that they aren't gratifying long-term other than a sense of lack from *not* having them, and you can grow/learn from that. \n\nEmotional love is what we are all trying to experience, which is (not encouraging it) what people experience mildly if they are neurotic and drink alcohol, or significantly if you take psychedelics or opioids. Love isn't dependence or attachment, which is how most people use the word. It's not at all that you can't experience love if you're not self-realized, it's just that if you have a self-image love is always conditional. I would personally say I had never and was not capable of experiencing it in the past other than as relief, although I think my particular beliefs about myself made it much more difficult than most. The irony is when most people are in the sort of honeymoon phase of a relationship, that is where actual love often shows up because you don't have anything to lose yet psychologically, and are very excited about a relationship with another person. \n\nPeople experience excitement and potentially love in relationship to their ego when they think they are going to \"get\" something they don't currently have that will fix or improve their image of their life. But usually when people actually start saying \"I love you\" that is the start of the end because what they mean is \"I'm attached to you and would be hurt if you were gone\", which is not love, just something that prevents and relieves suffering/loneliness. Again, I'm not dissing when people say \"I love you\" to their friends or families, it's just slightly melancholic because what they mean is \"I am dependent upon you, please don't hurt or leave me\", they are genuinely saying \"I have emotional love for you\" except in rare or conditional moments.","timestamp":"2024-11-14T17:59:21.994000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1304159107875606562","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":110,"userName":"jamie0773"},{"id":"1303691748073275463","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'm probably deviating from the point, and sorry for misunderstanding what you're saying exactly, but to say a few things:\n\nIf you were to never get full, never get fat, and could have anything you want - would that be happiness?\n\nThe answer is no, it would be pleasure. It would be no different than saying \"what if you could have sex all the time, every moment, with no down-time?\"\n\nI'm not saying these are not important things, I am saying that this is missing the *entire* point of human life, which is genuine, emotional love. The other things described are pleasurable, and if you experienced them every day until you died that would be a decent life. It is not what is *possible* in terms of emotional wellbeing.\n\nI want to stress that \"what is possible\" in regards to human wellbeing is that state of love. Nothing else is important.","timestamp":"2024-11-06T12:05:34.162000+00:00","edited_timestamp":"2024-11-06T12:06:58.342000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1299003243183214644","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":108,"userName":"jamie0773"},{"id":"1298951289186684969","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I completely recognize where you're coming from. The only contention I would bring up is \"do that forever, does it make you happy?\"\n\nInfinite money, infinte sex, infinite food, infinite pleasure. Is this what you actually want? I am not saying it is or isn't, I am just suggesting for your own inquiry, it is that if you had \"all of it\" would you simply say \"thank god I am eternally happy now\".? I\n\nI expect the answer is \"well that's not the whole story to happiness, but it's a piece!\"\n\nDope, what's \"the whole\"?","timestamp":"2024-10-24T10:08:40.690000+00:00","edited_timestamp":"2024-10-24T10:11:33.976000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1298634676478672947","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":100,"userName":"jamie0773"},{"id":"1298614037877231737","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If your current beliefs are that the meaning of your life and where you are going is to achieve contentment and material pleasure, then you will likely have to experience that to realize it is not the case. I can make the argument that every rich person who has ever lived has said \"money doesn't buy you happiness\". Every attractive person also says \"being hot doesn't bring you happiness\" although that is even more politically unpopular. \n\nSo then what? If I say \"These things are not valuable\" but you say \"yes they are\". Then maybe they are to you. Try them out, do them, and see.","timestamp":"2024-10-23T11:48:33.712000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1298149588275953744","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":96,"userName":"jamie0773"},{"id":"1294069819276132475","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Is happiness the achievement of getting everything you want? How do you know this is the case? If it is has happened before why do you want something else now?","timestamp":"2024-10-10T22:51:27.570000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1293210800567091281","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1293116181779054655","channel_id":"1291413114448904264","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'm not sure if this directly relates to what you're saying, but the rejection to the philosophical attitude towards life of \"it's all about balancing personal pleasure\" is a couple of things:\n\n\"if you had everything you wanted, all the time, everyday, what would that be and would your life be perfect?\" \n\nIf you do live a life of pleasure, it is always defined by a life of sex/food/validation. The ultimate philosophical answer to this contemplation is really straightforward: Imagine you have everything you ever wanted. Then what? Are you happy? How are you different? Once everyone on earth views you as perfect, and you have the perfect life...then???\n\nTo go a bit deeper, pleasure is ultimately fairly meaningless. It is nice, that's for sure, so no need to disrespect a good massage or resort, but it is not what life is about. I'd of course encourage your own examination of these things, but life is about creation and making new experiences that haven't existed before through your own capacities and actions. All pleasure is a sort of \"side-note\" of anything that you ever do and are rewarded for.","timestamp":"2024-10-08T07:42:02.673000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1291413114448904264","message_id":"1291413114448904264","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]