[{"id":"1435751959536861284","channel_id":"1426440183376773180","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's just because you are hearing something said by someone else, recognizing yourself or something tangential to your life in their speech, then emotionally reacting to how it affects you. \n\nLiterally our ego/self-image is the accumulated knowledge of who we think we are and what our life is. Metaphorically, you can imagine a big sprawling cloud of gas called \"Me\", which includes \"my past, my future, my relationships, my politics, my virtues, my vices\" etc. When someone else mentions one of those things in a negative or positive light, or it causes you to think of those things in a negative or positive light it's like a big shockwave gets sent through that cloud and blasts a hole in it. You then have your attention immediately draw to that area, an emotion occurs, and need to rationalize or justify the situation in thought to patch it up. \n\nImagine that everyone walks around surrounding by these clouds of identity/ego 24/7 all the time. What is actually occurring however isn't people shooting shockwaves at each other, it's actually people saying whatever they're saying, and if someone else feels affected they shoot a shockwave at their own cloud from inside the cloud. They however perceive this as the other person attacking them and shooting the shockwave. \n\nThis is why when you get into a loop of negative thinking, it is often accompanied with thoughts of \"I fucked my life up\" or \"everyone thinks I'm a loser\" and what your brain is trying to do is patch up a giant hole in the cloud with rationalizations and justifications. The bigger the hole the more difficult it is to do and takes more time. What is not seen is that there is no need to do this in the first place because even these seemingly giant concerns actually don't ever mean anything. \n\nI know this is a big stretch of imagination, but what self-realization causes to occur is the cloud just dissappears. When people refer to ego death it often means your cloud was hit with such a giant shockwave that it blows apart 90% of the whole thing (think wife has been cheating on you for 10 years, or your kids die in a car crash, or you're a pro athlete and lose both your legs) and you have to completely rebuild a new identity with new self-beliefs and motivations. Self-realization is instead realizing you don't need any identity or any self-concept whatsoever and it's just an effort to imagine your life positively instead of experiencing it exactly as it is directly all the time. \n\nNot sure this is helpful but just something to consider, but take for example if someone says \"god, Canadians are such dumb fucking idiots\" there are lots of Canadians who get a shockwave in their cloud and try to rationalize or fight back to resolve it. If someone were to say this and you have no cloud whatsoever the *only* effort is to observe the other person and ask yourself \"huh, wonder why this guy hates canadians\" - which is *actually* what is occurring. there is absolutely no self-identification. Similarly, there is no need for rumination, just situational problem solving. If a girl recjects you on a date but you like them, you just think \"hmmm, she didn't like me, what could I do to be a better date?\" you don't think \"well I thought I was cool, but now i know I'm not, my life is in tragic disrepair until I have a good date and make more money and get jacked and then I can imagine myself as better\".","timestamp":"2025-11-05T22:05:42.135000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1426440183376773180","message_id":"1426440183376773180","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":29,"userName":"jamie0773"}]