[{"id":"1450032341245362338","channel_id":"1450020465820172421","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean I think it's just a continual progression of the same thing. While it's true that self-realization itself is phenomenological, the explanation of experience to other people afterwards and your own ideas about life are intellectual, so it's been difficult to evolve those concepts to share. \n\nAn example is that I originally communicated the idea like one week after it happened as \"cutting the umbilical cord between thought and emotion\" and a lot of people thought it was like a mental break \"are you ok?\" type of thing. After a while I communicated the same thing as something like \"the cessation of emotional relationship to self-imagination\" which is pretty accurate, but I feel like maybe only around now I'd be comfortable being like \"ok, these expressions have settled with me long enough to write them into a book to share without wanting to change them significantly later\".  I'm totally fine with other people not understanding what I'm saying, but I'm not good with poorly expressing what I am even trying to say. \n\nI don't think there any particularly interesting new insights from my own perspective, but I think when I finally get a little book together it will have a lot of points I haven't expressed directly here like the function of human emotions and essentially \"building a person\" regarding the ruleset we operate with as individuals. It's a bit difficult to flesh out in one comment and it doesn't really \"help\" anyone, but I think it will be a really valuable angle/insight that relates to the future of neuroscience and even things like AI robotics, etc.","timestamp":"2025-12-15T07:50:50.451000+00:00","edited_timestamp":"2025-12-15T07:50:54.825000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]