[{"id":"1307783167989645434","channel_id":"1306487055987245167","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Capybara basically summarized it. The error in our actual brains is we directly perceive reality as it is all the time in immediate conscious experience, but have also invented a fictitious entity in thought called \"Who I think I am\" that is a recursion of our immediate experience that occurs at a different point in time that we call \"My life\". When we worry about dying for example, we are not literally in danger in immediate experience, we are worried about this fictitious recursion in thought who might die. When we worry someone might reject us, they are not actually rejecting us because we haven't done anything yet, we are worrying about this fictitious recursion of ourself in thought getting rejected. The belief is that this fictitious representation is a past reality or a possible forthcoming reality. \n\nThe insight is that this fictitious recursion of ourselves *never* exists. It's not that it hasn't happened yet, might not happen, or has already happened, it is entirely untouchable by reality. You *cannot* experience it. It is not a meme to say \"the time is always 'Now'\". It literally is. *That* is the fact. You cannot have a representation of yourself that exists in the past or future because you are literally incapable of experiencing something that isn't currently happening. \n\nThe notion of \"accepting the fact\" simply means that reality itself only has one state. That state is what you see when you open your eyes or think a thought and it streams into your consciousness right now. That is all that reality is. We mistakenly assume that like a book, because we are reading one word right now, then another word appears, we recognize a pattern and assume that there were thousands of words behind us and thousands of words to come, and that we're experiencing a book. You are not experiencing a book, reality is a single word that dynamically transforms into the next word. There is only one word that constantly changes, there is no previous or next word. Seeing this is the case results in \"accepting the fact\" which is realizing there is no book, only the exact current state of things.","timestamp":"2024-11-17T19:03:24.685000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1306487055987245167","message_id":"1306487055987245167","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":50,"userName":"jamie0773"}]