[{"id":"1351749411402809424","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What I'm communicating is phenomenologically true in the way I've described and experienced it. All that I can really suggest is that it's not supposed to be a hail mary \"sacrifice everything for salvation\" that a lot of people want it to be or pretend it is. Even after the fact you still have to contend with exactly the same world you were in before, just with a different attitude.\n\nIf self-realization results in the complete cessation of attachment to our beliefs, it might be helpful for me to suggest that a more conventional means of getting similar emotional results is through modification of our beliefs through new experiences/learning, and conforming our lives to those beliefs. The effort to improve our physical circumstances we call self-improvement, and the effort to modify our beliefs to be more helpful is therapy. Both will improve your emotional state. They are not complete, but they are incremental and do work. There is no reason you can't improve your life and modify your beliefs about yourself as you grow and change, which will cause your mood to improve while also examing what we're saying here. \n\nI don't want to endorse the hippie/spiritual attitude of absconding from your own material life or beliefs for the sake of some imaginary pursuit. Self-realization is completely integrated into your life, whatever it is. It is not a sort of psychological refuge like escaping to the mountains or being like \"life isn't real\" or something like that. \n\nTo be very practical, think of this from your perspective like investing in stocks. I have no idea where you're at specifically, but obviously you find the ideas/phenomenon we talk about here attractive. You might say \"I'll invest 20% in that\". You might also look at other places in your life and say \"I'll invest 30% in getting a degree and trying to get a good job\", maybe you'll put 25% in sports or the gym. These are all things that are valuable that will grow, change, and turn into something later in your mind/life. What I'm suggesting is that you have to act on what is important to you right now, improve your life, live your life, and what we're talking about here will grow in stock from 20% to one day being 40% to being more and more and eventually it will sort of eat everything else and collapse to nothing, and there will be an \"oh, *that's* what it meant\". But if it doesn't seem like it's helping you in any way right now, then reduce your investment and pursue other things. I can assure it's not going anywhere, it is part of everything you do, it's just a matter of your own stage of life whether or not it resonates or lands to you.","timestamp":"2025-03-19T02:49:33.968000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1348968950985261107","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":82,"userName":"jamie0773"},{"id":"1306322819541499915","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The first thing I'd point out is to be aware that everything you are saying is your self-image itself. Notice that he could be saying anything, and it is causing beliefs you have about what he is saying to activate and cause distress and spiralling thoughts. This itself is the structure of\"beliefs\" I am encouraging people to look at. \n\nFor example, you *believe* he is talking about enlightenment, you *believe* it is a superior moral or physical state, you *believe* that you are not this, and so now you feel scolded and guilty for your own identity. \n\nAll of this is self-invented. Firstly recognize that he isn't talking to you. He isn't even alive, has never met you, and so can't be talking to you. Yet, in the words you say \"that is me, he is talking about me\". What is happening is your self-image is being hurt because what you actually think you are is a series of identifications and abstractions. In my video I give the example of someone saying \"Republicans are morons\", and someone saying \"hey, I'm not a moron!\" when the person isn't even talking to them. This is what is occurring and what you need to lean into and examine. The reason you are mistaking yourself for these identifications is because you are not sure what you actually are and are instead approximating with your beliefs. \n\nWhat J.K. is referring to is this, he is referring to suffering that is unknowingly created for ourselves through false identification with our beliefs about ourselves. The deterioration he is alluding to is the creation of an imaginary identity that is being constantly hurt by other people's thoughts and our own ideas. The reason self-inquiry is just \"look at yourself and understand it\" and never \"do this, do that\" is because all you need to is understand yourself, and then it is immediately apparent that you have spent your whole life hurting yourself and your brain immediately stops.","timestamp":"2024-11-13T18:20:30.483000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1300998613761134684","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"},{"id":"1298929077364723742","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think the major thing to look at is what you have addressed in your first paragraph:\n\n> I guess this is the thing, you don't assign characteristic to literally everything not just yourself. In some hard to describe way I have real relationship with all objects of thought not just my self image. I view people as good and bad, I view them as \"having\" a past and future and characteristic. I continuously dread the future and regret the past no matter what because I just believe it's always there. It's just not at all obvious to me what is causing this \"objects of thought have weight\". Why do I believe there are actual things? Suppose I didn't believe I am an imaginary other person that is my self image, I'd still believe a pen has a past wouldn't I? Isn't this \"characteristic assignment\" the actual problem?\n \n\nTake exactly what that is all about and wage internal war against it. Figure it out. That's the whole story, the whole point. The whole idea. The objection we have with our own ideas about ourself and our own concepts is the whole story. t that.","timestamp":"2024-10-24T08:40:24.979000+00:00","edited_timestamp":"2024-10-24T09:32:54.711000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1298705927956074507","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1298619201577287712","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is just fundamentally incorrect to assign characteristic to anything. Any specific thing is always \"exactly what it is\" and that has no duration. \n\nLet me give you an extreme example:\n\nIn the 2nd world war, the Americans obviously thought it was \"bad\" to bomb Pearl Harbour. The Japanese military combatants who acted out the operation thought \"I am doing something to greatly honour my country and family\".  So the Japanese in that context thought they were doing something \"good\". \n\nWho was correct? Neither person was correct. There is no such thing as \"correct' other than the thoughts or beliefs in the minds of people. There are only the actions that occurred. The thoughts, the actions, the destruction, the political repercussions - all of it simply was what it was. \n\nTrying to spend time trying to figure out \"who was right or wrong\" is an expression of someone's own suffering because there is no right or wrong when all that exists are actions. It doesn't mean you can't say you made a mistake or that you haven't learned anything from others, it simply means that the \"error\" lives and dies with the event.","timestamp":"2024-10-23T12:09:04.834000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1298553605653270548","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1292749079704768563","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"\"Bad\" doesn't exist, it is a psychological categorization of events or behaviours like \"tall\" or \"smart\". Saying \"well I did that because I'm a bad person\" is as nonsensical as saying \"I cheated on her because I'm *tall*\". It is avoiding the actual experience and indulging in the invention of a false self-identity. It is necessary to drop the identity and engage directly with the experience or else there is neglected responsibility. \n\nAbsolutely every time you or anyone says \"I did that because I'm a *broken* person\" or \"I did that because I'm a *bad* person\" you can just delete the word and say \"I did that because I'm a person\" and then you can say \"I did that\" and then you can say say \"I didn't like that I did that\" and then the resolution always is not making that mistake again, trying to make amends, and doing your best to make more intelligent choices in the future.","timestamp":"2024-10-07T07:23:18.718000+00:00","edited_timestamp":"2024-10-07T07:23:45.635000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1292735967593238580","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1292735073807896618","channel_id":"1290727166119510177","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Just firstly from my own perspective, there is a prominent emotion of shame/guilt that remains after self-realization, it's not like you become a sociopath who doesn't care about past harm to others, it's literally the opposite. Shame/guilt no longer occurs in relationship to ego/self-image (I haven't lived up to other's expectations of me) but does persist in relationship to direct communication of hurting others emotionally or physically. If you do something that causes another person to express sadness, anxiety, or displeasure in communication, then you will feel a sense of guilt/shame and want to make up for it/correct it. If there is self-image/ego, then this is nonsense like \"I will get into Harvard so my dad won't be disappointed!\" (for clarity, no problem going to Harvard, it is the 'to make Dad proud of me!' part\" but without ego it is \"I said xyz and I accidentally hurt this person's feelings. I will communicate with them what I really meant and try to make amends\". \n\nI think there is an optically not obvious line between delusional narcissism and self-realization, which on the surface might both seem like \"You are always making the best decisions you can, so regret is an error\". The difference is that narcissists think \"I was making the best decision I could at the time *so I didn't make a mistake* and therefore don't need to devalue my self-image by apologizing\". A self realized person will not have regrets, but will also see that they hurt someone and say \"I'm really sorry about that, I learned from it, will try to make it up to you, and will now make more intelligent decisions in the future\". One is entirely about upholding an \"I am infallible and perfect\" insecurity and the other is just learning and responding to make things better without suffering. \n\nThe most prominent part of what you are saying in my opinion is *The last situation implies you are fundamentally broken and causing problems*\n\nThis is never the case. The only thing that ever occurs is decisions or actions that have caused harm to others you would like to correct for or fix. Coming to a self-identity of \"I'm a problem\" or \"I'm broken\" is always a form of self-image and coping because it is deferring responsibility for individual actions to an imagined character that doesn't exist. It is no different than someone being like \"hey, I was really hurt when you didn't get me anything for my birthday\" and saying \"oh, that was *Joker* who didn't get you anything\". It is similar to saying \"oh, that was *drunk* me\". Yes, it might not be the most rational and lucid form of cognition you usually experience, but it is nevertheless yourself, and being like \"lol doesn't count\" is negligent. The reality is just \"Yeah, I'm really sorry I made a mistake and want to correct for it\". The most you can ever do is that, and what is even more important than that is the awareness of what is even a mistake or not in the first place, which is back to self-inquiry.","timestamp":"2024-10-07T06:27:39.452000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1290727166119510177","message_id":"1290727166119510177","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]