[{"id":"1316657584949690378","channel_id":"1311036425633923142","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"This relates to the \"zooming out\" that I've described where what can be observed is the sort of meta-conditions under which anger arises. As an example, anger when experienced without self-image only occurs when you feel someone else is being unjustifiably physically hurt by another and you are able to intervene by hurting the assailant. \n\nIn the context of ego/self-image, anger occurs when you perceive (in imagination) that someone else is making an error that will cause harm to your imagination of who they are or your imagination of other people. It essentially occurs when you believe someone else is making an intellectual mistake that you believe you can correct. \n\nWhat is actually occurring when we get angry at another person for not taking our advice is we are imagining the other person's life (image of them) and we are imagining their future actions as harmful. We then get angry because we want to intervene and hurt this person now (with our ideas) in order to prevent them from hurting others in the future. The error in this understanding is that we are not imagining their future actions, we imagining our subjective interpretation of our image of them, and then trying to get them to communicate back submission to our ideas sufficiently so our imagination of their future no longer contains the belief they will hurt others. Getting angry at another and telling them what to do in this context is actually just our own suffering (anger at a perceived future) being changed to the perception of a more desirable future. All of this is in our own beliefs and imagination, not in the other person.  \n\nThe root of the belief in this context is the same as all of our beliefs, which is examining our relationship with imagined past and future and what it really is (just our own thoughts in the present, not an external objective reality).","timestamp":"2024-12-12T06:47:10.567000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1311036425633923142","message_id":"1311036425633923142","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]