[{"id":"1272418541953355776","channel_id":"1266021635136290818","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, glad you found the videos helpful.\n\nWhat I'm fundamentally communicating is that there is a realization about the nature of how we use thought to conceptualize our life, our past, our future, and our self-identity that results in a sudden insight and \"a-ha\" moment that is results in the automatic and physiological cessation of emotional relationship to self-imagination. \n\nThe basic premise is that we have learned to try to conceptualize our own self-concept and constantly think about it ever since we learned the word \"Me\", but have never fundamentally questioned whether such an effort is necessary or what that \"Me\" even is we are contemplating. \n\nTo elaborate more on self-inquiry, when you are asking yourself \"what do I think I am?\" that is checking and evaluating your self-knowledge, which is your beliefs about your own identity and what you think is true about what you are doing. This is your self-image or ego. This is important to observe and understanding, but recognize that your self-knowledge is an identity in thought that you emotionally relate and believe to be yourself. The root of self-inquiry is to notice that there is emotional relationship to this self-concept, and for example, when someone says \"you are ugly\" this might make us sad or angry because we believe they have unfairly hurt us (anger) or that we are further away from communicating compassion and love with others (sadness). We then would say \"well I was sad because they insulted *Me*\". But did they? \n\nThe assumption is that our physical attractiveness is part of \"Me\" and so they have attacked or hurt \"Me\". But what has actually occurred is that they have attacked what we think about ourselves. Our actual physical attractiveness does not change before and after an insult, the fact remains the same, but what we think about ourselves (ego/self-image/self-knowledge) has been hurt. The question at the core of self-inquiry is recognizing that this self-concept is clearly not actually us, it is just all the thinks we think and believe about ourselves, and then consequently, we must inquire into the question of \"I exist, I have always been 'Me', what actually is that? What is my single experience I call 'Me'?\" and that is the real fundamental and transformative focus of self-inquiry after examining what you think about yourself.","timestamp":"2024-08-12T04:57:00.795000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1017126156572577893","username":"amber_marie91","avatar":"1e4bd3146e878bc297c0e6fd944e1ecd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Ambermarie91","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1266021635136290818","message_id":"1266021635136290818","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]