[{"id":"1359686430032527473","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The biggest areas that self-image controls people and gets them stuck in forced patterns of behaviour and psychological suffering is any cluster of beliefs that cause significant emotional reaction that are repeatedly triggered by their present environment. \n\nThe most common ones are beliefs about relationship, beliefs about their own success/failures, behaviour of others (politics/religion are big examples), and things like moral philosophy of right or wrong. All of these however are rooted in our perception of time (past/future) because our emotions are attached to these beliefs because we believe they could be different than how they currently are. Attachment ends with self-realization because all of these things are seen as \"facts\" in that \"everything is currently exactly how it is\" instead of seeing things with multiple plot points that have to be reconciled.\n\nAn example of this is obvious in something like envy or jealousy. One example of jealousy could be seeing someone we haven't seen since highschool who was always kinda lame and not that smart, but they have now made a bunch of money and have an attractive partner and we think \"wow, they must have got lucky or something because I'm better than they are but don't have that success\". A person experiencing this will also get angry at a third person being like \"wow, what an impressive guy!\" because we feel they have the \"wrong\" opinion of this person and shouldn't be impressed, but rather doubtful or suspicious. This combination of anger (the high-school person doing something wrong) and regret (guilt at our own shortcomings or failure to act correctly in the past) create a future demand to resolve these two emotions in order to put yourself \"rightly\" in a superior position to this other person and correct your friends \"wrong\" opinion of them. This is again entirely subjective but a person could have beliefs that result in this pattern. \n\nThe root \"reason\" that this causes a problem is because we falsely create comparisons of who we think this person is to who we think we are and try to reconcile these models. Because this requires devaluing our own self-identity, we cope by suggesting things are not supposed to be this way and could have been or must be made different.\n\nFrom my perspective, it's not like these things happen and you don't care at all, it's that if there is automatically no imagination of past or future, all that ever exists is what is right here in front of you right now because that is actually what has always been the case. You aren't observing a past kid from your class and comparing them to the adult they are now, they are literally the same person. *That is them*. A good quote on the topic is that \"all suffering is being unable to accept the fact as it is\".","timestamp":"2025-04-10T00:28:26.672000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":16,"userName":"jamie0773"},{"id":"1359677201477533777","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The self-image is essentially the view that our life is like a bead on a string that runs from our past, through our present self (the bead), and then extends into the future until we die. This is the background or framework that the model of \"My life\" or \"Me\" exists within. The essential misunderstanding that I had and nearly everyone has is not seeing that it is *literally* the case that you never experience anything except exactly what is occurring right now, and so modelling \"My life\" in thought is both unnecessary and technically impossible. \n\nIt is unecessary because like counting, you only need to know the number you've counted up to so far in order to know what numbers came before and what numbers come after it. If I say \"10\" I can computer all the numbers that came before that I must have counted, and I can compute all the numbers that come next. I don't need to \"hold all the numbers simultaneously and then selected the next one in the sequence\". Metaphorically, if the next step is in the right direction, you don't need to consciously hold onto the destination, the \"is this next step correct?\" is itself a confirmation already that the destination is correct, you don't need to do something twice. \n\nIt is technically impossible because the model is being created by present experience and exists in present experience, and so can't actually contain any information about another state of reality in the past or future. It is almost a sense of humility that makes you realize \"oh, I can't think about alternate states of the universe because all of my thoughts just exist in the present state of the universe\". Every dream and every memory you think was a previous or future state of reality is itself just an appearance in reality as it is now.","timestamp":"2025-04-09T23:51:46.413000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1345838340347269283","message_id":"1352945991678038067","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":15,"userName":"jamie0773"},{"id":"1351804540453654572","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I guess all that I can really express subjectively is that when there is the *a-ha* or click moment that results in the phenomenon I'm hoping to communicate, there is then the automatic relationship to thinking without emotional attachment or identification that results in this perspective.\n\nThe nature of that realization as we've discussed seems to be somewhat subjective but around the same core misunderstandings - to elaborate on what you're asking specifically it is pretty straightforward but not necessarily that palatable:\n\nIf anyone were to say \"think of how your ex broke your heart\". \"Think how you would feel if your parents died\", \"Think of how you'd feel if you dated someone for 10 years and then found out they cheated on you for the last 4\". \"Think about how you'd feel if you tried your whole life to achieve your dreams but failed in the most miserable way\". \n\nOkay. New scenario. I want you to say the number \"one\". I want you to say the number \"5\". I want you to say the number \"179\", I want you to say the number \"6000\". \n\nOkay, so what was the difference between the first set of tasks and the second?\n\nI think most people would imagine \"yeah, the first set of questions were really impactful and charged. The second part was just me repeating numbers idk why you even asked that\"\n\nI'm only saying this because it relates to the progression I expressed before, but from my perspective there is no difference between saying a sequence of random numbers in thought or saying a bunch of memories that most people would find traumatic. \n\nI'm not suggesting I'm indifferent to the suffering of people compared to the number 4. I'm saying that both are thoughts and thoughts have no \"meaning\" despite being real events that occur in our perception. I care about actual death, actual suffering and would act to negate that, but I have absolute complete indifference to \"thinking about something bad\" and any other thought. This is what I'm pointing to as the final resting place of \"My thoughts are true without meaning\".","timestamp":"2025-03-19T06:28:37.758000+00:00","edited_timestamp":"2025-03-19T07:44:54.912000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1345838340347269283","message_id":"1351789474119553104","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"},{"id":"1351767361627226153","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's really hard to see while you're in it, but the theme is like how a kid's problem is \"will I get the PS5 for Christmas?\" he is not thinking \"do my parents have the finances to get me this?\" He is instead thinking \"was I good boy or not? What does Santa think?\" and his whole psychology is centred around his naughty or nice behaviours. The underlying \"belief\" is that there is such a thing as Santa who delivers presents. This is still not addressing the root cause of the PS5, which is if your parents have performed well at work and have a holiday bonus to buy you a PS5, but it is layers upon layers upon layers of how an individual \"perceives\" what is happening to them. \n\nFrom my own experience, when you are really getting into self-inquiry, like therapy, you feel like you are progressively getting closer and closer to the \"root\" of the problem, but you never actually do because there is never absolute certainty in your beliefs about casual events nor in the certainty of their outcome. The *actual* conclusion relies on going deeper to what is the nature of thought as a modelling tool with no duration (past/future) and that it isn't a comfort in not knowing, nor believing you are unable to know, but realizing what *knowing* actually means as a sensory perception that makes it fundamentally fun and interesting, but somewhat meaningless and unimportant. It is a movement from \"I care about what I think\" to \"I care so much about what I think I need to figure out what is true\" to \"I cannot know what is true\" to \"my thoughts are true but without meaning\". The first three are progressive and elements of knowledge accumulation and learning, the last is sudden and unrelated to the previous ones.","timestamp":"2025-03-19T04:00:53.635000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1345838340347269283","message_id":"1348524965795856426","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"},{"id":"1351763228786561085","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is \"solving the problem/question\". I did genuinely try to figure out what the answer to something was and resolve just like a homework assignment, there wasn't any sort of meditative \"let's just *see* what the brain comes up with\" or anything sort of spiritual. Doesn't mean that's wrong, just not how I did it. That was just for me what lead to my own *a-ha* moment of the whole inquiry. Every individual just needs to pursue their own confusion in thought, resolve it, and it leads them to the same underlying structure of inquiry, which is the absolution of all beliefs or identifications entirely. It's an \"all roads lead to Rome\" scenario, and I genuinely mean *all roads*. Absolutely everything you ever do in your life is on the same path which is the eventual peace, contentment, and awareness of your own being/life combined with the physical manifestation of what you are externally. All I can really say is that the big confusion I had in my life was my relationship with time and duration that was not what I always thought it was.","timestamp":"2025-03-19T03:44:28.289000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1345838340347269283","message_id":"1346112865987465217","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":8,"userName":"jamie0773"},{"id":"1346090129634365514","channel_id":"1345838340347269283","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"From my own perspective the most helpful things to look at were questioning my own experience of time, past/future, and of what I thought was good/bad or right action. \n\nAnother angle to look at would be from what causes you the most emotional distress - things like death, failure, regret, longing, ambition, relationship, loneliness, and to take ideas you have in thought that you feel the most emotionally attached to and try to start by disentangling or approaching those. \n\nNot sure if this is helpful, but if we sort of go back to brass tacks of self-inquiry as \"talk-therapy\" but down to the core, then it might be helpful to start at the things that bother us and use those as hooks to probe into. \n\nNot saying this applies, but things that bother us or plague our emotional relationship to our lives are the loose strings that then get re-integrated into a singular whole, and where direct attention is both motivated and also most beneficially applied.\n\nI think I've talked a lot about \"this is the fault in the structure of beliefs/thinking that many are not aware of\" and a lot of people intellectually understand, but the depth of it is not in accepting or understanding that perspective, but in realizing the fault in the suffering created by attachment to our other ideas or experiences.","timestamp":"2025-03-03T12:01:36.050000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1345838340347269283","message_id":"1345838340347269283","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]