[{"id":"1321067965046587425","channel_id":"1320518252102684774","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I mean my largest priority now is just maximizing the wellbeing of how other's experience my interaction with them. For people I don't really share ideas with, then it is just maximizing positive experience and relating to them, and for people who I share knowledge/ideas with then it's about communicating that stuff more effectively while still trying to be as compassionate as possible. It's not really rocket surgery: after self-realization it's not like you get a special ability, you just don't care at all about your own imagined self-identity and so what's left is literally what has always been there absent of a \"Me and who I think I am\". \n\nThis is not SR'd advice, but I'd suggest that just because someone might be fishing for a compliment it is not always the case that it's best to give them one. It may be, it also may not be. There is also nothing wrong with saying \"likewise, you look amazing!\" as just a matter of socializing. While we talk about compassion here a lot, it is not the case that compassion means \"giving people what they want all the time\" it also doesn't mean the more stoic \"giving people what they need\". If you are bothered by how an interaction went, then ruminating on it and thinking how you could act more in accordance to how you'd like to next time is just an intelligent behaviour. \n\nIt is our self-image that says \"I fucked up and embarrassed myself. If I would have done *this* I would have been perceived more highly/won the argument/got the girl/boy, etc. \". But it is compassion that says \"I could have said something better, been more kind, been more understanding, expressed myself better, etc. \" and that is just the effort to act more intelligently in the future. In general, if you would have got something from certain imagined behaviour, it usually ego/self-image, if you think \"fuck, I shouldn't have done that, and should have done this instead to make things better\" that is likely also ego causing the emotional pain, but the resolve to fix it is just intelligence.","timestamp":"2024-12-24T10:52:27.123000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1320518252102684774","message_id":"1320518252102684774","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]