[{"id":"1447167053122240533","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Genuine emotional response is responding to physical events that occur in our immediate perception, and ego/self-image based events occur in relationship to our ideas or beliefs/imagination. A general example of observing this is that many people who are deeply engaged with ideas rather than direct immediate experience is that emotional reaction is stronger towards imaginary outcomes than to actual outcomes. A lot of political pundits are like this where they become emotionally enraged by the *idea* of something bad happening, and when anything bad actually occurs they're like \"yeah see? I was right\". This is the opposite to what is natural emotional reaction which is to use only your intelligence to argue for a good imaginary outcome, and then when something bad happens you feel the emotional result of it, which then modifies how you view the issue. This again is how everyone experiences things partially, but there is the second egoic layer on top of this that skews emotions and behaviour. \n\nTake Charlie Kirk as an example, my genuine personal beliefs is that he has unintelligent and poor takes on many things, and some empathetic and compassionate takes for the working class rural American on other things, and also has some valid criticisms of the American left. I see it as exactly that, a person with different opinions than me who is particularly engaged with American partisan politics. It is not much different than talking to Islamist and a Christian. If someone said \"damn, I used to be Muslim, but now Charlie has made me a Christian\", I view this as \"I had one belief and now I have a new belief\", which is largely what everyone is doing and you unfortunately just have to roll with everyone adapting, evolving, and changing their beliefs throughout their life, but again to sell my own non-existent book, the reality is that you're finally free when there are no beliefs, not a \"correct belief\".","timestamp":"2025-12-07T10:05:12.528000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1415524328728035390","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":67,"userName":"jamie0773"},{"id":"1415465050268762132","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Narcissistic people in general have really strong egos and are masters of rationalization and complete delusion, but you can imagine if this person were at the park with their kid, then as they were playing they accidentally stepped backwards and knocked someone else's kid over. They know it's their own fault, the kid is really hurt, all the parents are pissed off, and every social instinct is screaming for this person just to apologize to reduce the blame they are receiving, yet instead they rationalize and say \"what were you doing standing there?\" \"why weren't you looking after your kid?\" etc. The guy likely does feel a bit guilty deep down, because they know *some* part was their fault, but when they go home they are going to think \"How could I have better rationalized that situation to diffuse blame and positively frame myself next time?\" but if they just looked at it factually, they would say \"I knocked over a kid and accidentally and hurt them. Everyone was upset with me. I thought about apologizing, but that would make it look like it was all my fault when I was really only about 50% responsible, meaning people would think I'm more at fault than I was and that would overly diminish their view of me as a strong, masculine person by suggesting I made a complete error when I didn't. If that happened the men at the park would have admired me less and the women would have found me less attractive\". If you actually said that to yourself, which might have been *exactly* what you were thinking and feeling at the time, you would realize that you are complete fucking idiot because you would be saying to yourself \"I didn't apologize for hurting someone's kid because I wanted other parents at the park to admire me\" and this pattern of behaviour and belief system would immediately need to be examined and modified becauseyou would finally see your own pattern of thought and behaviour as irrational.\n\nA big part of self-inquiry is really \"getting the knack\" at some point where instead of swimming across the surface, you finally sort of see what you're trying to do and begin diving down instead. Again I think honesty/bluntness is a huge key and you can't imply or allude to what you think, you have to be exactly precise and factual with yourself or you won't understand your own behaviour or thought process.","timestamp":"2025-09-10T22:32:46.053000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":58,"userName":"jamie0773"},{"id":"1415465047643132046","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There's not any hard and fast rules or ways of talking to yourself, but you generally know when you are kidding yourself or being sincere. Any justification is by definition a way of rationalizing any action or behaviour. You don't need to rationalize or justify anything you just need to directly accept the action and experience occurred and continue from there laying out the facts and what you think. \n\nWe want to justify our actions, thoughts or emotions so we don't have to accept them as irrational or unintelligent, which preserves our ego/self-image and positive self-evaluation. In reality you *want* to see your actions, behaviour, and thoughts as irrational and unintelligent because then if you continue to examine them you will eventually find the cause and your brain will automatically fix it. A brief example is politics. If you are someone who is against illegal immigration and were asked to explain your beliefs, you might say \"illegal immigration is harmful to our culture as it deprives opportunity from legal immigrants, results in uncontrolled pressure on housing and unskilled job markets, and strains government assistance programs\". If one person says this, it might be completely and exactly what they believe. If *another* person says this it can be because they agree, but what they *actually* think is \"I believe in a white Christian monoculture, hate Spanish immigrants, and think me and my people are superior to other groups of people, who should be excluded from our society\". If you said this out loud you would get a very different reaction from both other people and you would perhaps be surprised by what you yourself believe and think it is extreme or irrational. If you use the politically correct phrasing of another person, then you will not actually know what you genuinely believe. \n\nA quick example is if you imagine a narcissistic guy in a relationship, he might have learned \"treat 'em mean to keep 'em keen\" as a teenager, observed the masculine \"bad boy\" or James Bond types getting girls, and only ever managed to get a girlfriend himself when he stopped being a super nice guy and started teasing people or being more aggressive. Flash forward 20 years he's in a terrible marriage and he has no idea why. A common trait of guys like this is literally *never* saying sorry or admitting they've made a mistake, as they view that as admitting weakness, which they think would make them appear submissive and unattractive. This is obviously really stupid to anyone on the receiving end of it, but the narcissistic person just thinks other people don't see the bigger game (\"you think you want me to apologize, but you don't see that would ruin your attraction to me\").","timestamp":"2025-09-10T22:32:45.427000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1415190952498171964","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":57,"userName":"jamie0773"},{"id":"1415188828150562836","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think that most people have difficulty understanding themselves because, like in talk-therapy, they don't actually directly say what they think, but instead couch their point of view in softer, more politically correct statements that don't allow further inquiry as their conclusion seems \"correct\" rather than true, and so they stop. You ironically actually want to inquire into what you think is true, but is actually incorrect, so then your brain understands and resolves it.\n\nAs an example, anger when it occurs genuinely is in response to unwarranted physical aggression, which allows you to physically harm another in order to defend yourself or someone else without experiencing shame from hurting the aggressor. This is the only way I experience anger now, which is basically never as I'm not frequently in physically dangerous environments. Anger in relationship to self-image/ego occurs when we *believe* that someone is harming another person in our imagination. The reason so many people get angry when Trump says or does basically anything is because they perceive injustice, deception, and harm in his rhetoric, which is actually a consequence of their own beliefs. Especially pre-election, when Trump says \"Make America great again!\" the rural industrial workers who had their standard of living hollowed out by America shifting to an import model post world war II were like \"Hell yeah! They ruined our country!\" while urban city folk often hear \"Make America an uneducated, white, Christian, racist isolationist backwater again\". The two groups have different emotional responses in accordance to what they imagine someone else is doing. If you *believe* this is true in your ego/self-image, it causes you to perceive that someone is causing unwarranted harm, results in a state of anger, and allows the person to harm the aggressor without experiencing shame (guilt). In the case of politicians or twitter threads, this is usually verbal hostility, but the emotion is exactly the same. Anger means you feel warranted in hurting another person, the more unjust their behaviour, the angrier you are, and the more you will want to hurt them. While it's not relevant to know, the reason this doesn't need to happen is because anger is not a pleasant emotion, and you only cause yourself suffering when other people's words or ideas hurt you like a leaf in the wind. You actually don't need to feel angry to deal with other people's bad ideas, anger actually makes your communication inaccurate, as part of your communication will be trying to inflict harm back to them rather than communicate your disagreement. \n\nAnyway, absolutely no one wants to admit this to themselves and no one would ever say this in talk therapy, but most people experience anger fairly frequently, but say to themselves or a therapist something like \"My partner frequently leaves the dishes in the sink and I always have to clean them despite asking for them to help. I feel they don't value or respect me\". While this is politically correct, and once you say it you're like \"yeah, that's pretty true, good explanation\". What you might have actually thought was \"When my boyfriend/girlfriend left the dishes in the sink *AGAIN* I just wanted to fucking throw the knife at them from across the room that fucking piece of shit\". The reason this is important is because if you say it like that, which was how you honestly reacted, you will then think \"Christ, that's pretty fucked up I was *that* mad over 5 minutes of cleaning dishes. What is really going on here?\"","timestamp":"2025-09-10T04:15:09.568000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1410334304608981055","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":55,"userName":"jamie0773"},{"id":"1415173507691712562","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If today is Tuesday, there is nothing wrong with nor an incapacity to make plans for going to the beach on Wednesday. This is accomplished by thinking. Most of us just say in conversation that we are planning for the future, all that I am suggesting is that you aren't literally planning for the future as the future does not exist. You are writing things down on a piece of paper in the present to remind yourself of actions you will take in the present when different physical phenomena surrounds you in your environment. You are not \"imagining yourself at the beach tomorrow\" you are thinking in the present. \n\nThis again might seem like a \"gotcha\" or \"yeah ok smart ass you can't *literally* think of the future because hurdur it hasn't happened yet\"  but that is not what I mean. I am not saying it hasn't happened yet, I am saying the future *never happens* there isn't one and it can't be experienced. When you did the planning yesterday you experienced it as the present, now you are the beach in the present, and later you will be going home in the present. You never subjectively experience anything other than the present. Time itself only appears when physical objects move, and even then it only exists in thought as an abstraction, as an object is only ever in one place at a time.","timestamp":"2025-09-10T03:14:16.886000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"721388489115172924","username":"river_rafter","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"riverrafter","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1407157266632806501","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":54,"userName":"jamie0773"},{"id":"1405132955050835969","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Your characterization is largely correct. When I look at myself in a mirror nothing is different in that I'm like \"yeah that's me\". In a literal sense there is no magic that occurs with self-realization. From my pov, I see things like you, I hear things like you, I \"everything\" like you except the characteristics of dreams and thoughts and how it affects emotions. The entirety of self-realization's effects can be summarized by saying \"I don't care what you or I think\", and that's all of it. The part again that is strange is the \"I don't care what I think\" in addition to what anyone else does.\n\nIf you are experiencing anxiety from a bad dream, that is needless and can end. If you are fearful because a murderer has chained you into a chair and blindfolded you in reality yeah... I'm not sure what percent is imagined fear and what percent is real \"I'm gonna die\". I experience fear related to immediate sensory perception as that is necessary for survival, I don't experience it related to thought or imagination.","timestamp":"2025-08-13T10:16:42.592000+00:00","edited_timestamp":"2025-09-10T02:28:56.783000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1398187248817803337","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":48,"userName":"jamie0773"},{"id":"1366055402684420147","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is an insight into the nature of our self-concept or \"Me\" that causes the brain to automatically stop operating with the use of a self-concept or imagined self as it is not necessary and only harmful. The basics of it is that a very young age we invented an imaginary friend called \"Me\" that we have thought about and worried about all of our lives because we perceive this imagined self as our actual selves, when it is just a misunderstood construct/model that exists in thought we try to use to navigate our past/future or \"my life\". The root of disentangling all of this is examining and understanding that your life does not and has never had duration. You have probably heard the cliche of \"try to live in the present\" but the actual reality and realization is that it is not possible to ever do or experience anything other than that.\n\n It's not my particular strong suit, but from a place of encouragement, it's not typically something that you read and then \"get\" like going from addition to multiplication or learning a new concept. It is typically very challenging for most people and takes time and effort to resolve, as it's essentially resolving your brain of all the beliefs it has created and is attached to, and is not something you incrementally add, but something you slice away a little bit at first and then eventually all at once permanently. This is automatic and not like \"getting an A+ by saying the right things\" but related to genuine and honest self-understanding.\n\n\nThe part that you are expressing struggle with is the self-identity and imagined self that you have been accumulating your entire life and trying to figure out. It is not resolvable and causes you and nearly all people so much strife because it does not exist and is completely fictitious. It isn't that you don't exist, it is that the demand you have to create an imaginary self you can analyze, criticize, and observe is fictitious. The loss of a certain past is fictitious, the desire for a certain reconciled or superlative future is fictitious, and all of it is linked to the imagined concept of \"Me and my life\" that was invented and given characteristic we believe me must conform to, live up to, or run away from that creates emotional strife.","timestamp":"2025-04-27T14:16:28.082000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1137147889123074099","username":"anakinslywalker","avatar":"811743dcca2958cab6aa21b1a1675786","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Fillmore","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1360724226360999937","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":12,"userName":"jamie0773"},{"id":"1359674722534555851","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'll first mention that things like severe depression, illness from brain injury, or genetic/metabolic diseases may all result in certain negative states that our outside the scope of emotional relationship to a self-concept. I would still suggest that if there are certain thoughts or ideas that one could read, think, remember, or imagine and that alters the mood that person is in, then it is still our self-image/ego at the root of the issue, although it may be exacerbated by the physical condition of the body or environment. What is not immediately apparent is that it isn't just a series of thought patterns creating emotions or modifying them, it is underlying forked layers/blocks of thought (Beliefs) that link together into larger clusters and trigger automatically in response to experience. For example, if someone has social anxiety, which is the subjective belief there is danger to our self-identity in social interaction, they will automatically experience anxiety walking up to a party or a girl they like. It isn't because they are thinking \"don't get rejected, don't get rejected\" it is the underlying belief that then manifests as anxiety, and then upon investigation the person can say \"that anxiety was because I didn't want to get rejected\". The *actual* cause is the subjective fear of social interaction, which is then caused by the fear of what that social interaction could mean for \"Me\", which is then rooted in memory and our immediate perception. \n\nAll that I can really suggest is that the phenomenon that I'm describing is not intellectual or a learned pattern of behaviour, it is a physiological switch or *pop* that is akin to separating two wooden chopsticks that were previously stuck together. They don't ever re-attach because it just physiologically doesn't work in that direction. You can't get back something physically that is no longer there. \n\nI am not familiar of course with your own first person perspective, but it sounds like part of what your describing is akin to the \"self is an illusion\" line of thinking that is in mindfulness and modern guided meditation. What I am describing is not an assertion, philosophical, or learned conclusion that there is no discrete self or \"Me\". It is the realization of what \"Me\" *actually* refers to in your individuated conscious experience that causes the illusion of \"Me\" in thought to automatically be erased as it is physiologically non-functional and without further utility. \n\n> Lastly, I’m curious about what you said about time. If anything, that could be the last piece of the puzzle. What do you mean by “The root of our misunderstanding is our perception and imagination of time”? In all honesty, I don’t think about the past and the future that much but I have thought a lot about what I should be doing at any given moment\n\nThis quote is the exact misunderstanding: \n> What do you mean \"The root of our misunderstanding is our perception and imagination of time”? In all honesty, *I don’t think about the past and the future that much*\"\n\nThe realization is that it is not possible to think about the past or future at all and it has never been possible. You have never experienced the past, never experienced the future, and cannot conceptualize or think about them at all.","timestamp":"2025-04-09T23:41:55.387000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1137147889123074099","username":"anakinslywalker","avatar":"811743dcca2958cab6aa21b1a1675786","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Fillmore","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1353020119852519524","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1351779453071528016","channel_id":"1346624647738687539","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"All really good thinking and I think you expressed what a lot of people relate to and it's not unfamiliar to me either. \n\nI think it might resonate to use the analogy of \"being scared of our reflection being hurt\". I think most of us can understand the idea that \"yeah yeah, if my reflection is hurt, it's not really me\". We are aware that our imagination of future events is not *necessarily* true and so why are we so concerned. \n\nThe part that needs to be examined is not on the perceived reality of the thoughts, imagination, or reflection, but on the relationship to what we believe it represents. This touches on what I mean when I've said stuff like \"there are no objects in thought, thought is the object\", like Ditto the pokemon being the reality, and it's shape-shifted forms being representations or imitations of other things. Ditto can be every pokemon, but if you realize *once* that this entity is *always* Ditto and not the representation, then you never get confused again and there is no perception of danger or confusion.\n\nWhen you look at yourself in the mirror, I am saying that your reflection is real, but it is not yourself. This is fairly intuitive. When you think about your future or past, most of us realize \"yeah yeah, my thoughts are sort of real, but it's not *actually* happening\" yet there is emotional reaction. We can try to hammer this relationship out until we're blue in the face, but it will not resolve. \n\nThe actual resolution is in a different relationship: it isn't that you think your reflection in the mirror or in a photo is you, it is in the recognition of yourself in the symbol that you see as yourself. More simply: you know that your reflection isn't *literally* you, but you are not aware that your idea of your appearance isn't you. This means that when you look at a photo, you might say \"fuck I look kinda bad, I better go to the gym and get some new clothes frick\" you can put this off easily and placate yourself on \"not me, not me, yeah I can change my appearance but my appearance is not me!\". But when someone else looks at the photo of you and says \"who the fuck is that loser lmao\". It's like an ice pick through your heart. This person has obliterated the *symbol* of you, which is your photo or reflection, you have identified with that symbol, and now you have been hurt deeply by their expression because you think they are talking about you. \n\nThe root of the misunderstanding is our perception and imagination of time, or more specifically how we view our lives as having duration. The insult this person has hurled at \"you\" is not a problem because it is simply their reaction to the fact. Your own hurt is a result of your self-identity collapsing and wanting to resolve their criticism by becoming \"good\" again in some way according to your beliefs, which is created by the imagination of past and future social identity. \n\nThe root of anxiety, anger towards opinions, shame and regret for our past actions, and longing/ambition for our future is caused by the belief that \"yes, my life is not perfect now, but I can fix it or make it better\" or \"My life was better in the past and I long for that to be made whole again\". The cause of this is the lack of examination of the source of past/future, which is an unreal relationship to present imagination.","timestamp":"2025-03-19T04:48:56.460000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1137147889123074099","username":"anakinslywalker","avatar":"811743dcca2958cab6aa21b1a1675786","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Fillmore","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1346624647738687539","message_id":"1346624647738687539","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]