[{"id":"1322028183767355527","channel_id":"1319049852147204167","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think it's likely that nearly all the \"supernatural\" stuff is just incorrect knowledge and being confused at the cause of a particular event/trick/experience. If it's helpful at all, if you imagine that thousands of years ago there was likely some self-realized people exactly like there is today, but their ideas about how reality actually functioned was completely different. They had no idea about modern medicine or the periodic table or quantum physics or whatever. The reason J.K. says that \"powers\" are not related to self-realization is because first of all they almost definitely don't exist and he's just wrong (lol) but because like the previous example, it just has nothing to do with self-realization. All it is as a phenomenon is the cessation of using a self-concept to operate and think in relation to. If you could somehow levitate that's some cool shit but completely separate haha. \n\nI think it's important to keep in mind that everyone is a product of their time in terms of available knowledge/information. There is nothing about self-realization that causes you to be correct about everything all the time, it only results in being in a state that is indifferent to the content of different thoughts. In relationship to how you assess external knowledge like politics or science, It's more akin to having no emotional bias in your thinking and being able to change your mind right away without attachment, not necessarily being correct.","timestamp":"2024-12-27T02:28:01.106000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"104977073616982016","username":"sephiroth02","avatar":"87547bb46246d0c9733365dd4d3a1f41","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"seppy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319049852147204167","message_id":"1320470917050273854","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":13,"userName":"jamie0773"},{"id":"1319901891290988576","channel_id":"1319049852147204167","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*People could take advantage if they see you react to them communicating you hurt to them with shame so how do you avoid deliberate attempts at that? like people faking it*\n\nWhile it is the case that the cause of shame becomes only the perception that you've accidentally hurt another person according to their communication, it is also the case that your intelligence still operates, and if the other person seems to be deceiving or not actually hurt, then there is no emotional response but perhaps the effort to still right things and be on the same page. I know what you mean and it's a really understanding question, but what you're describing is a little bit more like ego/self-image based guilt, which is imposed by others by them telling you that you haven't lived up to their expectations or have disappointed them. This causes guilt/shame (same emotion) through our ego/self-image by instead of causing us to avoid hurting other people, it causes us to act a certain way to fulfill another person's expectations. A self-realized person experiences shame from hurting another person, but so does everyone. A non-realized person *also* experiences guilt from not living up to the expectations of someone they care about. It's not like there is a new vulnerability that opens up that isn't already there. \n\n*Another question would be what you think about the phenomenon of supernatural powers(levitation and telepathy) associated with this stuff?*\n\nI mean I think it's all nonsense. The only thing that is true is that if you have absolutely no concern for your own self-image in communication with others, then it's very surprising how much is communicated through extremely subtle body language, gestures, silence, cadence, word choice, and things that your natural intelligence picks up on and gives you a sort of \"spidey-sense\" in some situations. You have good \"vibe-check\" abilities ahhahaha. But other than that I think all the supernatural stuff is just quackery or mistaken ideas.","timestamp":"2024-12-21T05:38:53.475000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1319901888295993366","channel_id":"1319049852147204167","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"@pikachu_is_boss Yeah I don't have the same sort of background, but I also enjoyed listening to different speakers and trying to sort of \"triangulate\" everything when I was looking into this stuff. Definitely recommend that approach. \n\nJust for context to answer \"How have you verified SR to not be some really deep self deception?\" because to be very frank, so many speakers on the subject are cranks or just straight up confused themselves. The biggest culprit is always accidentally doing some form of self-improvement, experiencing relief or a better emotional state, and then inferring that because you so rarely experience xyz bad thing that you are now enlightened or reached some pinnacle. This is all nonsense and is a form of belief modification over time. I would stand by the idea that the best verification would be brain-imaging and hope I can do it in the future. The expected result would be absolutely no activity at all in a certain small part of the brain that is typically active when emotionally hurt when dreaming, ruminating or thinking about ourselves. \n\nThe reason I'm so passionate about the whole thing is because what I'm describing is a mild but instantaneous physiological brain phenomenon. The analogy I've used is that the subjective part that you directly perceive is as \"oh fuck, I don't ever need to think about myself, I am myself!\" but the physical component is analogous to your brain seeing that it has already downloaded the files from an SD card onto the hard drive, and then deletes the content of the SD card. This happens instantly, it isn't gradual or accumulated. You don't \"get into that state\" or \"work up to it\" it just clicks into place in one go permanently. Because this often scares people despite not being scary, it is subjectively a very similar experience to alt-tabbing from a video game and being like \"oh shit, I accidentally launched the client twice\" you then automatically close one client and the initial client now runs perfectly. Only one emotion is experienced at a time, and only when necessary, and each is as clear as the indicator lights on your dashboard. Everyone is very confused constantly about their emotions, but they can be as crystal clear as \"I burned myself on this pan because it is hot. That experience was called pain. I will not do that again\".\n\nThere is no emotional relationship to dreams, and all dreams are pleasant/enjoyable or the continuation of problem solving from the prior day. There is no conscious experience moment to moment that isn't completely clear, and the memory of how you used to think in a flawed way is also still there. Don't want to be too overwhelming with information, but take social anxiety. I used to have it my whole life chronically, and after researching it for literally 10-15 years to try to resolve it in myself I had accumulated a million different beliefs about what it was. What I'm trying to communicate caused it to instantaneously end and resulted in being immediately aware that social anxiety is just the subjective belief of the individual that there is danger in socialization. The level of anxiety you feel will be in exact accordance to how threatening you perceive a danger to your imagined self to be. There is nothing else to it at all, but my past self could have written a 1000 page book on possible explanations and remedies.","timestamp":"2024-12-21T05:38:52.761000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"104977073616982016","username":"sephiroth02","avatar":"87547bb46246d0c9733365dd4d3a1f41","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"seppy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319049852147204167","message_id":"1319049852147204167","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]