[{"id":"1256466652044988459","channel_id":"1254926773766983750","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I don't think I've said I have \"conscious control\" over my thoughts unless I meant is as a comparison to previously feeling like I was constantly bombarded with anxious thoughts that weren't intentional and those went away.\nWhat I think I've said or at least meant is that thinking is much more intentional like moving your hands, but the deeper experience is a realization that both thinking and moving your hand is \"automatic\". What you are *is* the experience of the thought, not the object producing the thought. \n\nThe difference is that yeah, just like before when you are thinking about how to solve a math problem it \"feels like I'm doing it\" and when you suddenly remember you forgot someone's birthday it feels that thought happened to you unintentionally. Or like how moving your hand on the mouse is intentional, while moving it away from a hot pan is unintentional. That is all the same and not very important. Those things are seen as the same as \"hot things feel hot, cold things feel cold\" it's just how the sense works. \n\nTo sort of directly answer your question, the phenomenon of being in a flow state and feeling like you lost track of time or skipped ahead still happens. It's just perceived as a particular way of perceiving things that happens with concentration, the part that's very different is when you describe \"is that because I believe I am a part of thought, when I no longer think of me, I believe I no longer exist??\" because that is sort of accurate. I think it might be more instructive to think \"When I no longer think of my imaginary friend, it seems like my imaginary friend no longer exists. Is this because I believe my imaginary friend is part of thought?\" \n\nYou don't believe that your imaginary friend is part of thought, your imaginary friend is thought and doesn't exist as a real object separate from that.","timestamp":"2024-06-29T04:29:53.869000+00:00","edited_timestamp":"2024-06-29T04:30:23.002000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"}]