[{"id":"1310461881231872011","channel_id":"1307538022530678804","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not at all incompatible with quantum mechanics from my little understanding, if anything it makes it make way more sense. It's fundamentally the implication that there is a constrained but probabilistic next \"instant\" of interaction that creates the next moment of reality.  This is not related to self-realization, but just anecdotally, if you were to say that life isn't hard-determined linearly, as in every moment is a pre-planned algorithm, but a series of probabilistic interactions that lead to various different possible outcomes that seems extremely to our subjecive experience and objective observations of other life forms.","timestamp":"2024-11-25T04:27:39.690000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1288323959791812650","username":"blehbleh345","avatar":"15048c5b4ee6eb3d108361b29d3309a2","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"the_doctor","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1098454165602185228","identity_enabled":true,"tag":"RTRD","badge":"d23803b07b8e176d61bffaed2a8ec42e"},"primary_guild":{"identity_guild_id":"1098454165602185228","identity_enabled":true,"tag":"RTRD","badge":"d23803b07b8e176d61bffaed2a8ec42e"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1307538022530678804","message_id":"1308043108377821194","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":19,"userName":"jamie0773"},{"id":"1307792449308987454","channel_id":"1307538022530678804","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*Does SR completely dissolve any attachment to the ego, or can a person who has achieved SR still want to win arbitrary games for the sake of winning, and be disappointed when losing? Like, could a person who has achieved SR be disappointed in themselves after losing just because they lost? Or could they be proud of their accomplishments?*\n\nEgo in the way you're referring to it is just a small part of the ego/self-image/self-knowledge that is identity, but yes what you are describing doesn't occur emotionally. Games are still fun because they are stimulating and require novel problem solving, in that they are something to play with. After SR there is no emotional relationship to winning or losing, but you can still enjoy improving or playing a game. A similar examples is vanity, in that bragging, downplaying yourself, or shooting it down the middle are all forms of vanity if you are trying to create an impression and receive validation. Vanity isn't in the behaviour it's in the psychological state of the actor trying to control an outcome or identity. \n\n*Would a person who has achieved SR also be less likely to follow social norms just for the sake of it, but still follow social norms in cases where it appears to serve some function (like not pissing people off)?*\n\nYes this is exactly correct. As a sidenote, the reason in Zen they advocate for a life of not harming anyone is because the only negative emotion that still occurs after self-realization that is dependent on other people's ego is shame/guilt. It isn't possible for someone else to hurt your feelings, but it is possible to accidentally hurt someone else's feelings with something you say, and even though it is just their own ego getting hurt, when they communicate that to you it will cause you to feel shame. The only thing that can negatively alter your own mood is someone communicating that you have genuinely hurt them and so you avoid that.","timestamp":"2024-11-17T19:40:17.524000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1307792446490673334","channel_id":"1307538022530678804","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It instantly flips like a switch, yes. It isn't the cessation of a habit though, it's an actual psycho-physiological structure that stops operating. Self-realization does not exist on a spectrum, but neuroticism does. Self-realization is essentially \"perfect mental health\" not a superlative higher state. So for example that means absolutely no anxiety at all. Not in crowds, not in communication, and not in dreams. Doesn't occur at all. In practice, not experiencing any anxiety at all is exactly the same as \"not experiencing anxiety right now\". If two people are completely content, there is no difference between them, but a person with their self-image present will experience near constant interruptions to this state.\n\n*It seems much more intuitive to expect that this person would first conceptually understand what SR is, and then work towards learning to let go before finally being able to accept the \"truth\" of SR which is tantamount to achieving it*\n\nIt would appear this way because knowledge works this way, but it is not the case for this. It is however true that for most people it initially appears as a gradual accumulation of knowledge and experience, and then there are breakthroughs or insights. It is however not accumulated or refined like often taught in recreational meditation or Religion. It isn't mental bodybuilding or a skill, but a subtraction. It is fundamentally the complete cessation of all beliefs, beliefs in this case not being just \"opinions\", but emotional attachment to thought. This can occur to people in stages only so far as they might have a particular cluster of beliefs about a certain thing that they drop, like being fearful of going to Hell, then realizing \"oh, doesn't exist\" and that particular cluster vanishes, but the fundamental belief undergirding all beliefs is the beliefs about \"Me\" that is the one subjected to all experience. The cessation of those beliefs is what is called self-realization. \n\n\nTruth like you mentioned is not something you accept, as it's not knowledge. \"Truth\" refers to the actual state of things as they are, not the correct modelling of something in knowledge. When you hear someone say \"truth is seeing things exactly as they are\", that is misinterpreted by our self-image to mean \"always knowing what is correct\", when it it actually refers to seeing all phenomenon of the mind, including thought, to be exactly as it is without content. There isn't good or bad, right or wrong, truth or lie, everything just is exactly as it is.\n\nThe realization is not intellectual because it is analogous to untying a knot made of ideas. You are taking something intellectual (the beliefs you have about yourself) and undoing them. It is not necessary for this process to be intellectual, but usually it is to at least some degree because the mistake is intellectual in the first place. \n\n*Does SR imply that there is no \"true\" identity of a person, or that we simply don't have access to it. If there is no \"true\" identity of a person that seems to very conclusive prove that free will must purely be an illusion tied to the self-image. *\n\nThere is a true identity. You exist obviously and call that \"Me\". The only error is believing your identity is in thought. Free will is only non-sensical because classically people mean \"freedom to choose\" which doesn't exist because there is only ever one thing happening, and so you can't choose between two possible futures. It is more accurate to say that what we call agency or free will is the capacity to create the next instant.","timestamp":"2024-11-17T19:40:16.852000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"710160487886880870","username":"aspectofthenerd","avatar":"b11414cef3de8a52da6aac604c6924a7","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"ENDER","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1307538022530678804","message_id":"1307538022530678804","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]