[{"id":"1346054358575484959","channel_id":"1331095889095294986","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"This is very subjective and I don't put any weight into this, but my personal viewpoint currently is that physical reality can be explained by the laws of physics and is simply a rules based phenomena. Why it exists I don't know, and why I am conscious of this human being and not another human being is also currently unanswerable. Any sort of \"what if?\" that is not directly something that can be tested or ruled out I don't have much of an opinion on","timestamp":"2025-03-03T09:39:27.565000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1331095889095294986","message_id":"1339071636363673665","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1334834153820131378","channel_id":"1331095889095294986","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's a really good question. The latter part of what your asking is like the philosophical \"Ship of Theseus\" question, which is asking if there is a ship that goes on a voyage, and is repeatedly damaged by the sea and storm and each piece must be replaced, by the time it reaches back to port not a single plank of wood remains of the original, is it still the Ship of Theseus?\n\nI personally think this is a pretty dumb question because it's just a test of continuous consciousness/identity in relationship to our physical body. It is really asking the question \"what part of our physical body is \"Me\", and it that's not where the answer is. We can get clever about it but even though you are probably 99% different from when you were 3 years old, you are nevertheless the ongoing conscious experience of the same entity you always have been, regardless of physical form. \n\nI think this leads to the more interesting question that you mentioned initially, which relates to your physical body completely disappearing and being re-materialized somewhere else. Would you still be the consciousness inside?\n\nI don't have an answer for you, but a similar thought experiment is related to us talking to each other. Imagine I were to wake up tomorrow as you, and you were to wake up as me. Our intuition is we will be like \"oh wow, this is crazy, why am I in your body???\" But this isn't how it would work. Obviously I would literally be your consciousness and memory, and so someone would say \"hey Jamie, how does it feel to be mr.niceguy?\" and I would be like \"what do you mean I've always been mr.niceguy?\" because I would be operating your memories. \n\nIt relates directly to our own experience of having dreams, where we experience a fantastical world with nothing relating to our actual day to day lives, but while it happens we're like \"oh fuck this is super real gotta react\". \n\nThe basis of this regarding self-realization is not \"ah fuck what is the 'really real'\" thing, but to recognize that what is actually real about us is the present experience we are aware of, not the body or physical surroundings we experience.","timestamp":"2025-01-31T10:34:22.290000+00:00","edited_timestamp":"2025-01-31T10:37:43.185000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"703251615674662916","username":"mr.niceguy312","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"mr.niceguy","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1331095889095294986","message_id":"1331095889095294986","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]