[{"id":"1256455941155455040","channel_id":"1253061658696220843","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Sort of, in that \"intentional\" action of thought becomes much more dominant, or rather unintentional thought is much more infrequent and exists for obvious purpose. The role of thought without ego feels more like moving your hand in the same way you are describing, but you also still have thoughts that pop into your head related to unresolved physical tasks that are automatic and essentially reminders. If your self-image is active this will happen nearly constantly and often interrupt you while you are trying to intentionally think about something else.\n\nJ.K. talks about this a bit regarding dreams and a state of no thought, in that when your self-image is active, it is basically impossible to not constantly have intrusive thoughts or feelings because your brain believes your imagination contains real objects, and so there are literally infinite threats or problems to resolve. In contrast, if there is no emotional relationship to past or future or self-imagination, then what you think about pertains exactly to what you as a biological organism want to express right now in physical relationship to your environment. \n\nThis means that in times when your life is in physical disorder/chaos then thoughts will automatically pop into your head reminding you to do things and in times when there is much more physical order there are no almost thoughts at all.","timestamp":"2024-06-29T03:47:20.194000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253061658696220843","message_id":"1254479519583174807","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1253885638483247128","channel_id":"1253061658696220843","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's important not to avoid negative emotions, but you will notice for example, regardless of your beliefs, that if you sit with any negative emotion and try to resolve it, you will eventually come up with some means of rejiggering your beliefs and new method of behaviour that will somehow \"fix\" your situation. It is very important to watch this and see that is a fact. If you are sad, and focus solely on the sadness, you will automatically resolve it and come up with some new made up idea of how to make up for your mistakes and redeem yourself. You will believe this is an effective solution and feel better. I am not suggesting that if you were self-realized or had more information this will be different, I am saying part of self-realization \"oh, I didn't solve my problems, they solved themselves automatically, like a physical wound automatically heals\"\n\nI want to drill in the sort of \"you are a plant\" analogy by giving a few tidbits to focus on the next time it happens. Just pay attention the next time you are anxious, sad, angry, or any emotion, and pretend to yourself \"this emotion is a moving, living expression, and I will watch how it grows and changes. If you take it sincerely, you will notice sadness always grows into motivation and love, ego based anger always grows into shame and regret, which again results in motivation and change in perspective. Anxiety always grows into 'overcoming'. Many of these things don't need to exist, but until then a good observation is to see exactly what they are and how they work.","timestamp":"2024-06-22T01:33:52.283000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253061658696220843","message_id":"1253156259302080522","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1253082583642935378","channel_id":"1253061658696220843","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, thanks for clarifying!\n\nTo be honest I had largely assumed that all emotions were just a fact of human biology and there was nothing you could really do about them other than \"overcoming\" them through self-improvement and proving to your brain that there wasn't as much danger in something as it thought or the like. \n\nThrough listening to guys like J.K. begin to describe different emotions and desire, etc. it gradually brought me around to sort of understand \"oh, there is something a lot deeper to this I can't quite put my finger on\" that eventually led to the realization. \n\nFor me it was basically just an \"all at once\" phenomenon where all my neurotic emotions and thoughts simultaneously ended. Literally just a realization with a neurological \"pop\" and they were gone. It was from that place you gradually accumulate a knowledge of how your emotions work in contrast to how they did before because that part of you is essentially gone. It is nearly impossible to understand why you experience certain emotions when your self-image is active because you experience more than one at a time causing complex feelings like jealousy, envy, regret, or revenge. It is nearly impossible to realize that when you experience purple it is actually just red and blue because you can't see it. If blue ends, you experience red, and you remember purple, then the whole puzzle can instantly be solved very easily. I still encourage self-inquiry though because you can begin to understand that something is off and try to figure out why, which is what gets people to put the effort into understanding themselves. \n\nAt a bit of a deeper level by the far the most mysterious emotion is love, because other than a few brief glimpses I don't think nearly anyone has experienced it before, and I know I hadn't. I don't think it would have been possible to experience love for me in the past because there was always a belief operating looking for the \"right\" partner and that is a very conditional belief to be filled. Most people experience attachment with occasional bouts of love when things are just right, but that isn't it. If you say \"I love you\" and really mean \"I would be very hurt if you were gone\" it isn't love. It is mysterious now because you realize it is the only positive emotion and fundamentally the only force guiding all your own and all human action, so the question is more of a \"what exactly does that imply about our existence/life in general?\"","timestamp":"2024-06-19T20:22:49.089000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]