[{"id":"1293120756187922442","channel_id":"1292595403857989652","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"How you physically feel is not really relevant for self-inquiry. It can be something to observe or pay attention to if it happens. For example, if you sit by yourself for an hour or two and start questioning your own beliefs or attitudes, and as a result you feel a bit sick or anxious, then that itself is an observation worth noting or examining, but there isn't any \"symptoms of becoming omega woke\" or anything like that. \n\nI don't really know why I didn't mention the sort of finance related stuff before, just didn't really come up appropriately I guess. I'll share more info about myself/that experience in the future if appropriate it just hasn't really been apt so far","timestamp":"2024-10-08T08:00:13.297000+00:00","edited_timestamp":"2024-10-08T08:03:31.906000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292595403857989652","message_id":"1292839442163171368","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1293119924490735669","channel_id":"1292595403857989652","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah I'm learning to communicate this as I go as well so appreciate the feedback. Hopefully I can do a better job in the future absolutely. I'll say it one more time because as much as I like most other speakers, it's a huge motivation for me that no one has ever seemed to say that self-realization is the physiological cessation of using an imagined self-identity  to guide action and respond to emotionally. \n\nRegarding Adyashanti, I will say that I do recommend his content, but I also don't really relate to him much at all. He describes self-realization in way that doesn't really vibe with me that much according to his personal/physical experiences, but a lot of what he is saying I'd be like \"yeah checks out I think\". This is nothing special, but most \"self-realization\" speakers are very spiritual, and I don't really relate to that. There is genuinely a lot of what many of them say I personally kind of \"check-out\" and don't really relate to or would vouch for. This isn't related to the self-realization part, but towards their own lifestyle or personal preferences they might have mistaken for their own \"enlightenment\". As a result I don't really know why but they have sort of \"residual attitudes\" that I would personally say \"yeah I get what they're saying but it's not actually real\". Even though they might think it is very important.","timestamp":"2024-10-08T07:56:55.005000+00:00","edited_timestamp":"2024-10-08T08:05:38.813000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292595403857989652","message_id":"1292839380737720340","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1292775440204824617","channel_id":"1292595403857989652","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"_\n*How would you describe this/how did it happen? Did you know anything about it beforehand, when did it happen in relation to actual self-realisation etc?*\n\nThe mini experience I had was related to the resolution of some long-held beliefs about how I was meant to act. It resulted in an immense feeling of relief and a flood-gate effect of emotional love for a couple of days. At the time I thought this was a \"satori\" experience that I heard of before very loosely and it got me more interested in Eastern stuff because that insight itself actually came from studying philosophy and \"How to live\" doctrine/ideas. From there I thought \"done with this, but I have neglected ever looking at Eastern stuff because I thought it was rubbish. Maybe there's something there\". To be clear, 95% is rubbish, like Religion, like meditation, but the little bit that's really genuine is just that - actually real. The (satori) realization actually came from the insight of \"none of these philosophers have any clue about how to live, they are just saying what rationalizes their own life experience. I can do whatever I want. It's like a video game\". That is the particular thought I woke up with that caused that mini experience. This really instigated my research  into self-realization even though I had no idea what it was at the time. I really just started listening to \"Eastern speakers\" who I thought were intelligent. \n\n*Do you think you would have been interested in JK and other teachers and/or understood that there was something to what they're saying without that experience?*\n\nWhile the \"satori\" experience I mentioned made me think \"holy shit what if this can be permanent???\" (question doesn't make sense to me now, but at the time it was very important) I did become interested in guys like George Gurdjieff and J.K slightly beforehand. I haven't really mentioned this before but the reason I originally went so into philosophical speakers and then this was because I made a lot of money trading, and then lost that money, and my ego was still locked into \"I have that higher amount of money and need to make it back\". Without elaborating too much, I rationally thought \"I might never make that money back in my life why do I have emotional attachment to that identity?\" and that was the wedge that allowed me to very clearly see \"I am this, but I think I am this. What the fuck?\" From that place I tried to resolve that misalignment and it finally resolved here.","timestamp":"2024-10-07T09:08:03.551000+00:00","edited_timestamp":"2024-10-07T09:12:01.314000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1292775434009968670","channel_id":"1292595403857989652","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Appreciate all the questions. \n\n*I'm curious because several people mention that there's an awakening, and then self-realisation which is something like a permanent version of it.*\n\nSelf-realization is distinctly a singular thing with no \"getting closer to it\". It isn't like how you get closer to a PhD or life goal. It is true though that there is in the context of self-realization a runway where basically everyone who arrives there makes a distinct effort towards some sort of understanding of themselves. It is extremely rare to literally have no concept of self-realization and then accidentally arrive there because it is analogous to no longer believing in a Religion or believing in Santa Claus, which usually necessitates an idea of \"hold on, why do I believe in this in the first place?\". While this isn't really the angle I came at it from, historically the way that \"mystics\" emerged was just people who looked at reality the same way everyone wakes up from a dream and says \"lol oops not real lmao\", they just didn't lose that sense of \"but... What is this then??\" The ultimate resolution of a mystic isn't \"yo it's all a dream bro, it's all an illusion\" which is kind of the modern *hits blunt nihilism* but self-realization is more like \"ah, phew. Nothing to worry about\", which is really what the realization about a dream is once you wake up from it. \n\nThe notion of a \"runway\" is different from gradual \"experiences along the way\", as those things are really valuable and insightful, but not actually incrementable or related. It might genuinely seem like it is relevant at the time, as I had some remarkable changes in beliefs/experiences beforehand that were seemingly profound, but in hindsight actually meaningless. It's a bit like being a really stiff materialist and matter of fact kind of \"reality is just the result of a mathematical infinity of physical probabilities\" and then you take 5 grams of mushrooms, see some shit, and think \"yo, it ain't math bro. It's what the math represents dude. It's God, and like, I am God??\" . While you might have felt you have had a huge insight and shift in understanding, it's really just one belief being replaced by another one, and the seemingly profound emotional experience that goes with it is secondary and can only be understood later. \"Awakening\" if in reference to any incremental experience towards self-realization is relevant because it usually happens to someone seeking the resolution, so maybe they are on the path, but it is not actually the thing.","timestamp":"2024-10-07T09:08:02.074000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"172965915237810176","username":"ahighlyinconspicuouscookie","avatar":"7fe6f667f3382306de5d24a365821c58","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"A Highly Inconspicuous Cookie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1292595403857989652","message_id":"1292595403857989652","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]