[{"id":"1281349705980444683","channel_id":"1277300006054924321","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yes, for me personally it resolved itself while I was \"thinking about myself\" so to speak. \n\nI accidentally wrote a response to your initial question again because I forgot I already replied (my bad) but thought I'd add it in for others and maybe it will help clarify for you as well:\n\nThey are really just different methods to approach the same realization. The \"Western\" style you are describing is essentially undoing the knot of beliefs you have about yourself by directly looking at the beliefs, as they are all thought and can be undone with thought. The \"Eastern\" style is more about directly realizing what the direct sensory experience of \"Me\" is without the interference of thought-based identity interfering. \n\nThe \"A-ha\" moment the more intellectual approach is usually a thought like \"Oh, I am not what I thought I was, I am always me, in the present, all the time. Ten years ago I was me, now. Today I am me, now, and in ten years I will be me, now\". Which was roughly the thought that triggered it for me. In the more traditional meditative approach, if there is an absence of thought, but still an awareness of experience it can trigger a sort of \"oh yeah, this is me as I am, I forgot\" type of realization. They are both ultimately the same realization and cause the same physiological change in function/perception, but are different approaches. What occurs is the cessation of emotional relationship to a self-concept in thought (self-image). \n\nIn my opinion they are both valuable to look at and well help you encircle what exactly is meant to be examined in the first place. The only pitfalls are that the western style often leads people to believe there is no phenomena, and it's just a life philosophy to think about and conform to, and the common pitfall of the more eastern style is the belief that meditation/enlightenment is just being able to constantly concentrate on present experience and getting really good at ignoring emotions or negative thought. It is a realization that causes automatic, effortless, permanent change and isn't something that requires concentration or thought to maintain.","timestamp":"2024-09-05T20:26:16.232000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"104988085170741248","username":"crthha","avatar":"a9565919737a11de3b13a4db01165cc5","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Craig","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1277300006054924321","message_id":"1277650945005588622","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"},{"id":"1277545644592074752","channel_id":"1277300006054924321","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If it is helpful, what I am wanting to communicate is that there is an insight an individual can have that causes all emotional relationship to self-imagination and dreams to end. You instantaneously and permanently experience a state of perfect mental health. That has been my experience and what I want others to have as well. \n\nTo respond to the pieces you are mentioning, there is no Western style \"practice\" that will result in improved mental health like mental bodybuilding or \"sustained improvement\". That is imaginary. There is also no academic \"the self is an illusion\" or stoic \"act according to nature\". There is something much deeper along those lines, but it is \"there is no imagined self\" or \"You are nature, you are always acting according to it\". \n\nThe people you have mentioned like J.K. or Ramana are speaking on the same thing, but the only point is to realize the \"self\" which is to simply erase all other beliefs we operate on and understand what we refer to when we say \"Me\".","timestamp":"2024-08-26T08:30:17.321000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"104988085170741248","username":"crthha","avatar":"a9565919737a11de3b13a4db01165cc5","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Craig","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1277300006054924321","message_id":"1277300006054924321","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"}]