[{"id":"1256451657303330906","channel_id":"1253228249945870337","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not really what people are looking for in their livess *per se*, and usually when I talk to people about it their eyes glaze over lol, in that I'm not really communicating \"How to make money\" it's more like \"this is the system you are operating in and its inherent characteristics and limitations. This is why it's become so hard to acquire prosperity and what could actually be done to change that intelligently\"\n\nI think the knock on effects are obviously that people have more resources, but I would sort of describe it as \"all we talk about culturally is equality of opportunity/outcomes, we're making mountains of molehills, let's start asking why there are no good opportunities in the first place\". The problem is that it's not really something that individuals can use to improve their own lives directly, unless they trade/invest or it helps them realize no one is coming to save them except themselves lol, but it's more like \"there needs to be education around this so people vote for reforms that actually help their lives instead of continue to hurt themselves\" kind of like you said. I think the pathway for that though actually isn't long term education specifically, because the monetary/financial system changes faster than textbooks can be written about it and most people don't really find it interesting, but more like in educating politicians that would then be able to pitch more radical reforms to their constituents that would actually cause significant change, rather than sort of shuffling the chips around.\n\nJust as a small example, mechanically something like a wealth tax in my view is really dumb, and something like a higher corporate tax is also fairly meaningless, but both are politically popular as they're perceived as \"making the rich pay their fair share\", but something that would actually accomplish what people \"feel\" should happen is massively raising property tax while significantly cutting income tax. Not saying it is \"the solution\" but it could very quickly be explained to people as \"this is a better way to vote for what you want\" rather than what we get currently.\n\nAnd yeah re: talk therapy type thing I've considered doing some streams on Jamie's channel on this topic. I've done a little bit of streaming again (gaming and stuff) on twitch and wouldn't mind trying to do that full time in the future while having one day where I take a break and talk about this on that separate channel.","timestamp":"2024-06-29T03:30:18.844000+00:00","edited_timestamp":"2024-06-29T03:30:41.404000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1253878131027218492","channel_id":"1253228249945870337","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Haha, if what I wanted to communicate directly resulted in having more money then I'd be doing it a lot earlier lol. \n\nI don't think I'm exactly qualified to do a lecture exactly, although there are some things I thing I could definitely talk about. The irony around this stuff is if you spend enough time around the 'experts' you will very quickly realize that many world renowned 60+ year old experts have absolutely no idea what they are talking about on very basic ideas, largely because it's so political and belief driven, and really almost no one cares about actually understanding anything. On topic, but niche, but there are many PhD economists who frequently do the rounds on mainstream media talking about \"Money supply\" and that is like talking about the Niel's Bohr model of the atom. It was taught to everyone in highschool, but it isn't how atoms actually work. It was how everyone thought it actually worked 80 years ago, but now it's like \" 'I' before 'E' except after 'C'!\" and is just a stepping stone to the actual understanding, yet people are still talking about it because it's their book. \n\nWith that said, the stuff that I'm most interested in are related to US fiscal and monetary policy along with basic financial literacy, and while I feel confident communicating those things, it's more from a place of \"these are literally the only things that matter in our political economy and what explains the degredation in standard of living and potential remedies\". Rather than \"here is a lecture series on how money and finance works\". Still thinking about how it might be appropriate to talk about these things and will probably have to do more research in order to make something more cohesive. It is, at the end of the day, an opinion and not something that is necessarily correct.","timestamp":"2024-06-22T01:04:02.366000+00:00","edited_timestamp":"2024-06-22T01:05:28.166000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"135547866050461696","username":"dyad_","avatar":"2a6933cac94b8b46e67d98dfa8f33c04","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"dyad","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253228249945870337","message_id":"1253228249945870337","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]