[{"id":"1328991807547117639","channel_id":"1324330692892688434","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Not exactly, in that the hologram example is just to illustrate that the hologram doesn't have default form. It exists as a visual display, but it must take the shape of some sort of input. If it has no input it has no output, and thought is the same. You can't think of thought because thought must be about something else. \n\nSimilarly, \"Me\" we think refers to something completely viscerally real. If someone says \"I think *you* are a terrible person\" we think \"that was a scathing attack on *Me*\", but what actually is affected? Where is the evidence of a wound or hurt? It only exists in how someone's words have affected our thoughts about ourself, there is no physical injury. What occurs is a transformation in the hologram in our own mind that we use to model ourself. We then have to look at what that model is even modelling and if it exists in the first place at all. \n\n*And what you're saying is that as we are the sum of our sensory perceptions if we remove everything, well, nothing will be there.*\n*Just like when sleeping or being in a coma?*\n\nThis is two separate things. We are not the sum of our sensory perceptions because that is just an imagined list of things that are collected. You are only the awareness of whatever you are perceiving right at this exact moment. This automatically includes everything, but because we haven't examined why or how it does that we extend our identity to our imagination of the past, the imagination of our future, and the imagination of all the sensory perceptions we think we are and call that \"consciousness\", then say \"I am that\" which is just an identification with a thought or idea. \n\nWhat I am saying is that the examination of our sensory perception that relates to our consciousness is a way of disentangling and beginning to understand how our fundamental nature/identity is not linked to these ideas or thoughts we have about our self. It is obvious that when we are in deep sleep or dead that \"Me\" doesn't exist. So if \"Me\" doesn't exist in those cases, what actually *is* \"Me\" when we are awake? The answer can't be \"the sum of my sensory experience\" because then when you are in deep sleep or a coma you would say \"I am nothing\" which you obviously aren't because you weren't there. In the same way when you have a dream you think \"oh man, I really am skiing down Mt. Everest this is crazy\" then when you wake up we say \"nope wasn't me lol oops\", but it was you, you just now changed your mind. \"Me\" is present at all times in your life no matter what happens, it's just a matter of correctly addressing what it is.","timestamp":"2025-01-15T07:38:58.393000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"776884386372255755","username":"q__c_","avatar":"9da34bdb46f23c4e74ef91e6b87fde84","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Q-C","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1324330692892688434","message_id":"1328290966355968042","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"},{"id":"1328227969361248286","channel_id":"1324330692892688434","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Straightforwardly, thought has no shape in and of itself, it only takes the form of memories you have, which are previous sensory experience.\n\n\"I\" also has no stand-alone form, it is only the sensory perception that fills subjective awareness. While it is real, it is like the number 0, in that we view 0 as another number just like 1 or 2 or 3, but you can look for your whole life and never find \"0\", because it only exists in the abstract. There is no \"0\" because it represents nothing. \"Me\" does not exist as a discrete, individual object. \n\nI hate doing this because it's not how it works, but I'll do it anyway for illustrative purposes: at a very object-oriented level, the idea of \"I\" or \"Me\" refers to the body, mind, beliefs, and relationships to those things, we call this in thought \"My life\". This is what most people think and experience and that's all good, it's not a problem by itself. At a \"spiritual\" or \"religious\" level you have people identifying with the soul, consciousness, or point consciousness, which is like \"the source from which everything emanates\". This is usually where people get stuck on their inquiry because they still think this is a real object like the number 0 and get really into solipsism/nihilism or a lot of mushrooms. They view \"Me\" as an object called \"consciousness\" that is like the intersection on an X/Y graph that meets at 0:0. There is no intersection because the graph doesn't exist, 0 doesn't exist, and there is no discrete object with no value. There is no \"Me\" without external perception. This is the meaning of J.K.'s \"the observer is the observed\", there is no \"receiver\" and there is no \"received\" there is only the singular signal generated by their interaction, which is the sole real thing or \"Me\". \n\nMetaphorically, there is no magnifying glass, there is no object, there is only the examination itself that solely exists and is \"Me\".","timestamp":"2025-01-13T05:03:45.178000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"776884386372255755","username":"q__c_","avatar":"9da34bdb46f23c4e74ef91e6b87fde84","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Q-C","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1324330692892688434","message_id":"1324330692892688434","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"}]