[{"id":"1287518976234229791","channel_id":"1283991490648870934","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"self-enquiry is essentially the examination of what \"I\" refers to when you use it, but the problem is the instinct of nearly everyone is to intellectualize it and try to philosophize or look for \"the right answer\" to agree with, which isn't the right direction. The mention of \"stepping back\" is meant to try to help people understand that unlike analysis where you \"zoom in\" on the details, you instead are trying to \"zoom out\" and see the entirety of what you are analyzing or experiencing in the first place. We don't normally ever do this because we just assume that absolute base line sensory experience is just \"how it is\" and never question it. As a small example, people spend their entire lives studying psychology to try to understand how anxiety works and how to reduce it objectively. Anxiety can actually completely end if you understand what it actually is as a subjective phenomenon (the belief there is danger in an imagined event that may occur to you) but cannot be resolved through objective means. Because we just assume that anxiety is inevitable and irrational we try to find means to objectively overcome it, when the answer is actually in \"zooming-out\" and realizing what it is as a subjective phenomenon. \n\nThere's nothing you're doing wrong at all, the holding of the \"I\" thought is just meant as a guide to your inquiry like saying \"you're trying to arrive home\". When you are at the store and ask yourself \"am I home?\" the answer will intuitively be \"no, this is the store\".  When you are at your friends house you will think \"well, this feels more like home than the store, but still isn't quite it\". It's just a tool to give you something to aim at as you explore and try to figure out what is being communicated.","timestamp":"2024-09-22T21:00:44.880000+00:00","edited_timestamp":"2024-09-22T21:01:13.986000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1283991490648870934","message_id":"1283991490648870934","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":38,"userName":"jamie0773"}]