[{"id":"1319909034832302080","channel_id":"1319809805266718760","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"This is a very simple generalization, but if you want to do something or experience something it is because it is a preference, but if you are trying to avoid something or not experience something it is self-image based. It is a good entry level self-enquiry exercise to look at something you want and start breaking it apart this way. In this case I'm referring to things like relationships, travel, jobs, etc., not like cavediving/food/water/etc.\n\n Usually people experience some degree of both avoidance and attraction for each, and while that is a point of self-enquiry, they are not in conflict with each other they are two discrete things. If you want to travel to Europe on a gap year to meet new people and reinvent yourself, that is a preference and a natural want. If you are concerned that you will fall behind in your schoolwork and when you come back your friends will have left you behind, that is neurotic and self-image. It doesn't mean it might not be true, but it is neurotic and an emotional relationship to your imagination. \n\nRelated to SR, in my experience it becomes obvious which is each because there is no longer ever a concrete external objective that is desired, or to use the usual \"objects in thought\". There is no feeling of lack of not having a relationship - but to your point - instead of thinking \"I want to have xyz relationship\" or \"I want lots of hunnies to like me\", instead there is awareness of \"It is a good feeling when girls express attraction towards me\" and then there can be contextual application of that sense. It's similar to saying \"My ears like hearing beautiful sounds, so how can I hear more beautiful sounds?\" or \"My eyes like seeing beautiful things, so how do I see more beautiful things?\". It isn't object oriented and so you don't do stupid things like \"damn, if I sleep with her and she's out of my league, then when I tell my bro's and post a pic with her on instagram everyone will think I'm super cool\". You literally only think \"do I like this person and want to communicate/play/escalate things with them\" and there is no objective in mind. There are some people and some circumstances where different types of relationships make sense and others where it doesn't. There is no rule on how relationships or friendships should be.","timestamp":"2024-12-21T06:07:16.628000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1319809805266718760","message_id":"1319809805266718760","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]