[{"id":"1272410297331744850","channel_id":"1260007769906610257","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not that you don't have the memory of navigating certain areas or a sense of \"oh yeah been here before\" or \"draw a map of your hometown\". The information can be stored just like the data on a screen can be captured and recorded and put back on the hard drive. The more necessary point to realize is that information is only ever experienced in one way. To use your analogy, the screen doesn't explicitly display \"one frame at a time\", it displays whatever the current signal is pushing into its hardware. The monitor doesn't experienced \"frames\" it experiences a constant signal and modulates the intensity and brightness of the pixels on the screen. In the same way, you don't ever experience more than one thing at a time, or the frame of \"Now\" and there is no \"previous or next frame\". It's like if I were to ask you to count to 100, you might ponder whether or not the knowledge of every number 1-100 is stored in your brain, or if a special program is running that only knows one number at a time but then knows how to add one to it. This is intellectually something you can speculate on, philosophize about, or otherwise try to scan someone's brain and \"find out\" if all the numbers are stored there. This is not of relevance to the inquiry we're talking about which is realizing that, subjectively, you only ever experience the thought of one number at a time and nothing else. The thought of \"one\" is not the first thought of hundred thoughts queued up, the thought of \"one\" morphs itself into the thought of \"two\".\n\nThe reason this is important to see and look into is because there can be the realization that you don't ever need to create a model of your own knowledge, of yourself, or of your life, because you yourself are all of your memory, life experience, and understanding of the world right now. All you have to do is *think* and you are experiencing what is the currently the most up to date understanding of your existence that your brain is currently capable of producing. Subjectively, this results in a change of perception from \"oh my god my life is such a mess, I have all these problems, and I need to think about them and solve them, and figure out what this person thinks and what if I screwed this up\" which results in a state of near constant thought and stress about ones own life in order to try to model what your life is, to a state of relative mental silence because you realize that you are experiencing the only thing that your life is right now, and nothing else is ever experienced.","timestamp":"2024-08-12T04:24:15.124000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"934034159192653844","username":"rivadroid","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Rivadroid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260007769906610257","message_id":"1269198483391385651","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":18,"userName":"jamie0773"},{"id":"1265175009706643456","channel_id":"1260007769906610257","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is correct that you don't have control over your deeply held beliefs because your deeply held beliefs are just whatever you think is true in your thought based model of the world. What is necessary is to examine why a thought-based model of the world itself is a recursion/duplication and unnecessary. The belief is that with perfect knowledge/information then our thought-based model of the world would perfectly accurately reflect our actual lives and the world we live in, allowing us to understand everything and always make the best decisions we can. \n\nThe part that is faulty is that there is no map of the world or understanding stored in our brain in the way we think it does, because you can only think one thing at a time. \n\nA small example is a professor might say \"I have two PhD's and 20 years of experience! I know an *enormous* amount\" you could then say \"ok, tell me every single thing you know right now\", and not only would it be impossible for them to do that, it also only pops out word by word, sentence by sentence, over hours and hours.\n\nThis is important to observe and see how it relates to our general perception of our lives because it goes back to your statement of \"...it seems very clear that there's a mistake going on I'm certain about it but what's not certain is if the mistake can be resolved at all...\" This is based on a misunderstanding of the base function of thought like the professor. The professor can never reach a point of conclusion where he has expressed all of his knowledge, as knowledge cannot be retrieved out of the brain like a basketball from the garage, it has to be procedurally generated from memory. This will cause the professor to wrongly conclude \"I could solve this problem if I had more knowledge\", which is a tangential but similar to your situation and results in the discomfort of \"not knowing\" a solution or course of action. If you really scrutinize the whole process and how it actually, subjectively occurs to you however, it will actually reveal that acting from a place of \"not knowing\" is the place from which all action occurs. \n\nIn essence, it's not that you need to be looking for solutions in the way you think you do, but examining and realizing that you've invented a problem or mistake that does not exist.","timestamp":"2024-07-23T05:13:48.129000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260007769906610257","message_id":"1263204337044164639","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1262642152261816350","channel_id":"1260007769906610257","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It might be worth consiering what you think is \"perfect behaviour\". Or the ideal you want to live up to, because then you can apply the same scrutiny to that. As an example, if you imagine what \"ideal behaviour\" is, but you think \"oh, well I keep making mistakes so I can't be like that\" then extend that habit to the ideal. How do you know that your ideal that you've invented isn't also a mistake? What if you make so many mistakes that even your ideal is a mistake?","timestamp":"2024-07-16T05:29:07.856000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260007769906610257","message_id":"1260749873330917407","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1262641533187002399","channel_id":"1260007769906610257","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"With regards to what I'm talking about, yes there is nothing wrong with thinking about anything, same with dreaming as an example, but when you have nightmares or thoughts that bring emotional suffering then there is a misunderstood component of yourself causing that.","timestamp":"2024-07-16T05:26:40.257000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260007769906610257","message_id":"1260357493830451272","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1260339331625910313","channel_id":"1260007769906610257","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah, I see where you're coming from. I think there are two points I'd touch on, the first would be the constantly recurring thoughts element. Take one person who has to get up at 8:00am and so sets an alarm at 7:30, 7:35, 7:40, 7:45, 7,:50, 7:55, and 7:59 (there are lots of people like this believe it or not lol), compared to someone who sets an alarm for 8:00am and just gets up. If you're someone who actually just sets the alarm once and gets up, you are well aware that anyone who does the former strategy is doing something really nuts, but ask someone why they do that and they have a laundry list of reasons why it's actually a more effective waking up strategy for their particular situation when it pretty much never is. The fear of not waking up on time causes a neurotic behaviour that reduces sleep quality and because you're so stressed, probably causes you to fall asleep later and more likely to sleep through your alarm, and then there is this whole hyper-reality the person invents around why they act and behave a certain way around sleep schedules.\n\nIn a similar sense, there is no loss of function related to self-realization and doing the dishes for example. The moment you think \"damn, my kitchen is pretty messy, I want to clean it up\" you immediately will naturally want to clean it up unless there is something else more important, then you will say \"Ok, after I do xyz, then I want to clean up the kitchen\" and you will do that. \n\nSelf-image is not \"thinking about things I should do\" that's just thinking. Self-image is the emotional relationship to our beliefs about our life. If you think \"god my place is a fucking mess, why can I never take of this place how I'm supposed to???\" and feel upset, or think \"I'm such a shitty room-mate for not doing this\" that is self-image, but there is nothing wrong with thinking \"Fuck I should do my taxes if I don't want to go to jail\" in the same way you might not like your home is untidy. \n\nAs an additional element, the change in experience is that self-image causes you to feel anxious or guilty for not doing the dishes for your room-mate, whereas without it you naturally want to do the dishes so your room-mate will be happy and won't be burdened. You feel like you are doing a nice thing that will make them pleased, you don't ever have a negative feeling about yourself.","timestamp":"2024-07-09T20:58:32.632000+00:00","edited_timestamp":"2024-07-09T21:00:40.595000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260007769906610257","message_id":"1260007769906610257","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]