[{"id":"1450038164944326700","channel_id":"1450029121051562044","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There isn't an emotional relationship to an idea of presenting or what anyone is saying, but there is a focus/tension in relationship to the actual event as it's happening. Like there is a \"stress\" that I experience in the same way that asking someone out I'd probably be nervous. This isn't accompanied by anxiety or an emotion, but is a tense physical event containing uncertainty that you have to pay a lot of attention to because you perceive it as consequential/important. While in this particular case there isn't any emotional characteristic, it's not like you never experience emotions, it's that emotions occur when they are necessary in response to events that are currently happening, not towards imagined outcomes or events. \n\nTo answer your question directly, if I had a dream of doing a voice chat or talking on stage for example it would be pretty much the same, which is there isn't an emotion unless I perceive I have hurt other people with something I've said/done, but there is a tension or stressing focus. I think the best analogy is that I don't ever experience anger related to ideas, but you do still experience frustration, which is a strong energetic demand from your brain to try to communicate an important idea you don't think another person is understanding. In the sense that if you are *angry* it is because you think another person is saying/doing something harmful, whereas if you are frustrated there is no emotion, but a forceful effort of communication to express the other person is not understanding you. Being *angry* feels like anger obviously, but being frustrated exclusively is just heightened energy towards a particular focus, like a dog who wants to get out of the car so it can run around. With that said, yeah, there is definitely a tension and a real response to doing something a bit performative like our voice chats, but in this particular case nothing emotional, but there *could* be something emotional if something actually bad happened or I did something really stupid and hurt someone unfairly as an example.","timestamp":"2025-12-15T08:13:58.929000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"660785652622819328","username":"gamenightguy","avatar":"d1956ce65c9a5427819cdf01c5f18390","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Guy","avatar_decoration_data":{"asset":"a_5b1319abfc9f928479b68a73635f591d","sku_id":"1306330662965477478","expires_at":null},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"},"primary_guild":{"identity_guild_id":"1005111919805476904","identity_enabled":true,"tag":"EVIL","badge":"b2898fb9792d06427ade956f7413cd27"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1450029121051562044","message_id":"1450029121051562044","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]