[{"id":"1366058762057551932","channel_id":"1355271773649899580","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It doesn't appear this way because, literally, there is a structure in your brain that tries to interpret this sensory information in order to make sense of its concept of past/future and so an abstraction of yourself or the ability to imagine an abstraction of reality seems possible. \n\nThought is not \"about\" anything. It is not a pointer. It is a separate physiological process that occurs right now that you are aware of like hearing or seeing. It exists now and is part of present reality, it isn't \"about\" anything. In the same way if you watch a movie made in 1980 about the year 1935 the only \"real\" thing is an image being projected onto a screen right now. There is no \"past reality\" that exists at all.\n\nTo be clear, the image you see of yourself in the mirror is \"you\" as we casually express it in terms of how you physically appear being reflected, but it is obviously not literally you. I think we all understand that thinking is kind of like a mirror where it isn't *literally* the thing, but just like the mirror we think the image in thought is an abstraction of the real thing. This is completely false just like the mirror. The mirror is a piece of metal sprayed onto glass or whatever and it reflects an image back to the viewer. If you look through a window and see a tree you say \"yeah that's a tree\" If you look at a mirror you don't say \"yeah that's a mirror\" we instead say \"that's me\". That's the same error we make with thinking.","timestamp":"2025-04-27T14:29:49.019000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1355271773649899580","message_id":"1360514328054333491","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":86,"userName":"jamie0773"},{"id":"1359696074998026461","channel_id":"1355271773649899580","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Yeah, everyone has it, it is really just subjective experience. Identifying what that includes and doesn't include is self-inquiry. \n\nBefore self-realization, at a fairly undeveloped level there is the belief essentially \"I am this body\". For example when people believe in solipsism or religious fundamentalism it is typically from this view. This is the idea that \"me and my body are the only real human\" or \"me and my body will go to heaven/hell\". \n\nIf you've spent a bit of time reflecting on it or dive into it philosophically and try to hone down your sense of self-identity in thought (self-image) without self-realization, you come to the conclusion essentially that you are the \"owner\" of consciousness akin to the soul or \"the entity who is wearing the VR goggles\". The most common term everyday people use is \"my consciousness\" as they believe they are something that has consciousness, rather than identifying what consciousness itself is.\n\nTerms like \"point consciousness\" are sometimes used ontologically in spiritualism or idealism to represent a spaceless, dimensionless entity or source of personal individuation. This isn't correct other than as a concept to communicate other things, because even though it is an abstraction of something with no properties, the thought itself is a real object that exists in our brain that this alleged \"point consciousness\" contains or projects. This is not a correct identification of ourselves because it is essentially saying \"point consciousness is experiencing a thought about point consciousness\". This is self-referential loop that results in the false belief \"I can think about myself\" when this is impossible. You can't both be yourself and be thinking about yourself unless you are more than one thing. In this case we believe we are both our real selves doing the thinking and the knowledge we have about ourselves. The resolution is in realizing that there is not an external signal (the world) that is being interpreted and displayed by the receiver (me/consciousness) there is just the signal generated by the world's interaction which is itself consciousness/me. The analogy again is both Mario and the Mushroom kingdom are the video game. There is no piece inside the video game that is somehow not the video game. By definition everything in it *is* it. \n\nTo make it less abstract, J.K. says \"the observer is the observed\" to mean there is no centre of experience. You literally *are* thinking, you aren't an object that produces thoughts. You aren't an object that produces sight, you literally *are* the perception of seeing.","timestamp":"2025-04-10T01:06:46.211000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1355271773649899580","message_id":"1355271773649899580","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":11,"userName":"jamie0773"}]