[{"id":"1292724691840012329","channel_id":"1288249656932962386","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"No problem at all homie. \n\nI see where you're coming from with the analogy, but take it from the angle that there isn't multiple frames, but there is just one, constantly modulating frame. Implying that there is a pattern between modulations causing an observer to conclude there is multiple frames instead of just one is not the fault of the reel, but the observer. I think you are starting with the assumption \"well of course there is an illusion of a full film\" but you have to start with the assumption *I don't know if there is or isn't, what is there?*.\n\n I'll touch on the free will point at the end, but I think to directly address your analogy of the film reel requires a subtle change in perspective, which goes back to when I've referred to \"self-realization is breaking things up, not breaking things down\" not my quote, but the theme is correct. What is necessary is to stop using analogies or ideas to analyze your conscious experience entirely, and observe it directly instead. Using an example that is basically the same sort of analogy, look at this change in perspective:\n\n\"I think that reality is like a simulation\"\n\nThis is something a lot of people think, and whether you agree with it or not, we can all say \"yeah, I know the properties of a simulation, and reality kinda seems like that\". Now look at this subtle difference:\n\n\"A simulation is a lot like reality\"\n\nNow we are in a different situation because we have to directly engage with the *entirety* of reality itself in order to say \"yeah I guess a simulation is like that\".\n\nThis is the same \"stepping back\" that is necessary for self-realization and is what needs to be directly engaged with to get it.  While it might not seem like it exactly, this is largely the point you're raising regarding free will, which necessitates the reframing of \"yeah well free-will is like, the ability to act out of your own volition and make your own choices\" to \"what is volition, what is choice, and what is action? They are all dependent on \"Me\" that *does something*\" The question is does that actor even have character or exist? What is it? The resolution to that question negates and resolves all the other questions.","timestamp":"2024-10-07T05:46:24.198000+00:00","edited_timestamp":"2024-10-07T05:47:22.092000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1288249656932962386","message_id":"1288249656932962386","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]