[{"id":"1256447605488095375","channel_id":"1253958149862592594","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Don't really have strong thoughts about it. I'm not going to vouch for anyone's character that I don't know and anything harmful he's done I would not advocate for. If he legitimately did anything illegal and people were harmed by that behaviour then he should be treated like anyone else. The problem that most people have with regards to self-realization is they assume that someone without an ego would behave \"perfectly\" which is the person's own projection of their ego. It's not possible to behave \"perfectly\" because one person's view contradicts another. That's what we're trying to eliminate in the first place. It's not possible to make no mistakes, as you can literally do something correct and another person will believe you're wrong. You can also make wrong assumptions that result in your course of action being a mistake and know it yourself. As a small example, many people believe an enlightened person should behave like a monk or be self-sacrificing, which is complete nonsense and people who act that way are doing it for the sake of appearances, not because it's they're genuine character. \n\nI feel like Osho has a very forceful personality (compared to J.K. or someone like Eckart Tolle) and was a pretty popular figure, so was divisive enough of a character that he was treated (at a smaller scale) a lot like Biden/Trump or maybe more like Kyle Rittenhouse. You could easily make a documentary that paints any of them as either great people/martyrs or painting them as completely terrible people with no morals at all. Especially regarding Osho, imagine what your perspective would be if you believed that self-realization was not an actual phenomenon vs. if you did. Then very clearly you would believe everything he did was a malicious, self-serving cult because what he peddled was snake oil. These types of views completely distort the efforts of someone making a documentary because you could easily get a \"we had a great time and it brought meaning to my life, why else would I be there?\" type of people, but also \"They're a bunch of brainwashed hippy morons being predated upon for sex and money\". \n\nIn the same way if someone said \"What do you think about Kanye West?\" the basic answer is I don't hahaha.","timestamp":"2024-06-29T03:14:12.816000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"jamie0773"}]