[{"id":"1415100979866505336","channel_id":"1407452779504599222","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I would re-iterate that on psychedelics you will have \"an experience\" that you will remember and speculate about. The change in belief you experience going from \"this is how my life and reality works\" to \"oh, it actually is different that I thought\" is the only part that is actually somewhat similar to genuine self-realization. \n\n> On the other hand, if psychedelics aren’t required but might make SR more achievable (or provide a temporary glimpse), then are there some things that are preconditions? \n\nThere are no necessary pre-conditions as it is essentially a reversion to the base-state of how the brain functions without conditioning or operating according to accumulated belief systems or ideas about ourselves. Sort of like defragging your hard drive or realizing that even though you are running Windows 11, you mistakenly are also still running Windows 10, 8, Vista, XP, etc. and didn't need to be. \n\nThe main \"pre-condition\" for me that lead me there in the first place was actually getting very lucky, making a ton of money trading, then losing it all. When that happened my brain still anchored on \"I had all this money and lost it, I won't be happy until I get it back\". At the time I remember thinking \"I might never get it back, and if I do it might take decades, but this makes no sense. Either I will be unhappy for 20 years+ or the way I am conceptualizing my life must be completely incorrect\". The ultimate realization at the end of the line is not that the way you conceptualized your life was incorrect, but this new conceptualization is, it is the physiological cessation of conceptualizing your life entirely.","timestamp":"2025-09-09T22:26:04.905000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1415100324557095094","channel_id":"1407452779504599222","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"No worries, I appreciate the question.\n\n> So is there always some connection between SR and drug use? Do psychedelics make SR possible? Maybe for some and not others? \n\nThere's definitely not a necessary connection at all, it's just that often when people hear about self-realization/enlightenment/self-inquiry the resources for it in the west have all become mingled and popularized in the 70's-90's and so a lot of drug culture gets mingled in. It's very common for someone to read about meditation or self-inquiry and project and image of \"heightened sensory experience\" onto the whole phenomenon and try to induce it with drugs. Even when people are doing meditation basically everyone is trying to either \"silence their mind\" or is hoping for some enhanced state to occur i.e. they are trying to go from one state to a hypothetically imagined other state and are trying different means of doing so. If there is anything psychedelics can be helpful for with regard to self-inquiry is that they often induce a feeling of love and visual hallucination, which are both things that most people find very mystical and new, causing them to break their beliefs about what they thought their life and reality was. From that place some people have a \"well, what I thought before wasn't true, what *else* is there to explore/experience/think about?\"\n\nThe state induced (sometimes) by psychedelics is not the \"state\" of self-realization, it is a multitude of physical effects operating separately that are all so foreign to most people they just lump them all together in an experience they call ego-death. As an example, if you take like 5g of psilocybin (classic) you will at some point feel like \"you're about to die\" and try to fight it. You aren't actually dying, it is the feeling of falling asleep very rapidly which is why you can \"fight it\". If you just let it hit you it passes by and you remain awake but start hallucinating. You might later experienced a feeling a perfect love. In order to feel this emotion your brain has to be put into a state of having absolutely no problems or undone actions. This is perceived as \"my life is perfect, what was I worried about?\" and is related to the emotion. In a *very* strong dose, all of your long term memory is completely dis-regulated at it feels like you are suddenly born again in your present environment with a \"new life\" like when you have a dream and are automatically like \"well this is real and my life now\" despite it having no previous context. All of these components are separate, but all part of the same experience and someone might call one part or all of it \"ego death\". It actually has basically nothing to do with self-realization or genuine loss of ego.","timestamp":"2025-09-09T22:23:28.667000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"994849580766220379","username":"glassdoubt","avatar":"1eee7878c5b234b1ede42d7e215e9d77","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Hugh","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1407452779504599222","message_id":"1407452779504599222","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]