[{"id":"1365716365134004246","channel_id":"1342228629677019176","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think it might be the case that the answers will come more easily if each individual is completely honest with themselves. I imagine it is the case that if you read a lot of the stuff on here the objective is painted as \"find the real self\" and that is perceived as lofty or so \"underlying\" and hiding in plain sight that it is perceived as a goal or aspiration but it's not the case. You aren't looking for something special, you are just being asked to observe and understand the only thing you actually have. If you say \"well I am the consciousness or something\" but you actually believe you are a human being with a traumatic past and you're a democrat or republican and that you are a soul going to heaven and that you have had bad relationships with women/men because your ex was abusive and that your life is fucked because of how your dad treated you and that life is meaningless, then what you're analyzing is imaginary and not the actual thing. If you say \"yes I see why I am this present-state conscious experience\" but you actually believe you are million different traumatic experiences and self-identities, then you can't make progress because you are denying what you actually believe yourself to be. Self-inquiry is looking at exactly what is the case of what you currently believe and intelligently interacting with that. You eventually end up realizing you have no objective identity at all, you don't start with that and convince yourself it's true. \n\nIf for example I were to say \"I think string theory is bullshit\" most people (I know nothing about string theory) would be like \"yeah maybe. Idk. I don't know anything about string theory either, but it seems kinda legit?\" and they will just sit there and wait for an answer from someone they think is an authority that they deem satisfactory. There is no movement or new understanding from this. In the same way, you exist as a human being, and you are literally the only entity who has subjective awareness over exactly what you call \"Me\". Nevertheless when I say \"look into and realize what 'Me' actually is\", instantly we say \"ok give me some tips\" or \"where can I learn more?\". The whole point is to grab someone by the shoulders, shake them completely like they are waking up from a nightmare and to say \"you are yourself. You are the only one that knows, what the fuck is going on??? What are you???\" \n\nImmediately from this place the person then starts looking at the bible or religion or meditation or philosophy and that is again deferring to someone else to understand what you alone experience. \n\nThis is a bit obtuse, but for example, if you are having a sleeping dream, and in that dream your friend is talking to you and you say \"hold on a minute, is this a dream?\" and your friend says \"what are you talking about? Nah dude\", and then a few moments later you wake up, the question is: who were you talking to? \n\nFrom a practical perspective, in the dream you were confused, and just like in real life, in order to answer your question you asked someone else. You then woke up and would realize \"oh, I was literally talking to myself lol\". \n\nThe point is not to philosophize on if other people are real or not or that kind of nonsense, but to give yourself permission to actually observe the only thing that is subjectively real to you, which is yourself, and to figure out what that exactly is so it is entirely coherent, which means no longer being a problem to be considered ie. no self-identity to worry and think about","timestamp":"2025-04-26T15:49:15.231000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1342228629677019176","message_id":"1355937738381328626","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":14,"userName":"jamie0773"},{"id":"1351770117482221730","channel_id":"1342228629677019176","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"What you are describing is fundamentally the entire thing on a billboard. What brings it to an end starts with \"I exist, I know I exist because I experience it all the time. *What is it?*\" This doesn't mean \"where did I come from?\" or \"does my soul go on?\" It is not asking for the supernatural, it is asking \"You exist, what is it that you experience that you call your existence?\"\n\nThe actual complete understanding of *exactly* what \"Me\" actually refers to as a subjective and individuated conscious experience causes the false perceptions in thought of what we are to end. They end because they are automatically seen as \"oh, everything else *can't* be true\".\n\nAn easy example is when a kid learns their parents are Santa, it means that a flying man in a sled pulled by reindeer can't be real. If you learn about evolution, your belief that a biblical 6000 year old earth is not the case. These are all simple, unimportant, and don't really matter. The only thing that is directly, absolutely *fact* is that you exist. The resolution to what *that* currently, exclusively, and only *is* results in any other imagined identity being automatically perceived as useless, and is immediately dropped by the brain. This is what results in the psychological changes and shift in perception/identity.","timestamp":"2025-03-19T04:11:50.682000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1342228629677019176","message_id":"1342228629677019176","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"}]