[{"id":"1435740784954576916","channel_id":"1426895439864528967","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The point of self-inquiry is to challenge and then bring examination towards the observation that we are not actually directly aware of what \"Me\" is. In that if we forget any philosophical technicalities and sensory perception stuff, in plain, practical english if you look at an apple you say \"that's an apple\". It's completely and utterly plainly obvious to us. If someone were to say \"define an apple\" yeah that can be a bit difficult because you're probably also describing parts of a pear, or other fruit. Self-inquiry is not about someone being like \"well, a tomato is like a vegetable thing\" and someone says \"haha idiot, it is in fact a fruit!\" and maybe if you finally had proper of knowledge of \"Me\" someone would happen. This is what we normally do and is what our self-image is. It is our self-knowledge. We try to understand the world and ourselves through collecting and refining more and more granulated knowledge of who we think we are. \n\nThe primary point of self-inquiry isn't to have \"correct knowledge\" it is to say \"ok we all know that thing over there is an apple, we then collect and debate knowledge about the apple, but what is your Self?\" This is the part that is not obvious to anyone because they have never looked at it. More importantly if you pin them down it's always \"My consciousness\" or \"my body\", but this is not a thorough examination because there are many other things they also believe are \"parts of themself\" like their money, friends, possessions, status, appearance, etc. In the same way they say \"I am absolutely 100% sure this is my arm and is part of me\" then if you chop their arm off and they are an amputee they say \"well I'm still myself and that arm is no longer part of me\", well then what are you? \n\nThe resolution in self-inquiry necessitates you actually looking into this as another person can't tell you what you are as they are not you, but it results in seeing pretty straightforwardly and in a practical way that you can think of absolutely everything in subjective experience except yourself, as you are the experience and there is no direct object like an apple that you can identify or point to as \"Me\".","timestamp":"2025-11-05T21:21:17.907000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"185405093263310848","username":"loungemeister","avatar":"432d7e176d622918c35e309f469dfffc","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"Loungemeister","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1317652487552893031","identity_enabled":true,"tag":"SKG","badge":"7ed1a7788cf94367411222f8c02c523e"},"primary_guild":{"identity_guild_id":"1317652487552893031","identity_enabled":true,"tag":"SKG","badge":"7ed1a7788cf94367411222f8c02c523e"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1426895439864528967","message_id":"1426895439864528967","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"}]