[{"id":"1336633472558829578","channel_id":"1335158420931608576","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Awareness doesn't externally fix anything, if what is being referred to is self-realization, then that \"fixes\" neurotic emotions. If you have bills to pay, or people don't like you, or you wish you were in better shape, then yeah you still have to do the physical behaviour to resolve or achieve those things. \n\nIt is not the case that if you have a physical addiction you just \"decide\" to stop doing it, but you observe it directly and can use your intelligence to say \"this behaviour has poor outcomes and I want to change it\" and you will make some effort over time to do so. Your whole being re-orients itself to what it considers \"intelligent behaviour\" in relationship to your genetic nature because there is no longer the constant effort to avoid neurotic emotions/anxiety/etc. created by your self-image/ego. Everything just becomes \"how do I most be myself?\" and that is really what intelligence fundamentally is. \n\nThere is nothing wrong with following your thoughts down their line of thinking. It's the same as dreaming. The only error is the emotion they bring to you that causes harm because you believe you are in them. There is no need to practice awareness in the same way there is no need to practice lucid dreaming. The only thing you have to do is become aware of why you are not inside of your dreams or your imagination of yourself. This realization will then cause the cessation of those other things. \n\nThe end goal of meditation is realizing you have always been meditating your whole life. The goal of meditation is to fundamentally realize you have been spending your entire life trying to resolve one thing or another that doesn't exist. Your life is a continuous series of escalating problems you're trying to solve, and when you go back to \"ok, so why is this a problem in the first place?\" There is no beginning. Yo have to go back there.","timestamp":"2025-02-05T09:44:13.307000+00:00","edited_timestamp":"2025-02-05T09:44:53.109000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1335158420931608576","message_id":"1335158420931608576","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":16,"userName":"jamie0773"}]