[{"id":"1259817269513683075","channel_id":"1259800121202184192","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Imagine you woke up with amnesia and had no idea what was going on. Like literally you just started existing *right now* and were like \"what the fuck is this???\" Another angle is to imagine you were the only human being on earth and were absolutely certain of it. You are now trying to figure out what the frick is going on with no input or advice from anyone else. The emphasis is you obviously wouldn't be thinking \"ok, so I just gotta figure out calculus, and then quantum mechanics, and then do a brain scan + contemplate string theory\" you would just be referring directly to the faculties of your own thought and experience and trying to figure that out. \n\nJust for emphasis I'm not trying to be particular with \"So you also wouldn't know English or blah blah blah\" I think you get the gist I mean it in the really practical straightforward way. Like \"you are a primitive caveperson or something, looking at the milkyway with no light pollution and trying to figure out what the hell your existence is with all the very limited experience you have\". From this place you very quickly exhaust your physical knowledge of the world, and have to go directly to \"so what on earth am I experiencing?\"","timestamp":"2024-07-08T10:24:03.325000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1259800121202184192","message_id":"1259800121202184192","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]