[{"id":"1405137943877779588","channel_id":"1327357221058773143","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> I think you're wrong about that good and bad fundamentally are just trivial and arbitrary concepts created in thought, and for two reasons:\n\n> We really seem to have, as Griffith argues, unconditionally selfless moral instincts, an innate biological drive towards behaving lovingly and selflessly, and in turn perceiving that sort of behaviour as \"good\" and perceiving divisive, selfish and destructive behaviour as \"bad\". There's a lot to support this, and actually the existence of SR is really good evidence that our selfish, angry behaviour is psychologically derived and therefore can end, letting our moral instincts come up to the surface.\n\n\nNot trying to be difficult as I genuinely appreciate this perspective, but it seems to me that these are somewhat not \"reasons\"  as you've written, but perhaps a bit subjective and moralistic in nature? I think what you're describing is very compassionate and I agree with many parts of it. I do think that all human operation and intelligence itself is from love and compassion. That is my own experience and what I advocate for as possible. I do not personally perceive good or bad at all and all I perceive is action and physical reality. If you want to then come in and say \"well Jamie, I am now going to categorize in my thinking some of those actions or perceptions as good, and some of those things as bad\" then you can go ahead, it is not how I perceive things. I don't perceive things as good or bad, I just see the \"thing\" as it is and there is reaction. I am not saying I \"see things as they are\" meaning I see things \"correctly\" I mean I see things as I see them and there is no \"judgment\" based on previous beliefs. \n\n> The existence of an integrative theme or direction of change in the cosmos, where over time matter integrates, smaller parts continuously come together to form larger and more stable wholes (Griffith terms this \"Integrative Meaning\", and says that \"God\" is our personification of this underlying truth in reality). This also plays into why we view integrative behaviour as \"good\" or \"meaningful\", because it is in line with this greater direction of existence to create more complex structures. The dreams of \"peace on Earth\" and \"a brotherhood of man\" I think express this deep intuition we humans have that that is what we are, and in fact the cosmos is, striving for, what is ultimately good and meaningful.\n\nI really appreciate you saying this, but to express my view personally, this paragraph is largely meaningless to me. This part \n\n> The existence of an integrative theme or direction of change in the cosmos, where over time matter integrates, smaller parts continuously come together to form larger and more stable wholes \n\nI would say \"yeah, sort of I guess\". but the rest of the paragraph loses me and I disagree entirely and don't see resonance in at all. \n\n> So if all that is true, which I strongly believe it to be,\n\nIf you strongly believe it to be, then notice that your emotions and reactions towards others are in accordance. My root suggestion around self-inquiry is not that anyone's ideas are wrong, but that holding beliefs at all is a misunderstanding of how the brain functions and unnecessary. \n\nYou can \"think\" anything you want, but to believe something to be true is the source of many people's neuroticism and inquiry.","timestamp":"2025-08-13T10:36:32.021000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"840589915943469096","username":"albin4285","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Albin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1327357221058773143","message_id":"1399674676955054094","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":31,"userName":"jamie0773"},{"id":"1346052272685060118","channel_id":"1327357221058773143","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey, sorry for taking such a long time to respond. \n\nI'd agree with what you posited in that the argument of humans trying to negotiate the concept of good and bad is because it's identical to past and future. For there to exist a bad or good there needs to be a comparison point in thought and that exists in the relationship between our concepts of present, past, and future identity. This is still not biological, but an identification with our ideas and beliefs. \n\nThere isn't fundamentally anything the mind \"has to do\" other than what it (you) thinks is most efficient and helpful at the time. All that I'm really trying to communicate, and perhaps the person you are describing, is that if there is a fundamental change in perception around our relationship to our thoughts and beliefs, there is also fundamental and physiological change around our outwards perceptions. Things like good or bad, past or future, nightmares and dreams, then become trivial and unimportant. When I say \"our beliefs about ourselves have an origin in our the invention of 'Me' at a very young age\". I think this is accurate, but it is not necessary. What is necessary is the aforementioned cessation of past and future, good and bad, that exists in our mind as ideas and is a residue of *some* learned phenomena, whatever it may be. It is absolutely thought, not genetic nor biological.","timestamp":"2025-03-03T09:31:10.250000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"840589915943469096","username":"albin4285","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Albin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1327357221058773143","message_id":"1337357866423554048","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":13,"userName":"jamie0773"},{"id":"1328995630961655840","channel_id":"1327357221058773143","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*SR happens when you start to identify with that \"someone or something\"/the observer of consciousness and completely drop any other identification with self image/ego *\n\nThis is probably where you're getting the wrong idea from, which is the assumption that self-realization is about realizing \"I am not this, I am *that*\" which is just the replacement of one belief with another and is still your ego or self-image. Anything that you think you know about yourself is not yourself, and is why I suggest that self-realization isn't achieved through the meditative effort to stop thinking about yourself all the time, it is about realizing that you actually cannot think about yourself. \n\nRegarding the notion of why people do it and how to help people in the future, I wouldn't worry about it because it's already playing out. The basis of why people creates a self-image is because others refer to us as \"You\" and our existence we refer to as an object called \"Me\". It is not immediately intuitive to us why we should question or try to understand this experience because we already have lots of other more pressing physical and biological pressures. If you are starving or physically suffering, then those pressures are far more biologically imperative than self-inquiry. Only now is there enough freedom from those things along with global communication that we have all started looking for \"something more\" than just physical success or betterment. We can get into the evolutionary/economic pressures as to why, which is just theorizing, but I can assure you that the pressure for it is escalating socially and is part of the reason I even looked into it in the first place. That said, it's definitely a \"secure your own mask before helping others\" type of thing. Not sure if this is helpful or not helpful, but in my own experience it is very analogous to telling a religious person that their religion is causing them suffering. People get very upset or resistance to being told their beliefs are incorrect or unhelpful, and it really has to be an organic search on their own behalf to be helpful to them.","timestamp":"2025-01-15T07:54:09.966000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"840589915943469096","username":"albin4285","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Albin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1327357221058773143","message_id":"1328669965225693237","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":10,"userName":"jamie0773"},{"id":"1328261072402124871","channel_id":"1327357221058773143","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Our self-image/ego/self-knowledge, which are all just different words for the same thing, are our genuine beliefs about what we think is true about our life and who we are. All of our neuroticism is caused by the creation of an identity we call \"Me\" and we use our sensory perception of thought to model than entity and call it \"My life\". Anything that adversely affects \"Me\" in thought will cause an emotional response.\n\nGoing into each emotional response is its own thing, but in brief the main ones are (when related to self-image):\n\nAnxiety: the belief that there is a threat to the imagined \"Me\"\nAnger: the belief that someone else poses an unfair threat to me or others that could be forcefully addressed without experiencing shame\nShame: The belief we have wrongfully hurt someone else\nSadness: The belief we can no longer experience love/compassion towards a particular person or ideal\n\nLove: the only positive emotion, which is genuine and complete communication with another person. \n\nThe problem is that while these are the only emotions, we experience a duplication of these in relationship to not just our sensory perception, but our imagination of ourselves, causes a \"what do you mean there is only red and blue? What about purple??\" This is like saying \"what about happiness, or pride???\" This is just a form of relief that is caused by disliking our imagined selves, achieving something, being in full alignment with that imagined identity, and so now we can \"love ourselves\" which is relief and pride. This emotion is love, but is not described that way because no one experiences it directly, but only in proxy as relief through achieving our goals or feeling socially validated. \n\nThe only reason I'm saying this with some authority is because if you experience a million different emotions from two different colour wheels, and then one colour wheel ends, then instantly you realize \"oh, it was always just a very simple colour wheel, but I accidentally had two running over top of each other\". \n\nThis operation is the combination of our immediate sensory perception combining itself with \"my imagination of myself\"\n\nThis might be a lot to consider or sound whack to you, but I would simply summarize it as the cause of neuroticism is the invention of \"Me\" at a very young age that we then mistake for ourselves. It is no different than how people mistake themselves for a Republican or Democrat, a Muslim or a Christian, or any form of intellectual identification they mistake as \"Me\". The deepest root of the whole thing is just \"Me\" or \"I\" that is a falsely created belief system.","timestamp":"2025-01-13T07:15:17.558000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"840589915943469096","username":"albin4285","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Albin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1327357221058773143","message_id":"1327357221058773143","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]