[{"id":"1447186629306486986","channel_id":"1444949340547190916","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"yeah, if you have more specific questions in relationship to the philosophy I'd be happy to answer. I genuinely don't have any familiarity with it particularly at all.","timestamp":"2025-12-07T11:22:59.854000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1444949340547190916","message_id":"1447177590409396246","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1447172721372041348","channel_id":"1444949340547190916","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I haven't ever looked into it philosophically, I will say being romantic is pretty cool and intelligent. I know a little bit about how the shift affected architecture and design (recent video lol), but my baseline take is that humanity and life itself is fundamentally intelligence operating on our physical systems. Philosophy as an extension is a fun application of rules to the physical sense of thinking and is nothing more than that. There's nothing wrong with thinking and philosophy and you have to do some to communicate effectively at all, but I really don't see too much value in ideologies or philosophical styles of thinking because they're really like architectural styles. They are forms of beauty and perfection of different sections of thought/ideas. One isn't more true than the other, but are local maxima type solutions. Maximize pleasure, get this philosophy, maximize beauty, get this philosophy, maximize balance, get this philosophy, maximize attraction, get this philosophy, etc. etc. \n\nMaybe this relates more to your point, but  my Dad always described himself as a \"romantic\" and was very much a hippy guy born in 1948 and built a boat and sailed the world and did various very cool entrepreneurial stuff his whole life. With all due respect to him as we have a great relationship, he unfortunately is not at all compassionate and has never really achieved his \"romantic vision\" of life and relationship because of what he largely views as the follies of other people. He always thought as a young man that if he (vision of the time) was the master of his own domain, was more skilled and intelligent than others, then created the maximum possible contribution to society or romantic partner then *that* was maximum romanticism and love would be achieved. I have no idea what a modern take on Romanticism the academic philosophy would suggest, but that was my Dad's belief, and it didn't really play out because he ran into a hard wall of \"yeah, you can create the romantic external world, but the people in it might still find you annoying and not like you\". \n\nI again am aware this is clearly not real \"Romanticism\" but philosophically any idea around the perfect external world that creates the perfect internal state cannot occur without self-realization, and the pursuit of the perfect internal state through external action is drug addiction. Even if you are reading a wikipedia post that says \"you just want to love\" and you say \"true\" it is already an extra step in imagination you have to ask \"why did I need to confirm this?\"","timestamp":"2025-12-07T10:27:43.944000+00:00","edited_timestamp":"2025-12-07T10:31:38.346000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"89826366870007808","username":"jorge2096","avatar":"bbe4f176c3dfef23476b09336d14dc17","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jorge","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1444949340547190916","message_id":"1444949340547190916","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]