[{"id":"1306687672328261663","channel_id":"1303587982015463434","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The analogy I like to use is that no matter how confused or to what beliefs a seed attributes it's behaviour, ultimately it is always and inevitably just becoming itself and that is the only thing it is capable of ever being. It's only destiny is becoming what it already is (the tree). You can extrapolate this from a small genetic level or up to the scale of the whole universe, but everything in the entire cosmic order is just acting itself out through this sort of intelligence. This is largely what he's referring to as God, which is essentially the nature of life/reality/the universe itself. In an individual, it means that no matter how much you pretend to be responsible for your actions and behaviour, the actual agent who is always acting is a part of God (your nature). It's like saying \"when I play World of Warcraft, I can do whatever I want!\" and it's like no, you can do anything that is within the rules of the character you are playing. \n\nWhat is more fundamentally being pointed to is the view \"Whatever is the truth, is the truth\" which isn't saying \"I know the truth, or I don't know the truth\" it is a complete psychological indifference to it, but awareness that whatever is so, is so. This lack of demand to know or not know is the self-realized/non-dual perspective. \n\nRamana uses a lot of references to Hindu religion likely because he and his peers were educated in it and it made sense to communicate it that way. He mentions for example \"the 5 senses\" in other talks, and if you were to tell him \"well actually there are over 15 distinct faculties of sensory perception\" he'd be like \"ok sure, then I mean that\".","timestamp":"2024-11-14T18:30:18.166000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1303587982015463434","message_id":"1303587982015463434","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"}]