[{"id":"1336621750770991145","channel_id":"1320804474960482447","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think the most straightforward way to express it would be that I would try to make the most intelligent decision possible given the information I had at the time and my previous experience. \n\nWhen I often go on about past and future being products of thought and not real experiences, this doesn't mean that you don't think about tomorrow or reflect on the past, it means that you realize that the things you call the past or future are not the past or future. An analogy would be a weather model, in the case that you say \"the model says next week will be snowy\". If it doesn't happen you say \"ah damn, the model I was using was incorrect, I better see if I can improve it\". What you are doing is improving an algorithm that models present data into the future, you aren't literally predicting the future. If someone says \"I might have something to offer you in the future\" there is an automatic translation of \"Yeah this guy doesn't have anything to offer me in the future, they are offering me a present moment idea they have, which I will evaluate as best as I can\".","timestamp":"2025-02-05T08:57:38.615000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703324340099481720","username":"buzzz_89","avatar":"97b28f97ccece9e551e012752213e1df","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"buzzz","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1320804474960482447","message_id":"1335556921310187602","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":9,"userName":"jamie0773"},{"id":"1328216083035066458","channel_id":"1320804474960482447","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Just adding that to sort of give some information related to drug related or metabolically related changes in state psychologically","timestamp":"2025-01-13T04:16:31.257000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1328215976759791698","channel_id":"1320804474960482447","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Right right, I'm not disagreeing with what you're saying regarding the physical presence of different chemical bodies in the brain or elsewhere, the part that I'm maybe disagreeing with is the cause for why they're there in the first place.\n\nIn a sense I am more suggesting that it would be much *more* strange if someone had perfectly \"healthy\" chemical balances in their brain and was still depressed/anxious. If someone had this situation I would be like \"fuck, yeah this guy is *depressed* and I don't think self-realization would do anything\" I would probably again put this in the category of physical damage or malfunction however, although I'm sure that can happen from disease or illness. \n\nWhat I am absolutely certain of is that things like anxiety/depression and cognitively related neurotic disorders are *not* evolutionary adaptations, they are the result of belief systems created by thought that aren't \"weeded out\" by evolution (yet) because common beliefs that tried to explain reality are more conducive to survival than the neuroticism that is associated with it. \n\nI would entirely agree that a severe lack of energy and desire for action related to illness would be evolutionary and that is likely the case. I would not agree that despair/sadness need be associated at all, strictly from a physical necessity standpoint. I think one of my main points and what is true in my own experience is that nearly everything that we attribute to \"ambition\" or \"motivation\" or \"sadness\" or \"anger\" as fuel for the fire of action can be replaced *way* more efficiently by \"intelligence acting within a state of peace\". \n\nJust as an analogy: in coaching, the theme is that they tell clients \"you're upset because your life sucks, get your life in order and you'll feel better\" which is true. In therapy they tell you \"Your life is actually fine and there's nothing wrong with you, don't be so hard on yourself\" which is also true. Both are means of addressing an underlying emotional suffering. I am suggesting that if there is a realization that causes an automatic acceptance of *only* the fact of perception at hand then there is no need for a neurotic emotion or a coping mechanism, only intelligence for thinking and acting, and you can be peaceful throughout. I will again emphasize I'm just speaking on the \"how does this make sense from a psychological/physiological/evolutionary standpoint\" I know it sounds a bit blunt or dispassionate, but just addressing that part of it. I think nearly all neuroscience or medical science I would agree with, it's just the \"so this chemical means *this emotion which must always happen*\" which is not the case. \n\nI don't think I'm qualified to speak on any medical related stuff beyond this, but this would be main point: I know for certain that before self-realization, if I were to have got one arm blown off or went blind, I would have been absolutely morbidly depressed about it because what I thought my life was going to be would have been ruined. Everything that I wanted to achieve or do would have been either completely stunted or ended completely. If it were to happen now, it would not emotionally affect me at all and there would be immediate \"ok so I have one arm now fuck, call me Samus baybeeee\" and instant effort to adapt. Not trying to be too dire here, but if for some reason I couldn't see, hear, or feel anything but was still conscious, I might be like \"yeah this is lame af, put me down doc\" (Canada moment) but there would be no sadness at all. \n\nAgain, not trying to disagree or suggest anything. Maybe to add some more info if it is useful, when I use to drink alcohol or have coffee, there would be an emotional high associated with both, but in different ways. Now there is neither, just the effect of the drug. These are both still appealing in some ways, but if for example I'm very hungover, then I will be quite tense and alert, but not anxious at all like before.","timestamp":"2025-01-13T04:16:05.919000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703324340099481720","username":"buzzz_89","avatar":"97b28f97ccece9e551e012752213e1df","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"buzzz","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1320804474960482447","message_id":"1322863517472264192","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1322018367351165003","channel_id":"1320804474960482447","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Hey dude good to hear from you.\n\nI would agree that there are some drugs that induce an emotional state and there's not really anything you can do about it. If you have schizophrenia for example I doubt that any forms of hallucination would go away, but perhaps the nature of them being scary or unsettling would. If there is actual damage to or a deformity in the brain then yeah it's not like that would be resolved through self-inquiry or self-realization.\n\nWith that said it is a bit murky around what is caused by the drugs directly and what is caused by the effect of the drugs on an individuals thoughts or perceptions, which then affect their emotions. As an example, both caffeine and alcohol used to give me a sort of emotional high, but neither does anymore. Alcohol had that effect because it basically causes you to not perceive the problems in your life causing anxiety/stress and the feeling of relief is a compensatory effect. Caffeine instead enhances an already existing positive affect. The stimulant makes you feel more of everything and the depressant gets rid of your problems and allows an experience of relief. Both of these completely stopped for me and neither has an emotional effect, but the physical effect obviously still occurs. Without trying every single drug one by one I wouldn't be confident to say whether or not the emotional effect of each one is directly caused by the drug or is a secondary effect that might stop occurring. Personally every recreational or medicinal drug that I've taken still has pretty much the same physical effects as before, but none of them have a negative emotional effect. Psychedelics still induce positive emotion (love) but now it is much shorter lasting and not really a profound or insightful experience. \n\nI'm not sure about physical environment stuff like pollution/diet etc., but I think that unless it is again to the degree of actual physical damage or deformation like Chernobyl or lead poisoning type of thing that it's generally unlikely to be the root of emotional suffering in individuals.","timestamp":"2024-12-27T01:49:00.690000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"703324340099481720","username":"buzzz_89","avatar":"97b28f97ccece9e551e012752213e1df","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"buzzz","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1320804474960482447","message_id":"1320804474960482447","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]