[{"id":"1346093622000615446","channel_id":"1338721704519794781","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Sorry I responded to the chat without getting re-caught up, my apologies if it wasn't that contextually accurate. \n\nI would still suggest that when I say it's a form of waking nightmare, it is the case for example that you are operating in a psychological state where you are evaluating yourself as good/bad. I am suggesting there is no such thing, there is only \"exactly as you are\". The point of contention is that I'm sure you are able to say \"yes, that's true, I am only what I am.... so is that good or bad?\" When I say \"good and bad don't exist, there is only 'what is'\" you then want to *evaluate that*. \n\nIf I can maybe re-state the whole point, which is itself our ego/self-image, imagine you made a movie. Because you might care about being a director or progressing your career, you ask everyone \"so, was my movie good?\" and what you're looking for is everyone to rate it out of 10, so you can get an idea of how effective you are as a movie producer. This seems to make sense because it aligns with the entire world you have lived within and what you've grown up with.\n\nlet's reframe it slightly, and imagine you made a movie. Every single person you ask \"so, what did you think about my movie?\" and they say \"well, I thought it was exactly as good as it was!\" and you would be like \"what does that mean, was it bad or good?\" and Quentin Tarantino says \"damn dude, that movie was exactly what it was\". and you are thinking \"soooo... bad?... good?..\" you ask your producers if they are going to green light you for another movie or not and they say \"well, that movie was exactly what it was and the people financing thought it was exactly what it was... soooo..., I guess you'll get do to exactly what you get to do!\" \n\nthis would be infuriating because you want comparative measures to make past and future predictions and present evaluation about yourself. The movie has always been exactly the same, everyone sees it how they see it, but you want a measurement to hold in your own beliefs and compare to your other beliefs in order to create a narrative about your own life in imagination. If no one gives you this, there is enormous uncertainty and demand. If you are simply *never given any evaluation* you will continue to struggle to find any sort of metric to measure yourself. What I'm suggesting is if the external world *never* gave you a metric, you would be on a wild goose hunt for something you will never get, which is \"how do I measure myself?\"\n\nWhat I'm suggesting is that while it is not obvious in our society, it is actually the case if you examine yourself, there is actually no possible way of ever measuring yourself in any way as a personal identity. From this place, someone can say \"your movie is shit and you're a terrible director\" and you can be like \"damn, lol, okay I'll do better\" and there is no hurt or sadness automatically.","timestamp":"2025-03-03T12:15:28.695000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1338721704519794781","message_id":"1346072635036925962","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":5,"userName":"jamie0773"},{"id":"1346069330118311977","channel_id":"1338721704519794781","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Self-esteem is analogous to \"self-evaluation\"  or what most people day to day call \"happiness\" or \"how was your last year/10?\" and is what you measure your characteristics as compared to your past-self, future-self, what you should be, and other people. \n\nIn a straightforward sense, all of these are nightmares or imaginations of \"things that aren't me but I wish were/weren't\" and if they end, then you are left realizing you are just exactly what you currently are, all the time, exactly as you experience it right now. There is no thought at all about \"self-esteem\" because whatever is \"the fact\" is \"the fact\". Instead of thinking \"oh man I'm super smart\" in high school and being smug about it, then going to college and there's a bunch of people smarter than you so you're sad, instead there is just the automatic, non-thought based acceptance of \"I am exactly as smart as I am\" and no external factor will change that subjectively. You don't feel smug initially and you don't feel hurt later. You are just coasting as neutral/content all the time. If you imagine the same person living those two lives, the difference is not just the emotional state, but every single thought the former state experiences is not experienced by the latter. That's the tangible difference.","timestamp":"2025-03-03T10:38:57.059000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"180866243819995136","username":"creikey","avatar":"7ea3ef410568c63dcdc7bf4a3305e9bb","discriminator":"0","public_flags":256,"flags":256,"banner":null,"accent_color":null,"global_name":"creikey","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1338721704519794781","message_id":"1338721704519794781","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"}]