[{"id":"1359668836030480534","channel_id":"1341291564680613908","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Our issues are caused by the belief that our thoughts can be *about* the past or future as if they are external events that sandwich our present life in-between. This is both not correct and also without utility. It is incorrect in terms of literal function because thinking is a present-moment sensory perception like seeing or hearing, and so doesn't contain time in the same way a drawing simply exists right now regardless what the drawing is about. The utility component is there is never a need for addressing a past or future event that isn't immediately addressed already by present observation. \n\nImagine you missed your train stop and are annoyed about it. The anger is caused by the belief that you (self-image/ego) had a lapse in attention or judgment and missed your stop. The anger is at the imagination of your past self making a mistake they shouldn't have made and is a form of suffering. There is absolutely no useful function to this as it can instead be addressed by you (your actual self) observing immediately in the present that you have missed your stop and must now react to this new situation to get where you are supposed to go. \n\nSelf-realization is really about first identifying that this self-concept exists as a way for you to model your past, present, and future in one cohesive idea of \"Me and my life\", we then mistake it for our actual selves, and then emotional react and try to constantly modify the model throughout our life. It is completely unnecessary, is not how time/thinking actually works, and only causes harm while it exists.","timestamp":"2025-04-09T23:18:31.935000+00:00","edited_timestamp":"2025-04-09T23:19:38.722000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1341291564680613908","message_id":"1352471113229402163","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":8,"userName":"jamie0773"},{"id":"1352124939142172692","channel_id":"1341291564680613908","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The basis of it is that saying \"that's what humans do\" is not a sufficient explanation, because you can use that to describe any behaviour at all. If I were to say \"yeah murdering is probably not a great idea most of the time\" and someone were to say \"well that's just what humans do\" that isn't a sufficient justification and there is an underlying psychological concept that caused the person to say or believe that.\n\nIf you have emotional relationship to your beliefs and self-identity, then no matter what, you are always like a leaf in the wind in your own response to other peoples thoughts, at least in some areas and towards some ideas. This structure can be seen as intuitively challenging because it means that anyone can just randomly say something and control your emotions like a puppet or automaton. If I say \"Trump is good\" to my mom or to many people who share certain beliefs, they will predictably respond with anger, even if I say \"lol just kidding\" afterwards every time. Like pressing a mind-control button, they can't stop themselves from experiencing anger whether I'm being serious, sarcastic, or neutral. They don't see it as non-sensical, they see it as just \"that's how it is\". The alternative is that there can be a perception or state where there is no reaction at all to any thoughts or ideas regardless of what they are, there is only the contemplation and consideration of them. The real basis of the whole \"you don't need to emotionally react\" type of thing is because when there is genuinely no emotional reaction to thought, you realize \"yeah you really don't need emotion for *nearly* anything, you just need human intelligence\". \n\nA similar concept is how most people romanticize the death of a loved one and say \"Their death was a tragedy and I will never truly recover from the love I shared with them. I will always be hurt by their loss\". Everyone is then like \"wow very empathetic\" but this is also the same phenomenon. If you ask yourself, anyone who is really compassionate would say \"If I die, I had a good life and I am so appreciative of having my family and friends. I hope they can realize how happy they made me and can move on from my death right away and live their life to the fullest\". Why is it the case that we say \"wow it's great that you are so compassionate and want your family to move on right away\" but we also say \"wow, it's great that you are miserable and suffering that your dad is gone and it really shows how much you loved him\".\n\nI am suggesting that this is completely contradictory and is unnecessary, but if instead you were to say \"Wow, just two beautiful perspectives on the same subject of death\" you could get some applause, but it is still two unreconciled points of view.  The reconciliation of those two points of view into a singular fact is the resolution to the suffering experienced by both people, and the acceptance of the fact that has occurred.","timestamp":"2025-03-20T03:41:46.758000+00:00","edited_timestamp":"2025-03-20T03:43:20.587000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"776884386372255755","username":"q__c_","avatar":"9da34bdb46f23c4e74ef91e6b87fde84","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Q-C","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1341291564680613908","message_id":"1352047846823559219","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1351754400388874251","channel_id":"1341291564680613908","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I don't think I communicated it very well in those past videos, but the theme is to recognize that *something is the case* and then to be like \"huh, it is always like this\" kind of like a computer that has an automatic response and to be somewhat caught off guard by that and wanting to resolve it. Being a bit goofy, but my mom hates trump, and so if I ever want to make her mad for some reason, I just say that I liked one of Trump's ideas and she gets really upset. This happens literally 100% of the time and she can't do anything about it. When I tell her \"Jan, every single time I praise Trump in that way I'm just joking, but you get mad every single time and you can't control it. Do you think that might be slightly nonsensical?\" she can't understand that and instead sees it as \"no, I just get mad when people say things that are obviously wrong\". \n\nThis is sort of my intention of trying to point out our self-image/ego/self-knowledge and our emotional relationship to it in order to get people to be like \"fuck, that is what I do, so then what?\"\n\nIf you are looking at your belief in time, the way it appears to us when we imagine \"my life\" is like a bead on a string, where the origin of the string is \"my birth\" and then that string runs through time up to the bead, which is our present experience, and then the string continues into our hypothetical future until we die. This is the root \"belief\" of when we have thoughts like \"what do I want to do after I graduate?\" or \"are me and my girlfriend going to be together in a few years?\". We have these thoughts and think we are contemplating a real concept of past and future that exists on this underlying structure of what time/our life is. \n\nThe necessary thing to examine is \"how am I aware of this past or future?\" and from that examination we can see that all concepts of past and future are forms of thinking, and thinking is a present phenomenon. We are all aware of this, but we still say \"yeah, I know thinking happens right now, but it can be about the past or future\". Is that true? That's where you want to look regarding our concept of time. It's not about philosophical meandering, but \"zooming out\" and observing where a certain structure originates from until it originates from direct experience and can be resolved/unknotted.","timestamp":"2025-03-19T03:09:23.435000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"1031563309759078431","username":"whybyfire","avatar":"a20585552cab5dfdc25f7e91f8947cfd","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"ishaan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"},"primary_guild":{"identity_guild_id":"1076387710173982830","identity_enabled":true,"tag":"JOE","badge":"58271fb362c4464a4ebead69a2ec0f72"}}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1341291564680613908","message_id":"1346521887832014931","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1346072938784489502","channel_id":"1341291564680613908","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Fundamentally the belief in our past and future identity is our ego/self-image because this must exist in our mind to create the idea that the present and only reality is incorrect or must be changed. It is also the birth of good/bad, right/wrong, and any form of \"more than one thing occurring at once\".","timestamp":"2025-03-03T10:53:17.432000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1341291564680613908","message_id":"1341291564680613908","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]