[{"id":"1260789140702888066","channel_id":"1260434346683404408","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Doom-scrolling is really just scrolling with an attitude of doom lol. If you spend an hour scrolling tiktok, feel \"oh my god I wasted 2 hours god why did I do that fuck\" then the real problem is your beliefs around how you spend your time, not the activity you just did. People scroll through social media because they want to, their beliefs are doing as such is bad, so then they feel guilty and have remorse, and try to figure out ways to stop themselves from doing it in the future. They then can't stop themselves because they haven't realized they are trying to stop themselves from doing something they enjoy. \n\nSmall example because my mum is a classic example of this, but she hate watches Trump videos constantly, and just gets really mad while also feeling satisfaction when something bad happens to him. This is a similar sort of situation because she constantly thinks \"I should stop watching these videos\" yet signs up for push notifications to every youtube channel and news site covering it. The reality is she enjoys the satisfaction and feeling of vengeance when someone she hates gets hurt, but hasn't realized in any way how her emotions are driving her to spend hours and hours looking at this stuff, which interferes with her other beliefs that she should have been productive during the day and now she's mad at herself for wasting her day.","timestamp":"2024-07-11T02:45:55.473000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1260434346683404408","message_id":"1260434346683404408","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]