[{"id":"1257968208770498742","channel_id":"1257422325754630255","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Basically there isn't an approach to resolution because there isn't a problem. If you need to do some thinking or gathering more information to make a practical decision, you do that as anyone would, but you don't get stuck in limbo between between two choices because you don't \"weigh two possible courses of action\" in imagination against each other, you are making an immediate choice of preference in the present. Essentially you don't really experience indecision, which is a particular attitude and response to having not yet made a decision that your ego/self-image has beliefs that you need to make. \n\nAs an example, if you are in a bad relationship because you know that you two aren't \"meant to be\" but you're feeling an uncomfortable sense of \"indecision\" that you haven't done anything yet that results in an urgency to come up with a solution but you're not exactly sure what, that phenomenon stops occurring. You would just think \"I don't want to be in a relationship with this person anymore, but it's a bit complicated breaking up with them right now, how and when would be an intelligent time/way to do that?\" There is no sense of indecision creating boredom, impatience, or urgency because not having made a decision yet isn't perceived as a problem.\n\nIt's a bit like if I flipped a coin in the air, if you had $1000 riding on heads, you might experience anxiety around \"what if it's tails???\" or excitement around \"omg what will I do if it's heads!\" causing emotional attachment or anticipation of one of those things becoming reality, whereas if there is no self-image then you just observe the fact, which is that nothing has happened yet because they haven't flipped the coin. Again, the problem isn't perceived so there isn't an effort to resolve something that isn't there.","timestamp":"2024-07-03T07:56:32.890000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1257651782100713472","channel_id":"1257422325754630255","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Indecision is a lack of certainty but without strong expectation of positive or negative outcome. It isn't exactly an emotion, in that what we call uncertainty is what people usually describe as the adrenal response or \"butterflies in your stomach\". \n\nAt a very low level of uncertainty but no positive or negative expected outcome you have boredom, more than that you have impatience, and the most extreme is urgency. All are feelings of \"I should do something\" up to \"fuck lets get on with it\" without necessarily entailing a positive or negative outcome or knowing what to do. \n\nIf it is resolved, it is seen as previously being a false perception of time, expectation, and being stuck between two or more possible outcomes. It's really a \"do I take left or right?\" and saying \"I literally don't know, but I need to figure it out first\". The realization is that there is nothing to figure out, in the same way someone might say \"jump into this portal to experience something new\". We aren't considering what's in the portal, we are weighing whether or not we want to risk the loss of what we currently have, which is not contemplating the fork in the road, it is contemplating our beliefs about our life as it is. \n\nIndecision is not really perceived at all if you examine it down to its roots, because, as it implies already, indecision is not knowing what you want to do. There are surface level versions of this like \"what do you really want?\" but also deeper elements like \"why do I experience wanting?\" \n\nThere is always still a sense of \"do I want fries or salad with my burger? hehe maybe I'll get the fries today\" and that is considered choice/decision like everyone experiences, but the emotional uncertainty around indecision completely ends because you no longer experience indecision as a crossroads when there is no available data. If someone says \"left or right\", you don't think \"50/50 I'm right\" you think \"I don't know\", so you can immediately make a decision.","timestamp":"2024-07-02T10:59:10.893000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"jamie0773"}]