[{"id":"1318509615041871892","channel_id":"1317997104865611877","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Previously the most success I've had is framing it as \"why does talk therapy work and what if you went further?\" and \"what actually is the resolution and point of meditation?\". If they are Religious it is \"what was the xyz famous Religious figure actually aware of that other people then wrote the book about?\" This only really works a little bit if the person is interested in those things in my experience and you usually just get them rattling off their own beliefs, but it is something.\n\nThis is very much my own view currently, and hopefully this changes over time with more cultural understanding and a more clear way to express it, but I would personally say that it is very much in the sort of \"don't talk about it unless they bring it up\" category. Or if it's really necessary and you want to try to help a close friend. It's also imo a \"secure your own mask before helping others\" type of thing. Even with the same realization I think the most harmful thing I've done way in the past was trying to tell people about it without really thinking through how to communicate it properly. The intention can be really good, but if the delivery isn't it can be harmful.\n\nThe only other avenue I think would make a lot of sense and is why I'm exploring it now is fundamentally asking someone, not why they have problems, or what the solution to problems are, but instead \"what do you think actually is perfect mental health? What state of being are you actively trying to accomplish every moment of your life?\" \n\nI think that framing is helpful because it cuts through academic or scientific belief directly because everyone intuitively knows that there is currently no exemplar of \"that's how a human being could be\" in terms of subjective psychological experience.","timestamp":"2024-12-17T09:26:28.950000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"694371572026179634","username":"bakewie","avatar":"36be20b242cb655e46dd0dc5593e2ab3","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1317997104865611877","message_id":"1317997104865611877","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]