[{"id":"1259780926016196640","channel_id":"1258851318710141079","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"In the context of that point in the essay, it was meant as a communication for the solution to the problem. Knowledge is redundant to know yourself because thinking is a subset of immediate experience and hence redundant. You never need to think about yourself because at every moment in time you are yourself. I can't directly describe what your conscious or my conscious experience is using thought or communication, it's just the best you can do to try to get someone to see it for themselves. When I say that your identity is the sensory perception you are experiencing right now, that is always true and always accurate, but not as the idea, but the actual thing. It is not your identity as in \"I will call that myself\" that is self-image. I mean the actual, literal phenomenon that it is. I can't describe exactly what you are consciously experiencing right now because it isn't happening to me, and I can't describe what is happening to me because you can only think about it, not experience it. \n\nThe criticism of using self-image as a pointer to a real thing is that it's not pointing to a real object, it's a hologram that modulates itself as an abstraction, there is nothing real in it, but it itself is real. If we want to be really semantic, then yes, all thoughts are pointers to other thoughts and don't contain any real objects at all. No thought contains any \"objects\" or \"content\", but in the same way the phrase \"look down\" might not contain any object other than thought, it can cause you to direct your attention in a new way.","timestamp":"2024-07-08T07:59:38.360000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"jamie0773"}]