[{"id":"1310499972441182269","channel_id":"1301324060617343107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You are correct. It is only impossible to create a mental model of yourself because whatever you are creating a model of is not yourself.\n\nIt is necessary to create a mental model of other people because you don't have their memories, but you don't need to create one of yourself because you have all your own memories already. You are taking the direct experience of your entire life (your memories) and using them to create a model of what you have already experienced.","timestamp":"2024-11-25T06:59:01.342000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"339877696957972491","username":"xav9999","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Xäv","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301324060617343107","message_id":"1308901388566139002","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":8,"userName":"jamie0773"},{"id":"1310499304133361724","channel_id":"1301324060617343107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"All anxiety and emotional relationship to thinking or dreams is caused by beliefs, the deepest rooted being the imagined identity of \"Me\" that is affected by all things. The root cause of all psychological problems are perceived to be \"the external issue that is affecting me\" but it's actually that there isn't an imagined \"Me\" that is being affected by what we think is happening. To clarify, there is still very much actual physical things happening that you might not enjoy, but *that* occurs in the present and all that ever needs to be interacted with. \n\nBeliefs cause thoughts and emotions to percolate on the surface as a result, but are caused by a much more deeply rooted structure (the \"knot\" I mention sometimes). \n\nYou can metaphorically imagine it as the roots of the tree attach to the actual \"Self\", then the trunk of the tree is the \"Self-image/self-knowledge/ego\", then the branches are \"beliefs\" and then the leaves are thoughts/emotions. The entire \"Tree\" is all composed of thoughts, but they have different interconnectedness and depth. For example, when we perceive something in thought that affects \"Me\", which is the trunk, then a number of our beliefs are triggered which results in a flood of thoughts and emotions. If just one belief is triggered, then a few thoughts and light level of emotion will be triggered. If you are literally just thinking about an easy math problem, then only the leaf of thought will activate and no emotion. \n\nWhile using the metaphor of \"uprooting a tree entirely\" makes it sound lofty, it's actually subtle when it happens, but when the tree literally gets removed like a weed, then you automatically do not process any of subsidiary parts. No anxiety, no triggered thoughts or beliefs, and no emotional relationship to dreams.","timestamp":"2024-11-25T06:56:22.005000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"469794118814531586","username":"kaankayhan","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaan Kayhan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301324060617343107","message_id":"1307830179455959060","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1307796785397366814","channel_id":"1301324060617343107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Both long term plans and short term plans are the same in that they are both thoughts that occur to you now. SR doesn't mean \"being incapable of thinking of the past and future\" it means realizing you never could in the first place. The actual thought might be the same, the interpreted significance is different. Practically the only major difference is that when you're planning to do something that will take up a lot of your attention for a significant while, you don't worry about making a mistake and dwell on that, you only weigh \"what do I want to do\" as a form of expression of preference. There is no anxiety or worry about making a wrong decision or wasting your time, only trying to figure out what you want to do and how to do it.","timestamp":"2024-11-17T19:57:31.328000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"185473441866973185","username":"vistascan","avatar":"a846f9a62d880bf9e69f286ffdcfc376","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"vistascan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301324060617343107","message_id":"1307780730151243848","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":4,"userName":"jamie0773"},{"id":"1307780109075484796","channel_id":"1301324060617343107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"The self appears to be in thought when our self-image/ego is an active part of our psychology because we haven't yet realized that it is unnecessary and in fact impossible to create a mental model of ourselves. When you are very, very young and learn the word \"Me\" we begin to accumulate and refine knowledge that we think is about ourself and mistake that knowledge of ourselves for our actual selves. This continues for most of us through our whole life as we try to refine that model to \"truly represent 'Me'\". \n\nIn a very brief nutshell, the reason the actual self is not *in* thought is because you can't simultaneously be thinking about yourself and be the one thinking unless you are two things. We all know that when we say \"I\" or \"Me\" we are referred to one solitary entity, we are just not sure what the entity is. When we say \"I am thinking about myself\" this seems possible, but it isn't. Self-inquiry is about questioning yourself and going into this contradiction and discovering why it it is the case.","timestamp":"2024-11-17T18:51:15.383000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"469794118814531586","username":"kaankayhan","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaan Kayhan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301324060617343107","message_id":"1306735316266254417","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"},{"id":"1306319344560509039","channel_id":"1301324060617343107","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I would think a bit more about why you consider the self to be thought, as that's the primary misunderstanding that needs to be resolved. \n\nYou can imagine your existence as a human being as fundamentally being the awareness and processing of present sensory information. The external environment is essentially a bunch of matter, your body is also a bunch of matter, and the moment to moment interaction between them is sensory perception and your awareness of that signal is your \"Self\". Your fundamental identity is essentially an information processor. Our different senses are how we perceive that \"information\". Touch is perceived differently from sound or vision, and thought is perceived differently as well. All are forms of a constant information stream we are always aware of (and are). \n\nSelf-inquiry is essentially recognizing the nature of this structure, which in and of itself is a form of \"organizing\" the information processor to process things more accurately. Sadness for example occurs like you've described it because there are deeply rooted beliefs about what you imagine yourself to be, and a sad thought is one that reminds us of something that has made it more difficult to achieve this. This is caused by a misunderstanding in thought about your actual nature, mistaking yourself for your imagination, and causing an automatic emotional reaction to threats to our self-image in thought. A thought can cause sadness because the object we think it is acting on is our self, which it isn't.\n\nIn your explicit pen question, the easy way to think of it just like virtual reality. If you pick up a coffee in a virtual reality game, who is actually picking up the coffee? Really it's not a complicated question, you would say \"I'm picking it up, but like, not literally me just my character that I'm controlling\". That's the general theme. \n\nIn a more literal sense in our reality, the *You*which is the conscious information processor is intelligently co-ordinating vision and touch, both sensory perceptions, in order to manipulate and move around other physical information (the pen).","timestamp":"2024-11-13T18:06:41.983000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"469794118814531586","username":"kaankayhan","avatar":null,"discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Kaan Kayhan","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1301324060617343107","message_id":"1301324060617343107","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]