[{"id":"1346058436068245546","channel_id":"1335329469358936064","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Not sure if this directly addresses where you're coming from, but I think it is a fair observation to be unsure of the origin of \"my subjective conscious experience\" that is separate from another. Why can I only move \"my\" arm and not another's? This is absolutely real and I don't have an answer to why there is relationship in our consciousness to our individuality. \n\nThe more important consideration is to address what we are psychologically referring to when we say \"my experience\" or \"my consciousness\". \n\nTo somewhat tie into your question, the idea of the \"soul\" has always been a western idea of our true identity. This addresses the consciousness that we experience that is in our body but not another's. There is nothing wrong or right about this observation, but what is more important is to observe that the \"idea\" of a soul that exists in our mind is not the real thing, and to observe that \"the real thing\" does not actually observationally exist. When people think \"when I die, does my soul go on?\", they aren't referring to actual personal conscious experience, they are referring to \"my memories and physical possessions\", which should be seen as obvious nonsense. This again brings rise to the question of what is the \"soul\" if it exists, and the more important reality, which isn't what it may or may nor be, but what beliefs has the individual invented for themselves about their life. \n\nThe piece that you're touching is that yes, there is actually no \"origin\" to our perception, consciousness, or ideas. Everything occurs to us as it is, and to recognize that your personal identity is fundamentally \"just happening\" and the entity we call \"Me\" who is influencing it is actually just a categorization of other automatic phenomena is what we're trying to become aware of.","timestamp":"2025-03-03T09:55:39.715000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1335329469358936064","message_id":"1335329469358936064","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]