[{"id":"1415215616993919157","channel_id":"1379429157666033735","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Maybe an in-between question to think about. If you were having a dream, and in the dream you were a frog, then I showed up with the barrett .50 cal and said \"if I aim this at you and pull the trigger, what will happen?\" Perceiving all of this as subjectively real, you would say\n\n> When I die my body will persist until it rots but it is no longer engaging in the physical processes that are required to be categorized as \"living\". I don't think I would exist. My experience wouldnt exist.\n\nInstead you wake up and you're a person.\n\nI'm only using this example to show that in the dream, everything you are saying makes sense as you experience it. You also think you're a frog. If you were asked in the dream, you would also say \n> \"Before I was born (or conceived) I would say I didn't exist\"\nWhen in reality you didn't exist as a frog like 25 minutes ago\n\nWhen you wake up, these beliefs about who you are and reality itself are basically resolved by saying \"whoops that wasn't me, I'm not a frog! I'm a people. Anyway, back to real life.\" \n\nThis is essentially a more complicated and visceral version of what I mean when I say there are no objects in thought, thought itself is the object. When you are in a dream, it is a single occurrence or \"object\", but it appears to you in the dream there are multiple objects interacting with each other and you have a past/future. \n\nThe point isn't trying to figure out if your dreams are real or if your waking state is real, but to realize that the part that is \"real\" is not in the objects or content of experience, but what is real *is* the experience exactly and only now as it is occurring. The content of thought, which is \"I have been a frog for like 7 years now\" is unreal, but the experience of thinking that is real. \n\nAbsolutely everything you call \"Me\" *other than that* is readily perceived as not you the moment you wake up out of frog world. We instantly accept this and move on with our lives. I am not suggesting that if you died IRL you would wake up to a new experience, what I am suggesting is that there is only one fundamentally \"real\" through-line through all life and experience, and from your perspective, that is the only thing that is \"real\".\n\nMight sound a bit esoteric, but the reason I say there is \"no difference between life or death, I experience what I experience\" I don't meant that there isn't a physical difference with regards to a living or dead organism or that I don't care if someone tried to shoot me, I just mean there is present experience and that's it, I and you are nothing else. It would be more accurate for me to say that's what life is, so I worded that pretty poorly.","timestamp":"2025-09-10T06:01:36.526000+00:00","edited_timestamp":"2025-09-10T06:08:43.768000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1379429157666033735","message_id":"1412580594453577890","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":26,"userName":"jamie0773"},{"id":"1405155254542270585","channel_id":"1379429157666033735","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"If you mean the world is made of matter/energy, etc then yeah I'm down with that and view the world that way. \n\nWhat I means is, I'd ask you to answer the question what were you before you were born? What will you be after you die?\n\nI imagine you would say \"I have no idea dude how could you know?\n\nThen I would ask \"ok, then what are you now?\"\n\nI think this is not only a difficult question, but I would say that not only would you struggle to answer the question, but then even after that, if you did come up with what you thought you were I would say \"and what are you when that ends?\"\n\nI hope this is difficult to contemplate because it is ultimately without resolution. \n\nThe *actual* resolution is through self-inquiry, which address the same questions but must be resolved by you.\n\nThe end result emotionally is that attitude of \"no difference between life or death, I experience what I experience\" and that is the end of emotional suffering with regards towards our beliefs.","timestamp":"2025-08-13T11:45:19.205000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1379429157666033735","message_id":"1398814032009625609","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":22,"userName":"jamie0773"},{"id":"1395845552825958490","channel_id":"1379429157666033735","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"From my point of view the realization that triggers everything to make sense is almost always rooted in either realizing that you can't/don't need to imagine the past, future, or yourself, or that your fundamental existence (Me) is not material ie. you are not the body, but you are the signal/perception being produced by the body. Very naturally you could imagine why this point of view results automatically in waking reality and dream states to not be perceived as two things that are in conflict with each other, but two parts of one reality which is just the signals being produced in the brain/awareness/conciousness.","timestamp":"2025-07-18T19:11:53.350000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1379429157666033735","message_id":"1385326563515564082","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1395844346863030466","channel_id":"1379429157666033735","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's not that when you're having a dream it is supposed to be recognized as \"my body is asleep and is now producing imagery and sensory experience that resembles the outside world, but it isn't, it's actually a bunch of neurons tricking me\" like a lucid dream or something like that. \n\nWhat I mean to look at is that when you're having a dream, most people interact with the scenery in the dream as if it's real life, react emotionally to it because they think their something is truly affecting their life, then when they wake up *instantly* the emotion and concern dissipates because it wasn't \"real\". \n\nIn a similar way it's common for people to look into dreams as a means of analyzing or learning something new about waking reality. If someone betrays you in a dream you might think it means something about them in real life. People also have premonitions or think they are seeing the past or future in dreams or travelling to another world. \n\nWhat needs to be identified is what they all have common in their root, which is your own presence and awareness of what is happening. Dreams are mysterious because we compare them to waking reality and say \"how do I make the reality in the dreams consistent with the actual reality?\" which is irreconcilable because we are mistaking the dreams for \"an external reality that my body is within\" and *also* mistaking waking reality for \"an external reality that my body is within\". You are *aware* of those things but you are not fundamentally an object in either.","timestamp":"2025-07-18T19:07:05.826000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1379429157666033735","message_id":"1385300429822365839","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1385161423042379828","channel_id":"1379429157666033735","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There is nothing wrong with the thoughtful observation that a sofa is behind you and lo and behold, when you turn around - there it is! etc. \n\nThat is fine and proper use of our thought. What I'm suggesting is more along the lines of asking yourself:\n\n\"Damn, I had a crazy dream last night where I saw my Dad, but he was like, my age, and then I asked him what advice he had for me and he said that I should do what I want to regardless of what other people think\"\n\nThe self-inquiry question isn't \"wow that's so cool and nice, what do you think my deeply rooted memories of Dad means that I can understand from this dream?\"\n\n the self-inquiry question is \"who were you actually talking to?\"","timestamp":"2025-06-19T07:36:58.308000+00:00","edited_timestamp":"2025-06-19T07:38:23.016000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1379429157666033735","message_id":"1379429157666033735","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]