[{"id":"1253076305377759346","channel_id":"1252634731250454538","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"There isn't a reason why for the reason Pikachu implied, but fundamentally the explanation for why I used to feel anxiety in that situation but don't now is because there used to be a subjective imagined perception of danger. Social anxiety is itself the belief there is potential danger to your self (image). If there is no self-image then you only feel fear when there is a danger to your actual, physical self meaning you would need to be physically threatened or in a precarious physical situation at that party for it to arise. In reality what that means is that at a party or social event you just don't perceive there to be any danger at all whereas in the past you would. \n\nSubjectively, you don't have a reason to *not* perceive danger. It's like how a flat tire indicator only goes on when there's a problem. Our self-image causes the indicator to go on when the tire isn't flat, and so what needs to be examined is the indicator not the tire. If they both work in tandem then it's just a very simple 1:1 on/off relationship with no complexity. If you're looking for how it is subjectively perceived differently at a party it's because everything occurring to you is simply *the fact*, and so if *the fact* is that everything seems fine to you, then there is nothing to worry about. I remember sort of experiencing anxiety as a feeling of \"well, things are going well *so far*\" or \"Hope I don't fuck things up tonight\" which are both anticipations of an imagined future outcome rather than a reaction to what is externally perceived. You can sort of think any time you are experiencing anxiety as \"I'm having a waking nightmare right now, there isn't actually a problem\"","timestamp":"2024-06-19T19:57:52.234000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"454699891529351168","username":"wtfaustin","avatar":"e315eb3bee21232da4ef31f5d8a3bc0f","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Austin","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1252634731250454538","message_id":"1252829677605617664","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]