[{"id":"1310504783190163456","channel_id":"1309072102627737633","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> What makes self-realization different from typical, often temporary, changes in perception, and why do psychedelics bring out the same, or highly similar changes in the mind, but only temporarily?\n\nListening to anyone else's psychedelic experiences or looking at my own in the past, they aren't really related to self-realization very closely because it's like drinking water from a fire-hose. I don't know what Capybara said, and I have my own explanation for how psychedelic experiences function from a sense-perception perspective, but they are so overwhelming initially that if you get lost in that it's like listening to a bunch of people's near-death experiences and you get lost in the \"woo\" of the whole thing. A huge part of psychedelic experiences (and NDE's) are related to beliefs and so the imagery and \"what you experienced\" is really unimportant compared to what you felt having the experience, which is usually love. \n\nSelf-realization in contrast to any sort of \"experience\" is that it is fundamentally a subtraction, not a new thing you add. It is the cessation of the psychological structure that you use to build beliefs about the world and yourself as it is fundamentally not necessary and accidentally invented. I don't mean \"opinions\", I mean emotional identification with thoughts. \n\nIt is very obvious that Santa Claus is not real, but we believed in him for a while as a kid. It is not so obvious that a particular Religious God is not real, but many people drop that belief. It is nearly unquestionable that \"Me\" exists, but that too is also a false belief. It is not that you don't exist and walk around and do stuff, but the invention of \"Me\" in thought does not exist and you cannot imagine yourself, although it seems completely possible to do so. The fundamental realization is that at a very young age we all invent an imaginary friend called \"Me\" we mistake for ourselves.\n\nThe \"permanent\" component of self-realization only exists because it is a psycho-physiological phenomenon. It is fairly subtle, but it is like popping a bubble or picking a berry from a bush in your own brain. It never comes back because it was falsely created and the connection is literally not there anymore. Because people get scared by the idea of your brain suddenly changing, it isn't physical, but electrical, and analogous to deleting an sd card's contents because you're like \"lol whoops already transferred those files\" or being like \"oh my game was so laggy because I launched the client twice, oops, better close that other one\".","timestamp":"2024-11-25T07:18:08.314000+00:00","edited_timestamp":"2024-11-25T07:21:51.426000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"185499839474171904","username":"nacho159","avatar":"4c34b7ff2c2a1d214c2948f0b531f404","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Aiden","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1309072102627737633","message_id":"1309072102627737633","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]