[{"id":"1415242338883862538","channel_id":"1413613305666474117","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I don't think I've ever suggested that conscious experience isn't the byproduct of physical reality and a lot of the sarcastic comments you bracketed might be common in the sort of \"spiritual\" community, but none of them are my own views in the way you are using them. Regardless, self-realization isn't a claim about the nature or cause of reality, it is about understanding and realizing the nature of what is real and fundamental in subjective experience, which is the \"Me\". \n\nYou are the physical organism/brain/nervous system in the sense that those things produce the senses and signal you are aware of and refer to as \"Me\", and the characteristics and properties of that \"Me\" are again generated by the machinery. This subjective awareness and what you call \"Me\" however is *not* the physical machinery. An example of this is when you are blackout drunk, which is when most of the machinery is running, but there is no experience of \"Me\" as consciousness/memory is not generated. It's really the same as a computer, in that the signal generated by the computer and pushed to the monitor is like consciousness. It's just that, like a computer, there would be no signal displayed if the monitor was hit by train, same with the processor or motherboard, but that doesn't mean the signal displayed on the monitor *is* the motherboard. It is also the case the whole computer might be able to take a lot of abuse and still pump out a decent signal, but if you just cut the DisplayPort cable the signal turns off but the monitor and computer are still running.  You aren't the monitor, you aren't the computer, you aren't the wire, you are the signal generated by the interaction of the physical system. This is why you can't \"shoot yourself in the consciousness\" because it doesn't physically exist, but you can shoot the machinery that produces different parts of consciousness. You can't shoot your world of warcraft character, you can only shoot the monitor.\n\nThis is a physical explanation of the root of \"there is no self\", but that's not really very important, as lots of people just latch onto that as a belief and start thinking they are the mystical energy you described. The actual root of \"there is no self\" is not about whether you physically do or do not have form, it is the result of realizing there is no direct \"source\" of experience. Consciousness or \"Me\" is essentially \"the awareness of other things\". Self-inquiry and self-realization is partially about seeing that you aren't the body in that it isn't literally the \"Me\" we refer to. This is obvious when we have a dream, and in that dream your teeth fall out or you get your arm chopped off, but when we wake up we realize that it *appeared* like something happened to our body, but it was just our imagination. Nevertheless, in a dream we are still \"Me\". \n\nWhen I talk about your brain being you, I usually mean it with regards to helping someone understand that all of your thoughts are generated instantaneously by existing hardware in its present state. Similar to when you access a photo on your hard drive, it doesn't matter when you put it on there, it isn't the past, it is the present state of the hard drive that creates that information. When you \"remember the past\" or \"imagine the future\" you aren't referencing alternate points of time of reality, you are thinking *in*reality right now. Thinking is a function of the computer that reconfigures memory into useful abstractions and then pushes it to consciousness to help you solve problems or communicate. Self-realization is to some degree realizing that all experience is just the computer generating a signal right now in the present, and past and future therefore don't exist and are never experienced.","timestamp":"2025-09-10T07:47:47.521000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1413613305666474117","message_id":"1413613305666474117","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]