[{"id":"1257613482677899325","channel_id":"1253901001107312742","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"______________________\nTo touch on the \"I am not the image of me, I am the actual me outside that abstraction\" I would emphasize again that this only exists in thought. I don't think this personally because its like hearing something and being like \"I am not the sound I am experiencing, I am the electrical impulse created by my own sense of hearing\". Like most people I just think \"yeah this song is pretty good\". In the same way there is no self-concept, you just think, you never think of yourself because you always automatically are aware you are the one thinking, there isn't the need for a double check. It is automatically self-evident you can't think of yourself because you're doing it. \n\nWith regards to the image of yourself, you're getting right to the sort of the mental knot, which is self-knowledge believes it can know who you are, and who you are is the entity who is utilizing self knowledge. It causes one to be embedded in the other recursively like the Yin-Yang symbol. The error is not recognizing, if you zoom out a little bit, that thought is part of physical reality, just like the signal being pushed to the monitor is part of physical reality. \n________________________\n\nThe whole thing can be scrutinized with the question \"The pandas are endangered, should we intervene with nature and save the pandas?\" Immediately people start thinking \"well, if they are a species that can barely survive themselves, maybe they are supposed to die off??\" Others think \"I like the pandas, we should try to save them! They are so cute :(\", others say \"if the only way to preserve them is to keep them in captivity that's no life at all\" and then someone will say \"what if we could change their environment to be better for them? Maybe just a breeding program could bring them back?\".  The question everyone always argues over is \"what is natural?\" \n\nThe very straightforward answer is realizing that you are nature. You're doing it. You're the pen doing the writing. Wanting to preserve the pandas because they are cute is nature. Letting them die because they are a weak ass species is also nature. Changing their environment because we can is also nature. Ego, like in the monitor example, is the belief that we have the capacity to grab reality, compress it into our minds, and abstract it to our will. This is not possible, all thoughts are *part* of reality in the same way all apperances on the monitors screen are the signal being produced by the computer.  All of Super Mario's dialogue *is* the video game it isn't him commenting on his experience of the video game.","timestamp":"2024-07-02T08:26:59.599000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":7,"userName":"jamie0773"},{"id":"1257608743466569749","channel_id":"1253901001107312742","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"So to start with I'd say the way I'd describe it is that self-image/ego is itself self-knowledge. We think one of the most valuable things we could do to improve our life is to have certainty around who/what we are so we can accurately model our lives and act according to that, so we constantly think and try to conceptualize ourselves. This is like creating a shadow that follows you everywhere, and for most people it never comes into question because it is essentially our effort to replicate our lives in thought, and so usually *seems* to track nearly identically to whatever is happen, just with some uncertainty. \n\nFor me the inquiry around this started only when I sort of felt there was basically an 'error' in the model. Won't go into details right now as I haven't really shared it much, but I had a particular experience that was roughly similar to a movie moment (not literally, just emotionally) that is analogous to the main character winning the lottery, has it stolen, and because they are now anchored to the life they thought they had, feels they have to get it back. Similar scenario is like the movies where a person wife/father/mother/son/daughter gets killed and they swear revenge. For me it fortunately wasn't a physically bad thing, just an ego bad thing, but the main thing I experienced was a sort of surreal \"huh, my mental model for my life is *stuck* at this level that I can't back. This doesn't make any sense. Like literally why do I think this???\" Which started me down the track. Not relevant really, but I grew up in Australia with my Mum until I was 12, then moved back to Canada with her because I wanted to spend more time with my Dad as well, but in hindsight I had a similar experience then because as a kid my brain was sort of deleting all the Australia connections and creating new Canada connections, and for a couple weeks I literally felt like waking experience was surreal/dreamlike. \n\nAnyway, from that place it becomes much easier to sort of observe an \"object\" that is your self-image/ego that was never obvious before. When we talk about self-image/ego here, I often say this but it's nearly impossible to understand the scope of right away, because while we intuitively get \"ok, so when I think I'm fat, skinny, hot, ugly, old, young, democrat, republican, that's my beliefs about myself, right?\" and it's like yeah, but then when people say \"ok, so then why is it my ego when I'm worried about the date I'm going on next week when that is actually something that is really happening that might affect my life?\" and the answer is \"because the future is your ego\". But that is not intuitive at all unless there is this sort of direct observation from particular experience that makes it obvious or really granular observation through analysis or some sort of dedicated inquiry.  \n\nFor me, having this \"object\" that ended up being a huge piece of my self-image being sort of just floating there as an anomaly made it easier to analyze, but largely you arrive at self-realization and the kind of expression I mentioned around the monitor/screen because you essentially explore all the possibilities you can conceptualize in thought, and still you haven't arrived at an answer, despite strongly intuiting there *must* be an answer. From that place it allows you to concretely say \"I must not be thinking about myself right at all, none of this can be correct\". The reason the monitor not being able to conceptualize itself because it is itself only seems like something hard to arrive at, accept, or understand because our self-image explicitly exists in opposition to that. If you believe that you can imagine yourself and your life, it is not possible to accept you can't think about yourself because that program is currently installed.","timestamp":"2024-07-02T08:08:09.683000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253901001107312742","message_id":"1257216586989830165","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":6,"userName":"jamie0773"},{"id":"1256442875198050334","channel_id":"1253901001107312742","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"You could say \"I exist\" , but the point is that the tv is not able to conceptualize that as an identity or an idea on the screen. This is what I mean by \"you exist, obviously, but you cannot think about yourself\". The TV cannot even say \"I am not the image of me, I am the actual me outside of that abstraction\" because that would be an image on the screen and just an abstraction. There is no conceptual way for the tv to think/display itself at all it can only exist as itself. It is not a matter of ceasing to identify as the tv screen or as a physical form, it is realizing you *are* that, you can't identify as it because all identifications are images/thoughts that appear on the screen.","timestamp":"2024-06-29T02:55:25.027000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"137219201852112897","username":"import_pickle","avatar":"004b086f58e6b3ff81732d29c7b73904","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Online Gambling Master","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253901001107312742","message_id":"1253901001107312742","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]