[{"id":"1415147960768925789","channel_id":"1410341704518602922","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It is inconsistent in the literal sense that it is not consistent lol. It is saying there are two realities, inner reality and outer reality, when the individual by their own description only experiences outer reality, but then later demotes part of it to a \"not real\" internal reality. Additionally, if someone were to ask you while you are in a dream \"do you experience inner reality?\" while you are inside the dream you would say \"yes, I experience inner reality when I go to sleep and dream\". This is would also be just incorrect as that cannot occur. \n\nThe resolution is in asking what *is* consistent regardless of state of consciousness. The issue is not in the direct labelling, but in how there is relationship to the belief about it. It's a similar thing to social anxiety. In that you can be super scared to go and talk to someone, then it goes well and you are like \"oh, nothing to worry about\". Believe it or not, this is the same thing physiologically as having a nightmare, waking up from the nightmare, and then saying \"phew, wasn't real\". The misunderstanding regarding social anxiety is that what we *believe* is occurring is that the girl/boy we want to talk to might reject or hurt us, we then interact with them and if it goes badly we say \"ah, I was correct in my worry\", if it goes well we think \"ah, I was incorrect in my worry\". Neither is correct as the anxiety occurs independent of the person's actions, as the anxiety occurs before the person does anything. \n\nWhat is actually occurring as you've probably heard me say before, is that when we are socially anxious, what we are worried about is the anticipation of an environment or events that may cause us to diminish what we think of ourselves. Someone might say \"no, I'm worried about embarrassing myself in front of all my friends and then no one invites me to anything again so I'd have no friends or ever get a date\". That isn't a real event currently, that is what you think you would think about yourself if something were to occur. If a bad event actually happens, you *then* respond to the bad event happening or not happening, but you are currently only concerned with the fear of thinking less of yourself. If this is analyzed all the way to the root, *all* social anxiety is the fear of thinking you're going to think less of yourself.  If this can be seen, the brain can realize that the only thing it has ever been anxious of is just itself, which isn't dangerous, and is the reason all social anxiety and nightmares can end permanently. It is again not obvious, but the reasons nightmares stop occurring is because the brain realizes dreams are itself, and essentially says \"oh fuck why do I keep scaring myself\". You don't realize you are *in* a dream necessarily, the dream occurs but without the capacity to scare you. The root of this as I've touched on before is realizing not that \"dreams aren't real\" like \"thoughts are real\", but that thoughts and dreams are real, but do not contain real objects. Your imagination is real, but what is in your imagination is not real.\n\nLooping back in to the original point, once again, the best example of something we think \"is sort of real\" is our past and future. Our past we consider \"real\" but not current. But if we remember wearing a certain outfit to a birthday party we say \"yeah that was real\" but then someone shows us a photo and we weren't wearing that outfit we say \"oops yeah guess that wasn't real\". We imagine a future outcome and if it doesn't happen we say \"oops not real\", but if it does we like to think our thoughts about the future were real. This is all reconciled not by figuring out everything that isn't real, but by determining exactly what is real, and by definition, everything else is not.","timestamp":"2025-09-10T01:32:46.025000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1410341704518602922","message_id":"1410341704518602922","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":29,"userName":"jamie0773"}]