[{"id":"1346066731050860575","channel_id":"1337165290466840586","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I think it's important to start from the place of \"I felt like these answers...\". \n\nThere are truly no answers that I mean to give or for anyone to receive. The root of what I'm encouraging anyone to look into is why we perceive \"answers\" or \"ideas\" that occur in relationship to our individual believes or perceptions. I'm essentially saying that many people will say \"Jamie said this but I disagree\" and I would say \"I didn't mean that at all\". What we don't recognize is that we are engaging with our own ideas and beliefs that are initiated or triggered by other people, but are still us engaging with our own mind. \n\nAs a small example, from my own experience, I used to worry about the idea of \"I have to give up my life as I know it to experience something hypothetically greater!\" I thought this was what J.K. or other speakers on this topic were saying to me, but this was a false perception of self-realization or any form of \"higher state\" that I had invented in my own mind and was perceiving in the other person.\n\nThe way you are worrying about losing empathy towards your wife's sadness is not something to be concerned about. The perspective of \"well, if I never feel sad, that means the sadness I feel when my wife is upset would end, and therefore I would no longer be able to empathize with her problems!\" This is backwards. What actually occurs is the ability to completely engage with her communication of her problems, you do not experience sadness, but are able to then engage intelligently with exactly where she is coming from. It might feel or seem noble to say \"when another is hurt, I feel that hurt\", but the notion \"I have to feel sad to be able to relate to someone who is sad\" is completely incorrect, and actually causes incorrect action and perception.\n\n It is *more* effectual to be unaffected emotionally by someone's sadness, but to so completely engage with it intelligently that instead of \"being sad with them\" you are able to address *directly* what they really mean to communicate. This doesn't mean the cliche of \"guys are trying to solve the problem while women just want to be heard\", that is extremely simplistic and unrelated. I am not suggesting this as a philosophy, I am suggesting it as my own personal change in experience, where I would previously put \"empathy\" on a pedestal because most people are quite selfish and looked only at themselves. In contrast, anyone who *seemed* to care about another must be highly emotional intelligent. This is only partial in that the highest form of genuine love for another is compassion, which is complete selflessness in order to alleviate their suffering. There is no need for personal suffering in order to be aware of the hurt another is communicating and to be able to address it. \n\n*What is stopping a perfectly mentally well person from not doing anything? If the state of existence is happy by default, why not happily die of thirst right where you are right now?*\n\nThe default state of human beings is contentment in the same way it is for any creature. You are perhaps assuming happiness is something to be achieved, and so are suggesting that if you are always happy, why do anything? The simple answer is that happiness is the default, but there is a higher state of emotional love that we are trying to experience. Escaping suffering is just part of the puzzle on the way there. There are also physical distress signals, which are genuine suffering/pain, and so we seek to alleviate pain, thirst, hunger, sex-drive, etc. Emotionally however there doesn't need to be any emotional relationship to our ideas or imagination.","timestamp":"2025-03-03T10:28:37.393000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1337165290466840586","message_id":"1337165290466840586","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":1,"userName":"jamie0773"}]