[{"id":"1296755923158831156","channel_id":"1295086403247411241","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"*That’s where I got confused because I am human and that is a fact, so I wasn’t sure what that meant.*\n\nThis is a part of our self-image and related directly the identification with self-knowledge. It is not at all a problem, just observe that it is the case. Consider this:\n\n2 + 2 = 4. That is a fact. But why? Because humans have agreed that it is a rule of this realm of knowledge. Then what is knowledge? Our human thoughts we generally agree upon and have in common as an abstraction of our shared experience. What is thought? You can look at that directly and check. That is the direction we are trying to move in and examine.\n\nIt is not necessary to dissect things like this, but look at your example of \"I am a human, this is a fact\". If you said \"I am a democrat, this a fact\" then they changed their policy or candidate and you said \"wow, I hate them now, I am a republican\". Were you actually ever a democrat? Are you now a republican? What are you actually, at its core? What is the source of identification? \n\nThese are all rhetorical and for you to consider if appropriate or not. \n\n*My brain basically says \"What you did three seconds ago was cringe, so that makes you cringe NOW\"*\n\nThe change in understanding that can occur and the relationship to be examined is not in the object of thought, which is \"yes, I obviously did something cringe, but *then* I must consider why does it still affect me??\" It is in examining what was harmed by the act that was performed that creates the perception of a mistake. Again, it is not scrutinizing the mistake or the response to the mistake in thought, but who or what was actually affected by the mistake  in the first place, which is \"Me\".","timestamp":"2024-10-18T08:45:04.641000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1295086403247411241","message_id":"1295843944227405824","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":3,"userName":"jamie0773"},{"id":"1295797450493136967","channel_id":"1295086403247411241","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"It's a very deeply rooted structure that constitutes our self-image or \"Me\", so don't feel like you need to or are likely to resolve everything immediately. There is nothing wrong with knowing things about how others perceive you like tall, short, smart, creative, etc. This can be useful when it comes to finding your talents or jobs, etc. The root of what is being addressed is that we have psychological and emotional attachment to our perceived self-identity. If we think we are smart, and someone says we are dumb, then we feel hurt. If we think we are a Democrat and someone says \"I hate democrats!\" then we think \"hey fuck you\" because we think they are talking about us. This is the part that is unnecessary and at its core is the source of all psychological neuroticism and suffering. You don't suddenly become unable to \"think about yourself\" or use knowledge, you just realize what you are thinking about was never actually you. In very brief, it usually takes a lot of looking into, but self-realization is the cessation of an imaginary friend we believe is us called \"Me\". \n\nIf you are interested in examining further the most important part is to look in your own experience and see directly what is being pointed to and create an understanding of your own internal conscious experience. The direct question of \"What am I?\" or \"What is 'Me'?\" that you have always experienced your whole life is the primary and only real question, and what you are looking for is to answer that question. Not in a way that I or anyone else will say \"yes, correct, 10/10\" because that is just searching for the words, but as an actual \"Oh, *that* is what 'Me' is\". Which causes the cessation of using a self-concept to model our life as it's not necessary.","timestamp":"2024-10-15T17:16:26.950000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"867406560379404329","username":"mrstupid321","avatar":"ba4adb1ce013487687d3271d83e88604","discriminator":"0","public_flags":128,"flags":128,"banner":null,"accent_color":null,"global_name":"MrStupid","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1295086403247411241","message_id":"1295086403247411241","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]