[{"id":"1253880605758849045","channel_id":"1253651771457536094","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"Right, it's not possible for me either to tell if I'm in a dream when I'm in a dream unless it's a lucid dream or some sort of self-aware unusual dream-experience. \n\nThey key point to recognize is that self-realization is phenomenological and results in automatic change in experience. There is no effort or trying to do something. The main feature of this is not having emotional relationship to self-imagination. This is physiological, not \"oh, I now have the ability to recognize when I'm dreaming, and because I don't think dreams are real that means that I shouldn't be scared\". There is, very simply, no emotional relationship to self-imagination, and dreams are self-imagination. This results in what appears to be two things, but it's really one: you don't experience any 'bad' dreams and you don't experience any emotional relationship to dreams. You completely stop having scary, dangerous, or embarrassing dreams, but even if you did, there is no emotional relationship to them.\n\nFundamentally the instrument of \"dreaming\" is the same base instrument as thought, which is our memory. If there is a physiological change that results in memory no longer having any emotional affect, then it is *not possible* for dreams to cause emotional response. It doesn't matter what happens in the dream nothing can hurt you. If, hypothetically, and this has happened to me maybe once or twice in that last few years, is you might have a dream where you get physically hit or shocked. In both examples, you get hit, but there is no pain (I think most people have experienced variations of this), and if you are shocked, there is surprise, but then no fear arises at all. Usually in these very rare circumstances you immediately realize you must be dreaming to not have experienced anything, and so wake up shortly after.\n\nTo be super specific, if I were to see a crocodile suddenly in real life, presumably I would be scared. If I were to see a crocodile in a dream, I would have the same 'surprise' but there would be no emotional response at all, and then I would likely immediately realize it was a dream, because there was no fear, and so I must be thinking/dreaming. I rarely have lucid dreams now interestingly, but part of it is that it's not just that there is never any emotional quality to dreams, it *also* means there are no bad dreams in terms of experienced images, because the emotions and images are the same thing. I've said before that thoughts/feelings are paired and are the leaves on the branches of beliefs. Beliefs are the branches on the trunk on self-image, and self-image is the trunk on the roots of \"Me\". Dreams cut all the way down to the \"Me\", but have altered effect depending on what has been resolved.","timestamp":"2024-06-22T01:13:52.388000+00:00","edited_timestamp":"2024-06-22T01:19:23.044000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1253651771457536094","message_id":"1253651771457536094","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]