[{"id":"1367906173969498234","channel_id":"1363838732243046400","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'm sure there could be a means of developing a sort of \"self-inquiry course\" that is objectively more effective than just winging it, as that is essentially what meditation originally was, but the problem is exactly the same as in talk-therapy, which is that you can't help someone who doesn't want to help themselves, you can just provide encouragement and information to people who are already moving in that direction and are suspicious that their own model of their life is harmful in some way. \n\nThe main issue is that if I were to talk to anyone, the intention is to lead them to a state of questioning and realizing that their own beliefs are subjectively generated and not objectively \"true\", as they think they are. This automatically and physiologically will end emotional relationship to any beliefs if it is genuine. The problem with this is that \"progression\" only occurs at the exact capacity they currently have to diminish or lose their own views. \n\nAs an example, my mum absolutely despises Donald Trump to the point of anyone even saying his name is like Voldemort. If I were to say \"do you think that 50% of Americans are idiots, or maybe at least some of them are intelligent and you might not understand their perspective?\" she would say \"Jamie, it's pretty obvious that half of America are just complete morons\". We don't even live in the US and she knows basically nothing about our own federal politics that would actually affect her life more, but in this case, the \"therapy\" or \"inquiry\" ends because the person does not want to engage with further communication or analysis of their own perspective. My objective is only to bring awareness to how her subjective beliefs are generated, but she interprets my pushback as \"oh, you are saying *this other set of beliefs* is correct?\" which is also not what I'm saying, but if someone views \"I don't believe in Heaven\" as \"oh, so you believe in Hell?\" then it should be immediately obvious that it doesn't matter what the therapist or guru is trying to say, it is entirely what the person they are addressing believes and the only next step is how you best interact with them from where *they* are if it is 1 on 1 approach.","timestamp":"2025-05-02T16:50:46.342000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352131792188473344","username":"pikachu_is_boss","avatar":"f62cee7117de3ae53a0b085853bf7073","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Pikachu","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1363838732243046400","message_id":"1363838732243046400","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":0,"userName":"jamie0773"}]