[{"id":"1318507030729719861","channel_id":"1317384636120436779","author":{"id":"414288504550588438","username":"jamie0773","avatar":"883e1b28bd08036a951bf1bedd781e87","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Jamie","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I'll say directly that there is no need to be anxious/fearful at all unless there is perception of imminent physical danger. This *doesn't* mean that the idea of carrying a firearm or training yourself for combat or whatever isn't intelligent (or unintelligent) depending on where you live and what your environment is. \n\nTo your point about relationship to the body - all psychological identifications with \"Me\" are all deeply interwoven and so can't be categorized and separated that easily. Some people don't care at all about their weight or looks, but are deeply fearful of someone else physically dying. Some people don't care about their own death, but deeply care about how their death will affect others. Some people through their own insecurity will literally die to have a certain body type, and some people will only date exactly a certain person who looks a certain way. All of these are psychological identifications (some ego, some natural) to \"body\" and so it is very complex and not just \"my body\".  \n\nSeparate again, and going back to exaggerated beliefs - but for example: it can be a doomsday, prepper, paranoid belief to build a bomb shelter in your backyard for a coming world war 3, but it is also something nearly all mega billionaires have purchased in Switzerland. The difference is that if you've built it in your back yard and you are not that wealthy, it is almost always because you are neurotic and fearful, and so 50% or more of your daily emotions and thought are going towards it. It isn't crazy for a billionaire to do it because they could legitimately become international targets and it costs them 0.02% of their net worth and no time at all. The difference isn't the intellectual worry, but the emotional concern that shapes the behaviour and thought pattern. \n\nWhat I'm really suggesting is that you likely think \"well, some of this is rational, and some of it isn't\". It seems like there is probably a rational continuum, but if there was no \"body anxiety\" then you'd probably be surprised at how little protection you need at any time, and if you are in a somewhat dangerous place, then the stuff that you do need to do would be really obvious and not a cause of anxiety. The main point isn't to change the behaviour, keep doing what you think is intelligent, but in the meantime examine the beliefs that create the perceived threat and see where that leads you.","timestamp":"2024-12-17T09:16:12.802000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"694371572026179634","username":"bakewie","avatar":"36be20b242cb655e46dd0dc5593e2ab3","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":null,"avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1317384636120436779","message_id":"1317384636120436779","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":2,"userName":"jamie0773"}]