[{"id":"1312527066394136619","channel_id":"1311796230137057431","author":{"id":"381561618833604610","username":"holos","avatar":"53e8b71a9a907739498059917ef9a290","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"holos","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"> I know I exist because I can think about myself and feel my emotions.\n\nThis exact conclusion, how did you get to it? Can you know you exist because of some thought about \"myself\" and \"feel my emotions\". Who exactly is this \"I\" that exists? You say it's because of some thoughts and feelings you have but is that true? What is the thought doing exactly? Look at the thought, see what it is and the structure of it. Thought is a divisory experience. Just look at any thought right now whether it's a description or a label. \"Pink Elephants\" are a rage here so just think of a \"Pink Elephant\". You've never seen one but you're thinking of one now. What is that thought right there, it's simply a division of the color pink and an animal thus some imagined object. Do you have to \"know you exist\" or \"feel emotions\" at all to think of any of this? What does thinking of yourself even do?\n\n> I can ask myself questions like: \"Am I the body?\", \"Am I an American\", etc. But the answer to those questions are obviously no\n\nso you say that the answer to those are obviously no, but why are they obvious? You say \"I have a strong sense that the self is real\", but again these are simply assumptions and there's no groundwork other than just a belief or suspicion because it's still assuming the \"I\" that has a strong sense. If you are not those things like the body, or the mind, or your thoughts, then what exactly are you? \n\n> I have a hard time to keep the inquiry going.\n\nInquiry is simply looking through the cave, inspecting who the \"I\" is and the beliefs involved which construct the cave itself. Asking questions outside of yourself simply keeps the recursive nature of seeking relief from an external source. Where is the external source you're hoping to save you? You are completely alone, there is nobody that will answer these questions of thought other than yourself.","timestamp":"2024-11-30T21:13:58.202000+00:00","edited_timestamp":"2024-11-30T23:25:51.234000+00:00","tts":false,"mention_everyone":false,"mentions":[{"id":"589819099090255894","username":"cyu3281","avatar":"adeb6222dd06ae9c5fefa05b91054d97","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Steam","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1311796230137057431","message_id":"1312224947128504411","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":49,"userName":"holos"},{"id":"1312112338144596030","channel_id":"1311796230137057431","author":{"id":"381561618833604610","username":"holos","avatar":"53e8b71a9a907739498059917ef9a290","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"holos","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"the core is why do you think it's a belief at all? Is it because someone told you it's a belief? How is that belief constructed in the first place? \n\n\"How could i have a belief about something without even knowing what it is?\" - that is the very core of beliefs. Beliefs are something not experienced in that you just have a conceptual framework but you attach onto that concept and believe it to be true or exist.\n\nRight now you have a belief, whether it's from this discord or somewhere else, that some belief you hold is fake. But a belief doesn't negate another belief. It just perpetuates confusion. The thing is that belief you hold has never been investigated thoroughly, you can't say the monster in the closet is fake or real without investigating the closet. The investigation of what's there in the closet has to take place, if I tell you \"oh the closet is fine\" but there's still noises there the natural instinct will be to investigate.\n\nIf there is a belief in God or some personality that you hold closely like \"I'm a programmer, I'm an American, I'm a Christian\", there is always this \"I\" that's in the beginning of every thought there. You say \"I am the one who is defining what it is I believe in\" but is that necessarily true? Who is the one defining what?","timestamp":"2024-11-29T17:45:59.282000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"589819099090255894","username":"cyu3281","avatar":"adeb6222dd06ae9c5fefa05b91054d97","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Steam","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1311796230137057431","message_id":"1312109472671338537","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":18,"userName":"holos"},{"id":"1312092870290964501","channel_id":"1311796230137057431","author":{"id":"381561618833604610","username":"holos","avatar":"53e8b71a9a907739498059917ef9a290","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"holos","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"I’ve never really approached it that the “self” is false in any way. It’s moreso uncovering what **exactly** is the “I” that is being referred to? Is it the body, is it the brain? Is it a personality that is being identified with? I’ve never approached a math theorem to try to disprove it, you first understand what the theorem states and what it’s about. You walk through the various steps and just see the entire theorem for what it is.\n\nOne aspect of unfolding this is certainly time. From the moment you were born what was there at that moment. you can look at now and see what’s here at this moment. You will simply have to look at your experience and see for yourself what is there. \n\nCurrently you are looking to disprove Santa without really seeing Santa at all. It’s like if I came to you as a kid and said “Santa is fake” and you grew up in a remote tribe in rural Kenya. You would first ask “What is a Santa”. Why do you think Santa would be fake without ever knowing the concept of Santa.","timestamp":"2024-11-29T16:28:37.784000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"589819099090255894","username":"cyu3281","avatar":"adeb6222dd06ae9c5fefa05b91054d97","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Steam","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null}],"attachments":[],"embeds":[],"pinned":false,"type":19,"message_reference":{"type":0,"channel_id":"1311796230137057431","message_id":"1311796230137057431","guild_id":"1129343306485215342"},"flags":0,"components":[],"position":16,"userName":"holos"}]