[{"id":"1304523124947157134","channel_id":"1304492105632059465","author":{"id":"381561618833604610","username":"holos","avatar":"53e8b71a9a907739498059917ef9a290","discriminator":"0","public_flags":64,"flags":64,"banner":null,"accent_color":null,"global_name":"holos","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":null,"primary_guild":null},"content":"fun question. I don't know how utility is prescribed here or emotions you \"should\" feel, an emotion is simply felt now, i don't see how emotions \"should\" feel. If a girl you're interested in says that she doesn't like skinny guys then that's the desire at play, and that's fine i don't see a problem here. If she doesn't like skinny then what type of skinny or how skinny? There's levels to skinniness and if she says she doesn't like the way your specific body looks then that's the preference. It's nothing more than deciding to eat waffles vs pancakes, you just want waffles now, that's simply the desire.\n\nA spot of inquiry would be why is there a let down at all? Descriptions of anything require division to describe them, so if the body is skinny then that's the division, it's the same thing as describing a printer as black or apple as red. These are simply descriptions given.\n\nDescriptions given to the body seem different than the emotional attachment to the body, because the attachment comes to light through the emotion. If a very attractive person dismisses or actively points out your body is disgusting there could be a reflex or emotion that results from this. Whether you are skinny or not that's simply a description, the attachment to the description is what creates the conflict. \n\n\"How isn't self knowledge about self\" - what does knowledge even do? knowledge is dividing, just constantly dividing. Sight is seen, then division takes place in the mind.  Can you see the seeing? The division of some \"you\" in the mind and the \"seeing\" is the division taking place. So in this way what are you trying to symbolize? What concept is being extracted or do you want to extract?","timestamp":"2024-11-08T19:09:09.855000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"position":1,"userName":"holos"}]