{
  "people": [
    "Jamie",
    "Capy",
    "will",
    "holos",
    "Gabriel",
    "Ender"
  ],
  "terms": [
    {
      "id": "belief",
      "name": "Belief",
      "definitions": {
        "Ender": "A truth claim about the world which one believes to be true.",
        "Jamie": "An idea or thought that a person has emotional relationship to when it is thought or challenged. Not necessarily a truth claim, faith is also a belief.\n\n(B)elief: the emotional attachment to an idea. (b)elief: an opinion. I don't use capital B, but every time I say \"belief\" I mean the former. I am always referring to an emotional attachment to an idea. If I mean \"an idea\" or \"a thought\" I just say \"here's my opinion\" and will not use the word belief.",
        "Capy": "Beliefs don't exist by definition, so you can't find them anywhere in experience.\n\nBeliefs are concepts that aren't experienced, just like the concepts of 'tomorrow' or 'non-existence'. The function of thinking allows you to think of things that you don't experience.\n\nYou can't believe in something you're experiencing, otherwise it's a fact. A belief makes up for lack of experience.",
        "holos": "The whole structure of a belief is that the emotional attachment supplants the actual reality. The point of believing in Santa means Santa is not experienced, if Santa was experienced what need is there for the belief.\n\nThere are thoughts and there are beliefs, beliefs are not experienced. They are like a transplanted reality that is inferred. Santa was never experienced, there were simply references surrounding Santa that implied him to be a reality.\n\nBeliefs are something not experienced in that you just have a conceptual framework but you attach onto that concept and believe it to be true or exist.",
        "will": "A belief is something that one holds and considers to be true. It requires holding because it is not a fact. 'I believe in god' requires believing.\n\nA belief requires holding for it to be maintained, because what you believe is not a fact that can be independently verified through experience.\n\nIf there is a belief it will trigger emotion, if there is emotion there is a belief present. If we identify ourselves with the belief 'I am smart' then another thought eroding that belief makes us feel that who we literally are is being attacked."
      }
    },
    {
      "id": "facts",
      "name": "Facts",
      "definitions": {
        "Ender": "A truth claim which accurately describes sense perception, both in the content and the literal relationship between thoughts and the 5 main senses.",
        "Jamie": "The notion of 'accepting the fact' simply means that reality itself only has one state. That state is what you see when you open your eyes or think a thought and it streams into your consciousness right now. That is all that reality is.\n\nIt's not about being convinced, like in an argument or belief, it's about seeing for a fact what actually is the only thing you can really be 100% about and no one else can, which is 'you exist right? What is that experience?'.",
        "Capy": "Your direct experience is just a FACT.\n\nFeelings don't fool you. They don't say 'I'm located in tomorrow' or whatever. They're always felt now and they're entirely non-conceptual.\n\nUse sensation and feeling to ground yourself in what is current and actual. Those feelings are facts, they are non-conceptual and self-evident and currently occurring.",
        "holos": "It is sensory perception and it's all you experience all the time, there is no isolation of \"my senses\". There is no ownership of the senses.\n\nIf you are seeing now, you are thinking now, you are hearing now and we know there is no other time that all of this is occurring. When you were born it was now, when you die it will be now.",
        "will": "A fact does not need to be believed for it to be true. We don't believe in the sun, it is there regardless of whether or not we believe in it. A fact doesn't demand belief.\n\nThe actual fact of life hasn't changed, it's the perception. Thought can never modify fact, it seems to only ever conceal or misdirect.\n\nIt's hard to recognise a fact when you're fighting tooth and nail to avoid it. If you're really honest with yourself, you don't want to look at your life because it doesn't make you feel good. It's also hard to look at a fact when you are trying to become something contrary to it."
      }
    },
    {
      "id": "knowledge",
      "name": "Knowledge",
      "definitions": {
        "Ender": "Memory (which makes \"self-knowledge\" \"self-memory\", which is an oxymoron).",
        "Jamie": "Self-image, ego, or self-knowledge is the entirety of all the beliefs we have created about ourselves and the world that we have emotional relationship towards. Self-realization is the insight that causes all of those beliefs to stop operating as they are seen as unnecessary errors in our understanding of ourselves.\n\nIn epistemology right away they teach you that the study of knowledge is essentially an abstract representation of the world. The real juice is seeing 'oh, knowledge isn't an abstract representation of the world, knowledge is thought, and when thought itself is experienced it is a piece of the world, it isn't separate from it'.",
        "Capy": "Practically, it's whatever you're thinking. Knowledge is what we categorize as thinking.\n\nYou don't go to the past for knowledge, you recall it presently. You don't go to the future for knowledge, you haven't experienced it yet. It's always just a present recollection.\n\nThere isn't a self which has knowledge about itself, it's a recursion which is a belief. The desire to grasp for self-knowledge is an error in your cognition which occurs because you believe there is knowledge about yourself located in past and future.\n\nNot knowing is completely unlimited. Knowing is subtle limitation.",
        "holos": "What does knowledge even do? Knowledge is dividing, just constantly dividing. Sight is seen, then division takes place in the mind. Can you see the seeing? The division of some \"you\" in the mind and the \"seeing\" is the division taking place.\n\nYou only know what you know right now, so what is there left to look and what will you derive when you get it?",
        "will": "Knowledge is entirely based on the past and holds no intelligence. Knowledge must include its own limitation if it's to work in the present.\n\nThought is limited because it is based on knowledge that I have acquired through my life, and my knowledge is never complete. Therefore thought will always be limited.\n\nKnowledge is all well and good, it's just self knowledge is unnecessary. A conclusion is a dead thing, it is an accumulation of information that may or may not have been accurate in a particular context. Conclusions block one from continuing to investigate."
      }
    },
    {
      "id": "self-image",
      "name": "Self Image",
      "definitions": {
        "Ender": "What one believes oneself to be, which are inherently emotional due to the nature of self-belief.",
        "Jamie": "Self-image is recursive. You, in thought, are concerned with imagined events that might harm 'Me'. You then try to make a life that is better for 'Me'. Everything that anyone does or says to you is filtered through the lens of 'is this good for Me?' The recursion is there is constant thought about 'me' when the entity doing the thinking and intuiting is already 'Me'. 'Me' is thinking about 'Me' constantly in our lives.\n\nIn its purest form, the self-image/ego itself is the desire to be loved, while the genuine and only function of natural human experience is to love. More specifically, self-image or ego is not even the desire to be loved, as it is not possible to know if another has love for you, it is actually the psychological effort to love your own imagination of yourself.",
        "Capy": "Self-image is the result of a belief that you can imagine yourself, which indirectly manifests as negative emotional reactions to thoughts about yourself. 'Yourself' being the descriptions and characteristics you call upon whenever you try to think of what you are.\n\nYou can't really know what self-image is, because it's a belief. It's made out of nothing. It's not there. Self-image is what you think about yourself that doesn't actually exist.\n\nEvery instance of self-image is a recursion. It is creating two of you. This is also referred to as the subject-object relationship. This is fundamentally the idea that it requires two things to perceive something. A thinker and a thought, an experiencer and an experience, a perceiver and perception.\n\nThe self-image is all about modifying yourself and second-guessing what you are.",
        "holos": "Your self-image is not you just as the word is not the thing, it will never be you. Any thought given to that self-image is just thinking of that self-image, constantly perpetuating it but never truly arriving at what the self actually is. Just like a painting of the landscape is never the landscape. The painting is just the painting, the landscape is just the landscape.\n\nRefining is just thinking a new thought to \"fix\" that previously stored image of \"you\" which is just your \"imagined self image\", which is just that, an imaginary image of your self which is not actually yourself.",
        "will": "The 'me' is essentially the accumulation of beliefs I carry about myself and the wider world. If those beliefs have never been investigated or challenged, my sense of self goes unchallenged.\n\nSelf image is a set of beliefs held about yourself that is assumed to be fundamentally true. This may include perceived positive and negative attributes that you believe constitute your sense of self.\n\nWhen we get flattered or insulted, we retain it in memory and then say this is me. So all the accumulated prides and fears we remember, we call me. And so we are always self conscious, even if it isn't a negative feeling, because we are always bringing in our achievements and perceived failures to whatever we engage with.\n\nAny effort to change what I am into something else is a movement of the self-image."
      }
    },
    {
      "id": "sensory-perception",
      "name": "Sensory Perception",
      "definitions": {
        "Ender": "Conscious experience occurring now.",
        "Jamie": "Characteristically distinct forms of awareness linked to the apparatus of the human body (sight/eyes, hearing/ears, etc.). Conscious experience is the moment to moment awareness of sensory perception.\n\nYour fundamental identity is the current sensory experience you are aware of (you literally are the sense perception). In the case of thought, when you hear a bird chirping, there is instantaneous awareness of not only the sound, but the direction it is coming from, the proximity to you, and what type of bird it is. All of this is the simultaneous amalgamation of your sense perceptions and the knowledge of them you have previously accumulated acting in unison.\n\nWhen you use any of your senses except thinking they all exist only in the present moment when you are experiencing them. When you see something it is always 'Now', when you hear something it is always 'Now'. This is the same for all senses except thought. We know that thinking occurs now, but believe it can be 'about' the past or future. This is because thinking is created through the intelligent manipulation of memory, which is previously experienced sensory perception. This creates the illusion of past memory, duration and time in our thoughts that does not actually exist other than as present experience.",
        "Capy": "Just what is, 'existence.'\n\nAll 'things' are symbols of experience created in thinking, but those symbols are also experienced. Not a single thing you can think of is left out of experience, because you're experiencing thinking it. Thus there is no such thing as dividing experience into objects, as there is nothing in experience which can divide experience since it would also have to be experienced.",
        "holos": "Sensory experience arises now through things like sight, smell, sound but the interpretation of the sensory experience occurs in thought. Consciousness is simply the totality of occurrence or experience now, it's not this magical thing stored in the brain. Thus consciousness is simply another word for \"what is happening now\". We experience now through sensory experience.\n\nYou are think-ing, you are see-ing, these are the perceptions and they are here right now.",
        "will": "You only ever experience that and that only ever occurs now. You can imagine the grandest reward or the most harrowing punishment but the idea of them only occurs now. Even if thought claims it is 'outside your current experience' the physical manifestation of it occurs currently.\n\nThinking is precisely the same as any other sensory perception. Seeing and tasting are natural functions of being a human, thought too is a natural function... except for some reason we don't interpret taste but we do interpret thinking.\n\nExamination is a different process to thinking, it's about genuinely looking in your own experience. You can think about the colour red all you want, but until you actually look at the genuine article there's no amount of thought that will reach the same depth as experience."
      }
    },
    {
      "id": "past",
      "name": "Past",
      "definitions": {
        "Ender": "Events which happened previously, but only are subjectively experienced as a thought now (never truly experienced).",
        "Jamie": "What we call the past is the memory of something that occurred to us in the present and we have recorded that in our brain and can continue to access that perception as thought. If you have a photo that you uploaded to your pc hard drive, it may say 'uploaded 1/4/2017' but that is an illusion because when you uploaded the photo it was 'now', when you're viewing the photo is 'now' and to the computer, it has no concept of time, it just has a bunch of data that currently exists on the hard drive as it currently is.\n\nMemory exists only in the present and does not relate to either past or future. Memory is like storage, it isn't related to past or future, it is only a reservoir of salient experience to be accessed by thought.\n\nYou can't 'experience the past' what is happening is you are imagining something in the present and emotionally reacting to that image because you believe that you are imagining 'Me'.",
        "Capy": "The memory is now. 'Not now' are unicorns.\n\nMemory is not what happened, it is just memory, only memory is happening. The event happened, but your memory is not what happened. You're not remembering what you saw, you're just remembering, period.\n\nThe you that exists in the present cannot be something that 'was experiencing', that is the past. There is only you in the present, and the present has memory of what happened.\n\nMuch of self-image consists of 'afterthoughts' on behalf of someone in the past that doesn't exist. Literally second-guessing yourself.",
        "holos": "We currently think of the past as something cemented such as an event that happened. But the past is simply a thought you're thinking of now. It's not cemented in stone, it's a thought.\n\nThe past is created now by thinking of it. We live in a reality where we can only recall, we cannot do anything other than recall, but that recall is a limited interpretation of the experience. It's not cemented and it doesn't exist outside the interpretation.",
        "will": "Thought cannot see things as they are, it can only see a version of events that it has put together using the past.\n\nThe self-image is a picture put together by the brain using the past and beliefs about the future. The entity itself is fallacious because it is just the gathering of the past, and not what is currently taking place.\n\nThe remembrance of someone else hurting you, is not the same as what they are presently communicating toward you. Thought has records of physical events happening, but once we confuse them with our current reality then we're lost."
      }
    },
    {
      "id": "future",
      "name": "Future",
      "definitions": {
        "Ender": "Events which are expected to happen, but are only subjectively experienced as a thought now (never truly experienced).",
        "Jamie": "It's not that you can't accurately imagine the future, it's that the future does not exist, so you can't imagine it. What you are imagining is not the future, it is an image being created in thought in the present.\n\nThe misunderstanding causing ambition is that you are not contemplating the future or an altered state of reality, you are creating an image in present thought and mistaking it for an altered reality that currently doesn't exist. Your thoughts are real and do exist, but they are part of the present, they are not something you can move towards or away from.",
        "Capy": "The future is a thought just like 'sleep'. Thinking about sleep isn't the experience of sleep. Thinking of the future isn't the experience of a future.\n\nPast and future are like scaffoldings which always must be built on top of now. There is no such thing as a past while being in a past, or a future while being in a future. All concepts of time must be relative to now.\n\nIf you believe someone took something that was yours, then there's an emotional response because of your apparent relationship with that concept. But 'tomorrow' can't cause emotions, because emotions happen now.",
        "holos": "The future is a thought, that's all it is. We reference the thought as \"future\" when it's a thought occurring here. That's all the future is. When the \"future\" arrives it is now.\n\nYou don't live in the future, you conceptualize some idea of a narrow concept now. Any \"future\" that is perceived is simply an isolation of experience, it's an event that can be planned for using the mind to predict certain things. Nobody is denying the ability to think and predict, the only thing being conveyed is that the prediction is now for an event that will also be now.",
        "will": "The ability to think IN the future doesn't exist. You can't think in a dimension that doesn't exist. What we perceive is happening is 'I'm thinking about myself in the future who is thinking' but it's actually just the sensory perception of thought occurring now. It is quite literally impossible to 'think in the future.'\n\nThought is the only sensory perception that pretends that it can occur in the past or future. But it only has one trick, which is it occurring RIGHT NOW.\n\nPeople care about the next life because they aren't living right now. Figure out what you are now, then you'll understand the whole movement of life and therefore won't need to worry about a future continuity."
      }
    },
    {
      "id": "reality",
      "name": "Reality",
      "definitions": {
        "Ender": "The existence of sensory perception (this is a panpsychist worldview, Jamie might say \"physical reality\").",
        "Jamie": "I currently do not see a reason why the world cannot be a fact/object/space that gives rise to conscious experience as an emergent property. I roughly see it as a self-organizing information system and certain emergent permutations of that information has created a 'perceived' reality to that particular structure/function in that information system.\n\nPut plainly I view reality to most likely be similar to a self-evolving video game or life form which doesn't discount that it could all be like a dream and be more like monism, or it could be like a simulation with players in it from another hub world, or it could be any other imaginary thing, but I don't think there is currently enough available information to know that.\n\nIt's all about seeing that there is nothing but the absolute fact of present experience and reality is nothing else than exactly its current state. There is absolutely no continuity other than the belief 'what if things were different?' things cannot be different than what they currently are, things could not be different than they currently are, and any thought about alternative states of reality are just images appearing in reality's current state.\n\nI am saying that the experience of human reality, what you call 'Me' is sensory perception, and human perception only. I am saying 'buddy, you exist, the fuck is that?' All you can be sure of is the perception your body processes and submits to your brain/consciousness.",
        "Capy": "Reality/existence/experience itself, and how it operates perfectly fine without the desire, resolve, and effort coming from the assumed separate self that controls or desires things.\n\nReality really is the only thing to experience. The gist is that it all happens at once together at the same time. Hence the 'unity' aspect. Like how dreams are self-contained.\n\nKnowing experience would require something second to experience. To define something is to point at something other than the thing, but there aren't two experiences or two of me, so it does come down to the platitudinous 'experience is itself' because it can't reach out of itself and point at something to define itself.",
        "holos": "Your \"subjective\" experience is not entirely an isolation, your subjective experience is boundless because it's happening now and \"now\" is not confined to what's in front or around you. Thus there can't really be an outside or inside, that is simply a distinction held in thought.\n\nEvents are simply thoughts extracted from reality, that's all they are. Events are not separate from the thought of those events.\n\nThoughts do not point to reality as reality cannot be separate from itself.",
        "will": "I don't believe in any physical world, as it is right here in plain sight. There is no organism without the environment.\n\nThe distinction between the inner and outer world is just a function of how english works. We need a subject (I) and an object (house). But in matters of psychological health, there is no distinction between the two and thought can only bring about a fracturing of our conscious experience.\n\nReality is not an entity to be attacked. You could be getting stabbed and that wouldn't mean your reality is being attacked. Your experience would be 'getting hurt' but that isn't the same thing as reality itself being destroyed. Everyone knows what experience is, but we add other shit on top and mistake the thoughts for the real thing."
      }
    },
    {
      "id": "emotions",
      "name": "Emotions",
      "definitions": {
        "Ender": "Physical sensations in the body that are internally generated by evaluating sensory perception or thinking.",
        "Jamie": "Behaviour altering sensations in the body of mental or cognitive origin, as opposed to physically caused sensations like pain, pleasure, etc.\n\nWe experience two sets of emotions that overlap with each other and create complex emotions that aren't instinctual to us. One set of emotions related to immediate perception, and one set of emotions in relationship to our beliefs, thoughts, and imagination about what is occurring to us.\n\nEmotions aren't a sensory experience. They are internally generated while sensory experiences are externally generated. Seeing is sensory, hearing is sensory, pain is sensory. Sadness is internal, love is internal, shame is internal, fear is internal. There is no need for external stimulus for those to occur.\n\nYour emotions are always correct, there is no need to ever fight your emotions or accept them. Starting from the place 'my emotions are correct, but my thoughts and beliefs may not be' is one of the best steps to self-enquiry, and from there we can examine our beliefs that are creating these emotions in the first place.\n\nThe simple answer is that anything that you believe you are or affects who you think you are will cause an emotional reaction. This is caused by the root misunderstanding that your actual existence exists in thought.",
        "Capy": "Emotions aren't thoughts. 'Emotions associated with thought' is a thought. 'False emotions' is a thought. These are conceptualizations of emotions, and all concepts are thoughts. There's only one emotion: what you're feeling now.\n\nYou're already feeling emotions without self-image. The self-image doesn't exist because it's a belief; it's what you think of yourself that isn't true. Self-image is in the past or future, but you can't feel past or future.\n\nEmotions aren't believed, they're felt. There's no such feeling as 'tomorrow' since you only feel now.\n\nYou're not looking to change what you're currently experiencing, you're looking to realize that there's nothing other than what you're currently experiencing.",
        "holos": "I don't think there are negative emotions just undesirable ones that we label as negative.\n\nIt's entirely the emotional attachment to the thought that drives it. While sleeping you can experience emotions (nightmares) the same way you can experience them while awake (anxiety, sorrow, anger).\n\nAn emotion is simply felt now, I don't see how emotions \"should\" feel. There is no error with loneliness, it is a feeling and feelings are never wrong. They tell you everything you need.",
        "will": "I don't see any need to go beyond any feeling of sadness or anger, this is all part of your natural experience. There is nothing wrong with it as uncomfortable as it may be.\n\nJust remember there's no need to fight or challenge your experience, all your emotions make perfect sense instinctively. It's okay to be emotionally involved, nothing wrong with that.\n\nEmotions can be triggered for reasons other than self image. The thought and the emotion aren't really separate are they. If the emotion is due to thinking about 'myself' then yes, that is self image. But the feeling of attachment just trips the alarm of fear unnecessarily. Fear isn't a bad thing, not something to completely remove as a function."
      }
    },
    {
      "id": "happiness",
      "name": "Happiness",
      "definitions": {
        "Ender": "The default mode of experience where one has no negative beliefs about oneself that are currently operating.",
        "Jamie": "Happiness is experienced as 'expressing myself as I am' it is not a state that is ever arrived at, it is the ongoing process of creation and self-expression, it has no 'objectives' that need to be met.\n\nWith no self-image you immediately realize your default state is happiness, and that is what you get once your self-image stops demanding you do imaginary things you think you need to emotionally. It is in my view the origin of 'happiness is within' and the same insight religious figures tried to share that started most major religions.\n\nAll forms of happiness that arise from 'good thoughts' (nostalgia, longing, anticipation, pride, etc.) are the result of relief, not genuine love towards immediate experience. It is only possible to be nostalgic if there is a sense of sadness in comparison to our life today. It is only possible to hope for a better future if we are in some way dissatisfied with our present.",
        "Capy": "Love and happiness are not attachment. They are the absence of attachment.\n\nEmotions and feelings aren't thoughts, so they don't go away, but become much deeper actually.\n\nYou only ever feel one thing, which is what you are currently feeling, which is self-evident and whole.",
        "holos": "Happiness cannot be added, it only exists when there's absence which is more of a subtraction than anything.\n\nHappiness/contentment is always the baseline. Pleasure creates a jolt of chemicals naturally but it's not an indulgence in that feeling.\n\nIf you feel good you really don't need justification because happiness is the lack of problems.",
        "will": "Happiness comes as a result of understanding, but it isn't the goal. Your need to be happy is stopping you from being happy.\n\nIf you have the goal of being happy then that creates a barrier between FULLY immersing yourself in present experience vs what you'd rather be feeling (self image). If you are attending to the goal of being happy then you aren't all the way with present experience.\n\nPeace is not something that takes planning to get to, it's a byproduct of understanding what you fundamentally are."
      }
    },
    {
      "id": "anger",
      "name": "Anger",
      "definitions": {
        "Ender": "The belief that something has wronged you.",
        "Jamie": "Anger: the belief that someone else poses an unfair threat to me or others that could be forcefully addressed without experiencing shame.\n\nThe reason you experience anger in relationship to self-image is because you perceive in your imagination another person or entity is harming someone else and/or yourself. This is what creates conflictual emotional relationship to politics, religion, economics, relationships, and all beliefs. You believe you are right, and that the other person is to some degree not considering or understanding your viewpoint and that it would change their opinion to be less harmful if they did.\n\nAnger allows you to hurt another organism to protect an innocent person without feeling shame. Without self-image, I experience anger only in relationship to physical danger.",
        "Capy": "Anger probably means you feel like you or someone else is in danger (either now or in the future) and it is the desire to neutralize whatever you believe to be the cause of that danger, so that would be the seeming 'benefit' of holding up the thought that feels like anger.",
        "holos": "Anger can only be associated with someone or something attacking \"you\" or \"your ideals\" but these always start with \"you\". And more specifically \"your morality\" stance which is at odds of some perceived injustice that isn't being experienced other than your thought of it.\n\nIf you observe anger in the way it's laid out here you're encasing that anger within thought and thus creating an \"anger object\", this image is imposing both time and a thinking constraint on the emotion and feeling.",
        "will": "Anger is the result of an expectation not being met. We have an image of how things should go, and when reality contradicts the image, we lash out.\n\nThe organism is in imminent danger and needs to take quick action, hence the adrenaline. In this case it is perfectly natural and healthy to experience fear here. The signal on how to act is embedded in the experience of fear and doesn't need verbal explanation. The confusion arises when there's an emotion caused by self image paired with non-egoic emotion, i.e. shame for hurting others + anger towards ones we've hurt creates an emotional signal that isn't at all intuitive as there's conflicting signals."
      }
    },
    {
      "id": "love",
      "name": "Love",
      "definitions": {
        "Ender": "Present oneness of experience which facilitates naturally caring and altruistic behavior.",
        "Jamie": "The only positive emotion, experienced for various reasons at various stages of your life. Absolutely all of your actions are driven by either trying to avoid negative emotions, or the pursuit of trying to experience love whether you are aware of it or not.\n\nI also use the word love more casually to refer to compassionate behaviour, which is the natural outcome of our use of intelligence directed towards others when our ego is not operating.\n\nLove is complete communication with another, almost always a romantic partner, and is the 'two brain cells in a pod' phenomenon, but can occur at a lower intensity with non-romantic partners you feel a connection or peer relationship with. It is not 'love you babe', 'yeah love you too', which is attachment or 'I would be hurt if I didn't have you'.\n\nYour natural mode of operation is wanting to love. This is the complete fulfilment of intelligent function in relationship to your life as it plays out in front of you.",
        "Capy": "I would normally say love is the desire to be with someone in some capacity. But the desire I'm talking about is not about attachment.\n\nLove and happiness are not attachment. They are the absence of attachment.",
        "holos": "Love doesn't exist between one another it only exists from one to nothing, love is not transactional and doesn't need to be reciprocated.",
        "will": "Love has nothing to do with thought. Love is what is left when self-centred activity comes to an end.\n\nLove has no inherent goal, there's no conflict or contradiction since there's no selfish motive linked to it. Love has no direction or purpose, it is whole within itself and doesn't need to do anything.\n\nForgiveness can only occur if you hold onto the unpleasant memory, forgiveness requires clinging. Love doesn't need memory.\n\nThe need to be loved by others stems from an insufficiency in our own experience. It most likely stems from the belief that who we are isn't enough and that if we 'finally get there' we will be enough. But the need for validation is itself what is causing the suffering."
      }
    },
    {
      "id": "good",
      "name": "Good",
      "definitions": {
        "Ender": "Evaluating one scenario to be favorable to another (which necessarily stems from not recognizing the oneness of experience, so there is nothing to compare in the first place).",
        "Jamie": "Without ego, good and bad are strictly mental evaluations of likely intelligent or likely unintelligent behaviour/decisions. With our self-image involved it usually just means 'something I want' vs 'something I don't want'.\n\nIf someone says 'You are good' or 'you are bad', quite literally, what are they addressing? Even when someone says 'well F them, they don't know me!' Well what is that? They say you're bad, you say you're good, where's the answer? Point directly to the answer, is it knowable?\n\nEvery emotion has utility, but there are certainly 'good and bad emotions'. What we describe as 'mental illness' in the common sense is entirely 'bad emotions', and I don't think anyone would say to someone who was depressed that their state was neither good nor bad.",
        "Capy": "Positive emotions are experiencing a fulfilled desire, negative is experiencing an unfulfilled desire.\n\nThere's no such thing as what I should and shouldn't feel, because you're already feeling whatever you're feeling.",
        "holos": "Good is already the base state you just want to escape feeling bad. There is really no divisory nature between what's good and bad, just what is desired in the moment.\n\nThere wouldn't be any suffering of \"sinning\" or judgement on that decision. There is simply understanding what's at play based on the information available.",
        "will": "Good and bad are the two sides of the same coin. The brain that says 'this is good' is the same brain that says 'this is bad.'\n\nHow can we understand our daily lives without thinking? Without good and bad and all the comparison."
      }
    },
    {
      "id": "bad",
      "name": "Bad",
      "definitions": {
        "Ender": "Evaluating one scenario to be less favorable to another (which necessarily stems from not recognizing the oneness of experience, so there is nothing to compare in the first place).",
        "Jamie": "Without ego, bad is strictly a mental evaluation of likely unintelligent behaviour/decisions. With our self-image involved it usually just means 'something I don't want'.\n\n'Bad' doesn't exist, it is a psychological categorization of events or behaviours like 'tall' or 'smart'. Saying 'well I did that because I'm a bad person' is as nonsensical as saying 'I cheated on her because I'm tall'. It is avoiding the actual experience and indulging in the invention of a false self-identity.\n\nAbsolutely every time you or anyone says 'I did that because I'm a broken person' or 'I did that because I'm a bad person' you can just delete the word and say 'I did that because I'm a person' and then you can say 'I did that' and then you can say 'I didn't like that I did that' and then the resolution always is not making that mistake again, trying to make amends, and doing your best to make more intelligent choices in the future.",
        "Capy": "'Less positive emotion' isn't an emotion, it's a conceptualization of emotion on behalf of comparisons made in time.\n\nIf you slow down and look at the structure of self-image, it's all about what you aren't currently experiencing. Example: comparisons, the future, 'me after self-realization', etc.",
        "holos": "The escape of feeling bad is perpetuating you to feel bad further. The desire itself creates a lack which never existed in the first place.\n\nWhen in a negative state you will always desire to change to one that is blissful and at peace. These states of \"unhappiness\" constantly live in division of happiness.",
        "will": "Good and bad are the two sides of the same coin. The brain that says 'this is good' is the same brain that says 'this is bad.'\n\nWhy do these words register as important to the brain whereas other words don't have any significance. Why distinguish flattery from something benign. If they factually occurred, why do we move away from the fact into speculation."
      }
    },
    {
      "id": "like",
      "name": "Like",
      "definitions": {
        "Ender": "Good in terms of a sensory experience.",
        "Jamie": "I'm usually talking about a distinction between emotional reactions to our categorizations of thought vs our sensory preferences, which is ego/self-image vs reaction to immediate perception. If you like peppermint ice cream and not vanilla, we naturally know this automatically with no involvement of thought. We just know this obviously. We like touching soft things rather than sandpaper.\n\nPreferences are the best example. I for example really don't like cilantro. It's apparently a thing some percent of people don't like genetically. This is not my conscious decision, I just eat it and don't like it. This is how thinking works as well, but most of us don't realize it.",
        "Capy": "What is a like or dislike outside of memory/knowledge?\n\nPositive emotions are experiencing a fulfilled desire, negative is experiencing an unfulfilled desire. But the emotion is always felt now, not in the past or future.",
        "holos": "When in a blissful state, you simply don't desire to change. It's entirely the desire through the mind that dictates what is wanted. It's nothing more than deciding to eat waffles vs pancakes, you just want waffles now, that's simply the desire.",
        "will": "The brain records a pleasurable experience and thought then creates a desire to repeat it. The desire is never the same as the original experience, so there is always disappointment.\n\nAfter having experienced something nice, we immediately try think of some way to experience the same pleasure... and so our current circumstance is seen as insufficient. We always try experience things to continue on, never for their own sake."
      }
    },
    {
      "id": "dislike",
      "name": "Dislike",
      "definitions": {
        "Ender": "Bad in terms of a sensory experience.",
        "Jamie": "This is a very simple generalization, but if you want to do something or experience something it is because it is a preference, but if you are trying to avoid something or not experience something it is self-image based.\n\nWhen it comes to 'preferences of thought' that is where our ego/self-image comes in and creates emotional response to our perceptions of other things. It depends if it is emotional or just an intellectual preference. A very loud noise or a mosquito's undulating and nagging buzz is 'physically painful' as in there isn't a reason in thought for it to be annoying, it just fucking sucks. If you look at art in a way that makes you think 'that is a poor job and they don't deserve to be at this level of display' then that is ego based and emotional.",
        "Capy": "What is a like or dislike outside of memory/knowledge?\n\nInsecurity is settling for beliefs; it's wanting what isn't there already. It's the thought structure you're wanting which feels insecure by definition, because it isn't true and it isn't in your experience.",
        "holos": "Descriptions given to the body seem different than the emotional attachment to the body, because the attachment comes to light through the emotion. Whether you are skinny or not that's simply a description, the attachment to the description is what creates the conflict.\n\nIt's a strong desire to make everything as efficient as possible to get to some destination. But I question what will we get if it's done faster in the first place.",
        "will": "And in being self conscious, we are constantly choosing. We say 'yes I like this thing, so I'll keep it. But I don't like this trait so I will reject it.' But the root of the conflict isn't in having enough good traits to balance out the bad, it's in being self conscious in the first place.\n\nSeeking something desirable 'in the future' implies that our current circumstance right now must be an unpleasant one. We only want a future to escape our superficial miserable lives now."
      }
    },
    {
      "id": "observation",
      "name": "Observation",
      "definitions": {
        "Ender": "The fact of content appearing in awareness.",
        "Jamie": "The idea of a state without thought or a state of presence or simply observing thoughts like clouds is modern spirituality like a modern religion, it is not wrong, it is just misguided. Self-realization results in seeing all thoughts with absolute indifference automatically. It isn't avoiding thought, it is treating thought exactly like sight, sound or other senses, which is as an externally perceived object created by sensory perception.\n\nPay attention the next time you are anxious, sad, angry, or any emotion, and pretend to yourself 'this emotion is a moving, living expression, and I will watch how it grows and changes.' If you take it sincerely, you will notice sadness always grows into motivation and love, ego based anger always grows into shame and regret, which again results in motivation and change in perspective. Anxiety always grows into 'overcoming'.",
        "Capy": "There can be observation without thoughts.\n\nYou want to stick to what is already inherent and present in your experience. Anything that requires time or effort to reach somewhere is not inherent to your experience, and thus it is irrelevant, let go of it. Observe what is presently and already the case.",
        "holos": "Look at the plant, the plant simply emanates beauty. The plant breathes, grows, and blooms so beautifully. What need is there to think when just looking at it.\n\nIt was never about change, always about observation.",
        "will": "Observation is what is taking place, and interpretation is overlaying a story on top of it. Can we look at anything without naming it? Can we see ourselves without judgment?\n\nOnly in this space of not knowing, are we then free to observe plainly and unemotionally what is happening.\n\nIf there is observation, not acting on the loneliness but actual watchfulness, then the fact is we don't know what loneliness is. It may not be a threat at all.\n\nTo observe plainly does not require any background. Just observation of the fact, which doesn't take any specific form or have any technique."
      }
    },
    {
      "id": "interpretation",
      "name": "Interpretation",
      "definitions": {
        "Ender": "A narrative created by thinking to describe a past event. An incorrect use of interpretation is what leads to the self-image which is often described as \"experiencing things twice\" (once as the event, another time as the interpretation).",
        "Jamie": "There is nothing wrong with using thought to interpret things, the issue is not understanding through observation what interpretation and thought is.\n\nWhen you say 'yes, I agree' this is you creating a symbol in your own mind, agreeing with it, then calling it my idea. The reason there is objection or agreement with me or an external actor is because you think the idea you are reacting to is actually an external actor, but isn't, it is your own knowledge you are agreeing with but not recognizing it as your own knowledge.\n\nWhen we think of a beautiful olive tree in the 13th century of an aristocratic greek scholar's courtyard, we say 'wow, that would be beautiful!' when in reality we just drew a picture in our brains and misinterpreted it as the entirety of reality in a past point of time. We think we are appreciating history, culture, and gardening, but we are appreciating our own thought and mistaking it for a real thing.",
        "Capy": "The mind is division. Descriptions, words, concepts, etc, point to divisions/separation. And they are all mind.\n\nIf there isn't someone who is wrong, or someone that deserves something, or any such interpretation, then there is no hate. The explaining of emotion as if it is coming from tomorrow or somewhere other than \"here\" is what keeps it looping.",
        "holos": "Narratives are created right here right now. So when you embarrass yourself, or when you make a horrible mistake, or you have a lack your justification is simply a thought. It's an imagination created from thin air about 1 particular interpretation. It's entirely limited because thought only creates limits, it just slices reality. And then we latch onto that limitation thinking it's accurate. But that is not the all encompassing reality.",
        "will": "Well there's direct perception which is how the object is perceived, but it's thought that divvies it up into 'x label' and 'z label.'\n\nThought comes in and has all these post-hoc justifications why we acted the way we did. Then thought comes in and creates a narrative around why the action was performed.\n\nThere's no need to label or interpret, thoughts are just thoughts. We think they are representative of something other than itself but that's because of our relationship to an imagined self. Not an inherent quality.\n\nYou don't interpret a blue sky, but you interpret someone complimenting you?"
      }
    },
    {
      "id": "guilt",
      "name": "Guilt",
      "definitions": {
        "Ender": "The belief that one has caused unnecessary suffering, which encourages the mind to learn to not cause unnecessary suffering (not necessarily tied to self-image).",
        "Jamie": "There is a prominent emotion of shame/guilt that remains after self-realization, it's not like you become a sociopath who doesn't care about past harm to others, it's literally the opposite. Shame/guilt no longer occurs in relationship to ego/self-image ('I haven't lived up to other's expectations of me') but does persist in relationship to direct communication of hurting others emotionally or physically.\n\nComing to a self-identity of 'I'm a problem' or 'I'm broken' is always a form of self-image and coping because it is deferring responsibility for individual actions to an imagined character that doesn't exist. The reality is just 'Yeah, I'm really sorry I made a mistake and want to correct for it'. The most you can ever do is that, and what is even more important than that is the awareness of what is even a mistake or not in the first place, which is back to self-inquiry.",
        "Capy": "The thought that \"I am disappointing people\" feels like guilt. If you assume it's the case you will rightly feel it emotionally.\n\nIt is the thought or belief which is currently appearing which is being felt emotionally. You don't feel tomorrow, you feel the belief in tomorrow. If you believe there is a bear in your closet, that belief does not require a bear, it only requires the assumption that there is one, and that assumption feels like fear.",
        "holos": "What is the \"right\" or \"wrong\" way to live. What is the correct choice other than some thought creating some separation of \"right\" and \"wrong\" or \"correct\" and \"incorrect\". A bear eating berries does not question whether that is right or wrong so why is there this hesitation or this guilt?",
        "will": "Guilt is the discrepancy between what I have done and what I believe I should have done. It requires the self-image to function.\n\nWe race to find the answer why we feel this way, and so we always have a sense that we know why we feel this way. And this sense of knowing serves as security and temporarily removes the discomfort of not knowing oneself. So we never have periods of silence in which we are plainly honest that we don't actually understand what has happened."
      }
    },
    {
      "id": "shame",
      "name": "Shame",
      "definitions": {
        "Ender": "The belief that one is insufficient (tied to self-image).",
        "Jamie": "Shame is a means of communicating to others your present emotional state without the use of language and is part of expressing you didn't intend to cause what you did. In the case of embarrassment, that is guilt related to ego and is the feeling of 'they/I think less of me'. Embarrassment or cringe is not experienced without self-image, but if you have genuinely let people down or hurt them there is shame.\n\nIt is the most frustrating emotion for me to explain because even if you don't have a self-image, it is the only emotion that can occur because of someone else's self-image. If everyone were self-realized it would only ever occur when you accidentally physically hurt someone, but because people express emotional hurt from words and ideas, if you accidentally hurt someone with your words, which is their ego being hurt, it will cause shame to arise.",
        "Capy": "Shame, guilt, regret involve feeling bad about something you have done.\n\nEmbarrassment has always been a hypothetical situation through and through. Experiences don't happen to people or things, and emotions don't attach to experiences, as if they are separate, it's all simultaneous to each other. So anything you believe causes the other is a superfluous separation created through time/thought/assumption. This separative \"recursion\" is embarrassment and it is an \"afterthought\" on behalf of the initial event.",
        "holos": "When you embarrass yourself, or when you make a horrible mistake, or you have a lack your justification is simply a thought. It's an imagination created from thin air about 1 particular interpretation.\n\nActing correctly is just a thought of some correct behavior and judging the illusory self of lacking this correctness.",
        "will": "Shame operates the same way as guilt. We have an image of what is acceptable and when we violate it, shame arises.\n\nIf you're only doing something because you feel ashamed not to then you're harming yourself. If you eat a piece of chocolate and then immediately feel shame because it's 'bad' then that's self image.\n\nMost people have an idea along the lines of 'I ought to make a good impression on people' and so the thought of going in front of a group of people is terrifying because the ideal is being threatened by another thought 'what if you look stupid?' Scratch the surface of the ideals you have, and you'll find that the scary thing is that the image of yourself (the past) may not continue.",
        "Gabriel": "test"
      }
    },
    {
      "id": "annoyance",
      "name": "Annoyance",
      "definitions": {
        "Ender": "The belief that one's current experience could extremely conceivably be better if some process was more efficient (necessarily tied to self-image since it stems from a failure to recognize the oneness of experience).",
        "Jamie": "Annoyance and frustration are the same thing in experience: a heightened energy and degree of forcefulness or pleading because there isn't intelligent communication occurring between parties. Annoyance is usually when an external party is being belligerent or you can't fix something (like a computer). With ego this is almost always experienced with anger, because there is the perception that someone or something else is not how it is supposed to be.\n\nThink of it like 'physically painful' vs 'ugh, don't like that'. A very loud noise or a mosquito's undulating and nagging buzz is 'physically painful' as in there isn't a reason in thought for it to be annoying, it just fucking sucks. If you look at art in a way that makes you think 'that is a poor job' then that is ego based and emotional.\n\nImagine you missed your train stop and are annoyed about it. The anger is caused by the belief that you (self-image/ego) had a lapse in attention or judgment and missed your stop. The anger is at the imagination of your past self making a mistake they shouldn't have made and is a form of suffering. There is absolutely no useful function to this as it can instead be addressed by you observing immediately in the present that you have missed your stop and must now react to this new situation.",
        "Capy": "There's like 3 phases: one is that you conceptually don't understand self-realization, second is that you conceptually understand why self-realization makes sense and why it is correct (and then you get annoyed because it still affects you emotionally), and then third doesn't really exist because you're self-realized and that doesn't involve any concepts.",
        "holos": "Why would someone dropping something be annoying? Who is it annoying to? Annoyance can only occur if there is an imagined someone being annoyed apart from the person that is dropping that thing, and moreso if you as someone individualized don't want that to happen. Considering it is all here right now there is nothing else needed or changed how can annoyance occur?",
        "will": "Tension seems perfectly natural, but it doesn't overstay what seems appropriate.\n\nWhen we are upset, we immediately race to fix it or plug in this perceived inadequacy. Why must you change? What is in front of you to suggest this?"
      }
    },
    {
      "id": "frustration",
      "name": "Frustration",
      "definitions": {
        "Ender": "The belief that efforts are not leading to the intended results (not necessarily tied to self-image).",
        "Jamie": "Annoyance and frustration are the same thing in experience: a heightened energy and degree of forcefulness or pleading because there isn't intelligent communication occurring between parties. Frustration is usually when you are trying to do or say something and it just isn't landing with someone or something else. With ego this is almost always experienced with anger, because there is the perception that someone or something else is not how it is supposed to be.\n\nFrustration is not an emotion. Anger is an emotion that is caused by the perception you or another has been wronged by another unintelligently, but frustration is a lack of communication between you and another person. If there is an active self-image, these are basically the same thing, but if there isn't, they are basically never connected.\n\nWhat most people call 'frustration' is an intellectual lack of communication/understanding (frustration) and emotional anger. The emotional anger component can completely end, but feeling frustrated that there isn't mutual understanding does not end. Feeling frustrated exclusively is just heightened energy towards a particular focus, like a dog who wants to get out of the car so it can run around.",
        "Capy": "There's only one way to operate, which is the way you're operating now. Isn't that relieving? The frustration is the desire to operate in two ways, because it is impossible.",
        "holos": "The desire to know is there but you are not seeking the desire you are seeking the fulfillment of the desire. One's entire life has been dictated by fulfillment and once they are fulfilled they move on. But moreso there's expectation and when the expectation of fulfillment is not complete there is frustration.\n\nFrustration arises because you're protecting something which is not necessary thus causing a larger expenditure of energy than is required.",
        "will": "The constant search for an end or a thing to accumulate is the very source of frustration.\n\nThe more I chased, the more I was tense and just all around super disoriented and frustrated. Fighting my experience just used energy and made me feel less inclined to continue in self enquiry.\n\nI think it doesn't matter that much, having a goal to 'be present' is missing the point. We try to remove our concentration problems by projecting a goal and going towards it, BUT this is precisely what is causing the problem."
      }
    },
    {
      "id": "physical-time-calendar-time",
      "name": "Physical Time / Calendar Time",
      "definitions": {
        "Ender": "The sequential passage of events that is not directly experienced.",
        "Jamie": "Anyone self-realized still uses calendar time in the same way they always have. I have a dental appointment next Thursday, so I write that down and will go there in the future. We are using 'time' as a word, but the context is just 'yeah yeah yeah, everyone exists in the real world and we use these words to denote obvious physical commitments in our life'. This doesn't change, this is just linguistic small-talk basically.\n\nThe idea of 'no psychological time' is related to an actual 'ok, sit down and think about this' point about your actual experience of time itself and what it really means. That's the differentiation that's meant to be drawn and examined.\n\nTime is a measurement, like distance. Distance doesn't actually exist as anything but a psychological abstraction that actually represents 'how many things could fit between two other things'. In the same sense, time does not exist as anything other than 'what is the rate of action of one thing compared to something else?'.",
        "Capy": "Time is specifically concept of \"not now.\"\n\nYou're mistaking the map for the territory. Time is a model (map). A baby doesn't need to believe in gravity to stay anchored to the Earth. It has no model of gravity. Yet it experiences gravity. Taking that to time, if you stop believing in the model, it actually vanishes entirely. This is unlike gravity. Because time is inherently a model, unlike gravity. It's not there.",
        "holos": "Everyone lives within the framework of time, telling someone there is no time is purely a belief or conceptual when hearing it. If 10 years ago there is you now, now there is you now, and in 10 years there is you now that means there's always you now. So time is not this continuous string, it's more like a single discontinuous point.\n\nThe entire landscape of time has to be understood. Without truly going into time, things will persist. When this is understood everything else falls into place.",
        "will": "Time is the movement from what I am to what I think I should be. The gap between those two things IS suffering.\n\nPsychological time is the accumulation of past and the projection of a future by thought. You do not need time to understand something. Understanding is immediate.\n\nAny process of becoming is time. The 'I should be' is the gap between the fact of what is and the imagined conclusion of where I want to be.\n\nPsychological fixes NEVER under any circumstance require time. Things like coordinating meeting with someone requires time in a practical sense, but psychological time is unnecessary."
      }
    },
    {
      "id": "intelligence",
      "name": "Intelligence",
      "definitions": {
        "Ender": "The ability to recognize and correct errors in thinking.",
        "Jamie": "The capacity to perceive and correct errors. Intelligence is much more fundamental than just thinking and governs basically everything, including yourself.\n\nIntelligence as I'm referring to is more like the innate quality of life that governs behaviour. Intelligence operates the growth of a seed into a tree, it operates how the roots search for water, it is the corrective mechanism that allows life to avoid errors and move towards whatever it is becoming. When you make a mistake, then do something different next time, the subjective change in behaviour is 'intelligence' and what operates all of our behaviour.\n\nSkill acquisition, learning, etc. is just 'growth'. And growth is the constant activity of intelligence. Consciousness and life itself in my view is the constant activity of intelligence and so all action is 'learning', 'growth', and 'experience'. Learning is what you are constantly doing because that is what intelligence itself is and defined by and what you are.",
        "Capy": "It seems like your mind is constantly calibrating how intelligent you are through the people and things you interact with, but you are already exactly as intelligent as you always are, so why the need to calculate it in your imagination by remembering everything you interacted with?",
        "holos": "Plans don't affect anything they are just another thought and it comes down to desire. You desire something and there's a fulfillment to the desire. The problems come from when that fulfillment is not reached, but the desire is just desire. We add a bunch of things like expectations and emotions on the desire which creates disappointment when it's not reached.\n\nWhen there is planning there is just recognition of the plan but no stickiness to it.",
        "will": "Intelligence is not the accumulation of knowledge, it is the capacity to see clearly without the interference of the past.\n\nOnce you cease going down the same patterns of escape then you are left with intelligence. It's just referring to the intelligence you already see, and already have the capacity to access.\n\nPerception is an immediate understanding of exactly what is going on. Seeing without the mind being burdened by experience."
      }
    }
  ],
  "faq": [
    {
      "id": "what-is-self-realization",
      "question": "What is self-realization?",
      "answers": {
        "Ender": "Self-realization is not the end of seeking knowledge. Self-realization is the end of attempting to acquire more knowledge for the sake of self-understanding. Seeking knowledge does not cease, just the belief that more knowledge will lead to more self-understanding.\n\nYou can sort of think of all of your knowledge as being a giant list of facts. As you navigate the world you pick up more facts and cross out facts and edit facts. This collection of facts is your understanding of the world. However, there is this additional program in your mind that sifts through each fact and goes, \"is this a fact about me?\" and then decides whether or not it should get a little \"me\" tag. All of the facts that are labeled \"me\" compose your self-image. Self-realization is realizing that it makes no sense to have a \"me\" label in the first place, because there is no \"me\" that is apart from the world. Now the additional program gets closed permanently and all the tags are automatically removed along with the program closing. This process is what Jamie means by \"self-knowledge just becomes knowledge.\"\n\nSelf-realization isn't realizing that you exist and can't know yourself for certain. It's realizing that the concept of \"me\" was incoherent in the first place so there isn't any point in trying to understand yourself by thinking because it's not possible.",
        "Jamie": "What self realization is on a practical level is the cessation of emotional relationship to self-imagination and thought. This occurs because there is a realization there is no experience of past or future and that there is actually no self-identity or \"Me\" that exists at all, despite us acting and thinking there is one previously.",
        "Capy": "The goal in self-realization is really to just pull \"you\" out of past and future, that sense of time and continuity.\n\nSelf-realization at its core isn't a blanket statement like \"you will never feel this emotion\", this is more like a side-effect. Self-realization is the secular realization that there is no separate self to feel what the thought is describing.\n\nWhat you're looking for is already the case. Any form of recognition or coherence which is currently in your experience...is currently in your experience. Not in the past in your experience, or in the future in your experience.",
        "holos": "The trick being played is there is no realization of a \"true self\" at all, it's the removal of anything related to some self that is imagined in the first place.\n\nThe main misunderstanding is believing that thought can somehow represent \"you\" which is where all the suffering is derived from.\n\nRemove everything, remove awareness, remove sensory experience, remove any form of division and identification and what remains?",
        "will": "Self realisation isn't a matter of who deserves it, it's just understanding what you are. You don't have to be a person of deep dignity and virtue.\n\nSR is understanding what your experience on its own is, in its totality. The realisation is as simple as seeing what the sky looks like, there's no debate or question about it. It is so.\n\nSelf realisation isn't a skill, it's a symptom, a byproduct, whatever word you want to use of understanding something new. SR just means you no longer experience neuroticism in relationship to the symbol of 'me.'",
        "Gabriel": "Self-realization is realizing the image, voice, or projection, in your head is not you, and then realizing what you are, which is your immediate experience."
      }
    },
    {
      "id": "does-sr-happen-all-at-once-or-gradually",
      "question": "Does self-realization happen all at once or gradually?",
      "answers": {
        "Ender": "SR isn't about going through each belief individually and seeing it to be false. It's a wholesale realization of an entire swath of belief to not make sense, so it's all dropped at once. Imagine you're back in grade school and you're doing a really long complex math problem and then get an answer that clearly makes no sense. You go back and see that at the start of your work you had \"2+3=6\" as an intermediate step. Once you see the error, your mind immediately sees intuitively that all the work built on top of that error is wrong too without having to go through each individual part. SR as a phenomenon works the same way.\n\nAfter the core realization that you can't think about yourself, all of the beliefs you hold about yourself--or in other words your self-image--just automatically cease and you no longer identify with it. Self-knowledge just becomes knowledge.\n\nThe time insight does feel progressive as the mind learns to be calmer, until there's a final sudden realization of there being no experience of time at all. And then there is no more progress to make.",
        "Jamie": "He is completely correct: self-realization is an instantaneous and permanent event that is realized now and happens now and then persists for every now that is experienced. What he means and what I mean is that there is absolutely no other time that things occur. This is tremendously hard to reconcile because we view our lives as an 80+ year monolith of information. You have years and years of childhood and years and years of future life you will experience. I am saying, and he is saying, that you don't. You have exactly present perception. This includes present memory, which is those other things. You have present perception, which includes present memory. Present memory is your past and your projected imagination of the future.",
        "Capy": "Self-realization is not something you gain, it is your default state. For it to be reversed you would have to have someone gaslight you or brainwash you into creating and believing in an image of yourself. It's kind of like trying to convince an adult to believe in Santa Claus.\n\nThere aren't moments that \"lead up to\" SR because that implies conceptual time. SR is realizing that you're always where you are no matter what.\n\nEnlightenment/self-realization is just one specific insight/recontextualization and then you're done.",
        "holos": "This doesn't mean a click is inevitable, any story you can trick yourself with is not it. The experience is unmistakeable and at that moment I realized you can't chase it or force it to happen. It will happen on its own as everything has ever happened.\n\nWhat is now is permanent and that there is nothing apart from right now. This very moment is everything that has been and everything that will ever be.",
        "will": "It was like piece by piece I felt I was getting closer, deeper mental acuity, greater attentiveness. I felt like I was levelling up. Then it plateaued, then I realised I was never progressing, because the entity which is progressing is fallacious.\n\nAs Jamie pointed out in his video, there aren't stages of spiritual growth or anything like that. It's that you suddenly realise that you cannot think about the self.\n\nThe reason projecting an outcome and working towards it doesn't create psychological progress, is because the insight of why you can't think about yourself is genuinely completely new and out of the blue.",
        "Gabriel": "When I experienced self-realization, it happened all at once. One moment I was anxious, I experienced a small sensation of change over a moment or two, and then I was not anxious."
      }
    },
    {
      "id": "what-triggered-your-sr",
      "question": "What triggered your self-realization?",
      "answers": {
        "Jamie": "The phrase itself makes perfect sense and is a great 'meditation', but at the time I didn't understand it conceptually at all as it was completely new, I was just talking to myself and thinking and it came out, but it triggered the physical event, and afterwards it made complete sense in hindsight. It felt more like someone saying \"look, there's the moon\" and consciously I was like \"ooooh...moon\" but your brain is like \"ok that's it we're becoming an astronaut but he'll learn that info later\". Not like there is secret info, but it felt like your own conscious knowledge is extremely low level, but that small insight was enough to trigger a much deeper and more intelligent brain structure to click and become aware of something.",
        "Ender": "Just going to share the thoughts I had right before the realization. Visual perception does not contain objects. You do not exist in visual perception because all that exists is visual qualia (this was while I was looking at a computer screen so it felt incredibly intuitive). It is not possible to see yourself, all you see is vision. Thoughts are essentially just another sense perception right? [click] Oh all that exists in thought is just thought qualia. You can't think about yourself you can only think about thoughts, and clearly you aren't a thought so you can't think about yourself.",
        "Capy": "Structurally it seems very similar to how it happened to me. I heard a specific line from one of the videos and then it triggered something in my experience mid contemplation.\n\nThe way it happened for me was that I basically realized that there is no actual difference between reading and imagining my life. Both are the exact same mental function of describing and imagining. You have to read now, and you have to describe now, and you have to think now. When you think about yourself, you are entirely limited to manmade words and definitions. It's like you're trying to find your life in a thesaurus.",
        "holos": "There were simply 2 things that I can credit. The first was that \"15 years ago it was now, right now it's now, and 15 years in the future it's now.\"\n\nThis doesn't mean a click is inevitable, any story you can trick yourself with is not it. The experience is unmistakeable and at that moment I realized you can't chase it or force it to happen. It will happen on its own as everything has ever happened.",
        "will": "I was sitting in front of a river and I imagined myself swimming across it, and in a split second I realised how the thought wasn't even me and I couldn't help but laugh. Like I realised the sentence 'I reckon I could swim across this river' cannot possibly be whatever it is I am. I genuinely previously believed that I was an object of thought.\n\nIt was such a brutally underwhelming experience. I remember the first couple weeks I was in disbelief and was constantly trying to find thoughts to freak myself out.\n\nThe reminder, 'hey dude it is literally what is happening RIGHT NOW. Stop trying to think your way to it, stop trying to imagine it, stop trying to wait for it.' was like a bucket of ice cold water to the face but ultimately culminated in the click.",
        "Gabriel": "I realized that I can't think about myself.\n\nEach time you have a sensory experience, you are changed as a person. If you think about broccoli, then you are difference than before you thought about broccoli. If you experience loss, then you are difference than before you experienced loss. You can't really \"turn off\" your senses, so new sensory information is always being integrated into who you are as a person. The only constant throughout your life is that you experience the moment right now. The only thing which is consistent is your immediate sensory experience, which means, by definition, you are your immediate sensory experience.\n\nThinking is a sensory experience.\n\nSensory experience is integrated into you each time you experience a sense.\n\nSince, thinking is a sensory experience, you change when you think. So, the act of thinking changes who you are, and hence it is not possible to think about yourself accurately because the very action of thinking changes who you are, and hence forces you to think about the \"past\" version of you and not the you right now.\n\nYou can't think about yourself in the future because you can't experience the future, you can only experience right now; you can think about what you think the future might look like, but you cannot actually think about the future."
      }
    },
    {
      "id": "do-you-still-experience-stress",
      "question": "Do you still experience stress or emotions after self-realization?",
      "answers": {
        "Ender": "Since SR, the only emotional reactions I've had are a bodily tension in response to an event happening right then, or a sense of shame from believing I hurt someone. The fear response no longer has a relationship with thoughts alone.\n\nI can talk a bit about a time I had to go on stage for a thing very recently. I felt nothing up until maybe 30 minutes before having to go on. It's a tension that's more like a heightened focus. My hands started to get a little sweaty. However it's not an unpleasant feeling at all. There's no dread about the outcome of going on stage, or worry if others will judge, just focus on doing well right now. While on stage there was an absolute focus only on the actions right now as opposed to worrying about future consequences. The thoughts about consequences just didn't arise at all.\n\nIt's like the thoughts don't have any force at all. I remember initially the first way I tried to describe it was that the thoughts weren't tall enough to reach me so I never had to fear that they would be able to hurt me.",
        "Jamie": "There isn't an emotional relationship to an idea of presenting or what anyone is saying, but there is a focus/tension in relationship to the actual event as it's happening. Like there is a \"stress\" that I experience in the same way that asking someone out I'd probably be nervous. This isn't accompanied by anxiety or an emotion, but is a tense physical event containing uncertainty that you have to pay a lot of attention to because you perceive it as consequential/important. While in this particular case there isn't any emotional characteristic, it's not like you never experience emotions, it's that emotions occur when they are necessary in response to events that are currently happening, not towards imagined outcomes or events.",
        "Capy": "Negative emotions after SR are all situational and they are specific to situations. If there is shame or anger, it is not about something or someone, it is a reaction to a situation. The shame in SR is a specific type of shame which is like \"I don't want to hurt someone so I should stop doing this right now.\"\n\nUnpleasant emotions tend to be an assimilation of another person's self-image or pain.",
        "holos": "Most noticeably is less anger and less emotional turmoil in understanding and communication. I remember being bothered by my parents wishes of doing certain things but now I don't get bothered by any of their requests. A couple months ago my parents had boiling blood rage at one thing I was doing and I didn't get riled up in that moment. I left the room and a couple hours later came back with a solution and we moved forward.\n\nIf you get frustrated then feel frustrated don't move away because you're moving away from what is. Feel the feelings, see what is in front of you for this is an eternity encapsulated in a moment.",
        "will": "Tension seems perfectly natural, but it doesn't overstay what seems appropriate.\n\nI still get these prompts with social situations where I think up a way to respond, but now it's not paired with fear. I still have thoughts telling me 'oh the anxiety's about to hit' and nothing ever comes of it.\n\nI definitely still feel fear, just went downstairs and got jumpscared by a massive fuckoff spider. I no longer feel my emotions need to hide. Before SR there were more or less no acceptable emotions for me to express.",
        "Gabriel": "Yes, but only the physical sensations of them.\n\nFor example, if I drink too much caffeine, I might feel physiologically anxious, which could change where I put my attention, but I do not experience anxiety outside of it.\n"
      }
    },
    {
      "id": "is-there-a-self",
      "question": "Is there a self?",
      "answers": {
        "Ender": "There is a life. There is a body. It is not \"my body.\" It is not \"my life.\" It is just body. And life.\n\nA more precise way of describing it is not in terms of a \"me\" but just that there exists sensory perception, which is all that exists subjectively. There's no relationship between me and sensory perception. It's just one thing which is sensory perception now.\n\nThe \"thing\" which you actually are is current direct sensory perception. Thinking is merely part of that direct sensory perception. Thinking cannot be \"about\" the experience because it is itself part of the experience. The true \"yourself\" is a somethingness that is completely indescribable, which is itself consciousness.",
        "Jamie": "I think that what you are looking at is really insightful and very accurate. The only thing I'd add on afterwards is saying \"is there even that 'Me' at the end of the search?\" Is there definitively anything at all at the end of the road you call yourself?",
        "Capy": "Because everything you learn about Santa is about Santa. You don't figure out what the separate self is, you realize it isn't there, in the same way you don't figure out what Santa is, you realize it isn't there. That's why a baby doesn't need knowledge to disbelieve in Santa. It already isn't there. The knowledge, by being there, covers up that it isn't there.\n\nYou don't need to fight Santa to get rid of him. There's nothing to gain or acquire that would get rid of Santa, he already isn't there. The effort to stop Santa is the belief in Santa.",
        "holos": "That which you are aware of is always a thought, always. \"You are the thing that is aware\" is tricky because you are not a thing and awareness is not an object. It is simply the senses which illuminate \"awareness\". There is nothing behind the senses for that is thought attempting to seek something which is absent.\n\nI've never really approached it that the \"self\" is false in any way. It's moreso uncovering what exactly is the \"I\" that is being referred to? Is it the body, is it the brain? Is it a personality that is being identified with?",
        "will": "You clearly highly value your sense of self as you wouldn't be worried about losing it otherwise. So what even is it? If it's so important and precious can you at least look at it and understand what it is. We are so scared of losing it, but we never even check what it is in the first place.\n\nIf it can be taken away or threatened then it isn't what you are. It may be a part of your experience but it's not you.\n\nThe question is to probe 'what do I currently think I am?' and see the limitations of any given identity you've assigned yourself. Any attempt to pinpoint down a central self is just more thought, more memory and more experience. While we do exist, there isn't a central you that generates thoughts that you can depict within thought itself.",
        "Gabriel": "Yes, but you cannot think about it. It is just the sensations that you experience, including thought."
      }
    },
    {
      "id": "what-is-loneliness",
      "question": "What is loneliness?",
      "answers": {
        "Ender": "Loneliness is not a real need. It is an invented need. Once one realizes it is invented, one will never feel loneliness. It is true that there is a need to not feel loneliness. However, lack of companionship is not the cause of loneliness. Loneliness is itself the desire for meaningful companionship. It is possible to not feel lonely despite being alone. The sense of loneliness is an invention from the self-image.\n\nAloneness: in terms of human minds interacting with each other, aloneness seems to just be true. The actual condition of aloneness isn't scary, but rather the idea of seeing yourself as a completely isolated entity that's sort of claustrophobic in your own skull is quite scary.",
        "Jamie": "Straightforwardly, loneliness is the desire for meaningful companionship, it is - importantly - not the lack of relationship. You are lonely when you want something, not when you hypothetically lack something.",
        "Capy": "Loneliness is sadness in a relationship, which means lack of love in regards to a relationship.\n\nLove and happiness are not attachment. They are the absence of attachment.",
        "holos": "A person who feels lonely is entirely weighed down by his desire to not feel lonely. The person feels loneliness and desires to not feel lonely so he seeks a companion to fulfill that desire. Rather if you look at being alone you are simply alone, but loneliness makes you feel different than just being alone it makes you feel incomplete. Thus the desire of fulfilling the incompletion is what causes loneliness.\n\nWhat is loneliness other than desire to be with someone? It's not that being alone is bad or wrong, it's always the desire which thought dictates as not having reached the destination as lacking or failure.",
        "will": "Loneliness is the realisation that the self is empty. The self-image runs out of things to distract itself with and is faced with its own hollowness.\n\nIf I am lonely then I seek respect, or a partner or whatever that one's conditioning claims will bring me peace. The search for a million different things outside myself brings me some temporary comfort because then I believe I can fix my problem and have control. Because we cannot stand that we are lonely.\n\nHowever, if there is observation, not acting on the loneliness but actual watchfulness, then the fact is we don't know what loneliness is. It may not be a threat at all.",
        "Gabriel": "Loneliness is the desire to connect with others.\n\nIf you desire to connect with others, and you connect with others well enough (by your own interpretation of well enough), then you will not experience loneliness. If you have no desire to connect with others, then you will not feel lonely. Otherwise, if you want to connect with others, but you do not do well (by your own interpretation), then you will feel lonely."
      }
    },
    {
      "id": "can-experience-be-expressed-in-words",
      "question": "Can experience truly be expressed in words?",
      "answers": {
        "Ender": "SR as a concept is quite literally impossible to talk about with words. While the statement \"I am consciousness\" is true, it gets presented as a belief which is not what SR is.\n\nThe concept of consciousness is the best possible abstraction of what you are, but it is still ultimately not successful because understanding the concept does not lead to an actual literal understanding of being the consciousness. Trying to communicate what the \"true self\" is, is kind of like trying to communicate to someone who doesn't speak English what blue is. They absolutely have direct experience of what it is, but merely saying the word can't directly communicate what you mean since \"the word is not the thing.\"\n\nThe quality of the self's \"nothingness\" never changes. The whole problem is that I can't describe it to you because it's not describable. It is more like a unique observation. You can tell people to look in their direct experience but they have no idea where to look. When you say words they focus on the meaning of the words because that's how words work, but that's not where the insight is.",
        "Jamie": "In my experience, nearly all of feelings of \"I wanted to express something but I couldn't\" is usually related to thinking. It is, in my experience, basically impossible to have any sensory experience that can't be communicated in basic thought other than other thought.",
        "Capy": "You experience taste, but you don't experience the word which describes the taste. You have to remember your knowledge of words and experiences to find the word that describes the taste, that is the only part that memory plays. You are using memory to find a word which describes something that is not memory.\n\nThoughts don't represent things, they are the things they represent. It's a self-contained perception, exactly like seeing, hearing, touching, etc. There's nothing outside the thought being represented. Just like you can't see something outside of seeing.",
        "holos": "Thought is not really made up of anything, thought simply references other thoughts (concepts). For example, the concept of a fridge requires a reference of possibly a rectangle, maybe even your own fridge and you ascribe characteristics to that like the concept of 2 doors, metal casing, the food inside etc. Fridge as a thought is simply a reference or a pointer to that extraction of experience via memory.\n\nPointers from thought only point to themselves, there's nothing outside of consciousness ever.",
        "will": "Thought cannot ever contain the totality of what life is, because thought is a subset of it. Thought's attempt to capture a wholistic experience is negated by the fact that thought can only reference what has been accumulated through time, and can never be quick enough to grasp what's happening now.\n\nI can intellectually understand that you are referring to a particular object when you say car, but I don't confuse the word 'car' for the thing being directly perceived.\n\nThe characteristics you're imagining aren't features of 'you'. A thought can never physically alter reality, even if you could argue someone's conceptualisation of something is 'closer to reality' it still isn't and never will be reality.",
        "Gabriel": "Yes, but there will always be information loss.\n\nThere currently exists no language that perfectly captures experience. The closest would probably be poetry."
      }
    },
    {
      "id": "where-do-thoughts-come-from",
      "question": "Where do thoughts originate?",
      "answers": {
        "Ender": "Where do thoughts come from? If you realize you don't really have a solid answer to that question I don't see how you could be in control of them. You don't have control over your thoughts to the same degree that you don't have control over what you see, hear, or any other sense. Even if you close your eyes, you're looking at your eyelids. Thought is just another sense perception.\n\nThere is this old Eastern teaching that I found helpful: You are not your mind. Rephrasing it, there is literally no difference between someone telling you something, and thinking something to yourself. Both cases are an observation of a thought from a source that is not you. Realizing that you are not the one generating the thoughts makes self-inquiry far easier.\n\nWhat causes the brain to create the thought? Really my only line of reasoning is that if you keep asking \"why did you do that\" enough times about any action eventually you find a cause that is surely outside of your control.",
        "Jamie": "The point to be made is that there is no first principle, which originates itself in thought, where does that thought come from? From where does that symbol or identification originate other than thought, and what is that?",
        "Capy": "Get really good at watching your thoughts appear and disappear in whatever capacity. What does it look like for a thought to disappear? What does it feel like?\n\nReally focus on your mind's capacity to describe things. What is it describing? How is it describing? What is a description? Can I describe something without thinking?\n\nJust take notice of this innate capability of your mind, which is that it appears as things and then stops appearing as them. And also notice that your emotions appear and disappear alongside them. The cause of the emotion is not what the thought is describing, it is how the thought feels currently.",
        "holos": "Thought is a divisory experience. Just look at any thought right now whether it's a description or a label. \"Pink Elephants\" - you've never seen one but you're thinking of one now. What is that thought right there, it's simply a division of the color pink and an animal thus some imagined object.\n\nThinking is not something to be scared or judgemental about. Thinking is thinking and it's happening now so there's nothing to fear about it.",
        "will": "Thought is a mechanism in the brain, it is a process that we can understand. Thought is limited, and anything it creates is limited. Thought can only operate in a limited field of knowledge consisting of things it has collected.\n\nThought is a circuit, it will continually repeat. Thought is stuck on a train track circuit. Even if it moves further down the line and has supposedly found something new, it is still operating within the same limits.\n\nThought is like sand and is constantly sprinkling itself onto the ocean to draw a pretty image. As pretty as the sandcastle is, it's gotta fall. Thought as a material process cannot EVER under any circumstance be permanent or be secure.",
        "Gabriel": "Sensory experience creates memory, and memory creates thought."
      }
    },
    {
      "id": "does-understanding-evolve-after-sr",
      "question": "Does understanding continue to evolve after self-realization?",
      "answers": {
        "Ender": "SR itself as a phenomenon has nothing to do with having transcendent experiences. There is nothing attained by SR. It's a completely subtractive phenomenon revealing the experience that was always there.\n\nI've always been interested in the mind and perception and psychology so I would always have questions for myself about why I believed certain things. When I discovered Jamie I spent a few months specifically focusing more on self-identification. It was after that when I got to the state of knowing the origin of all emotions. And then I wondered where this SR thing is if I could see the whole structure, since it felt like I wasn't getting it even though I thought I understood the whole thing. The final realization that ended the self-image was realizing I am not the being in the memory that experienced the past.\n\nMore like something I understood intellectually finally sinking in. The realization itself is not of an intellectual nature. I was eating dinner and it sort of hit me like a truck that nothing I ever experienced was physical and I started laughing. Each of them felt like sudden realizations. I remember the realization that I don't experience anything physical feeling very similar to realizing that I can't think about myself.",
        "Jamie": "I mean I think it's just a continual progression of the same thing. While it's true that self-realization itself is phenomenological, the explanation of experience to other people afterwards and your own ideas about life are intellectual, so it's been difficult to evolve those concepts to share. An example is that I originally communicated the idea like one week after it happened as \"cutting the umbilical cord between thought and emotion\" and a lot of people thought it was like a mental break \"are you ok?\" type of thing. After a while I communicated the same thing as something like \"the cessation of emotional relationship to self-imagination\" which is pretty accurate, but I feel like maybe only around now I'd be comfortable being like \"ok, these expressions have settled with me long enough to write them into a book to share without wanting to change them significantly later\".",
        "Capy": "I had a very good understanding of metaphysics and spirituality and all those concepts, but it was just understanding. And, I did realize it for myself to a certain degree, but I still wasn't enlightened/self-realized. It is absolutely insane the amount of self-deception that can occur, you have very very smart people who just get stuck to understanding forever. Enlightenment/self-realization is just one specific insight/recontextualization and then you're done.",
        "holos": "There is no incompatibility, thought divides even for those that you label as \"SR\", this is just how thought functions. The main misunderstanding is believing that thought can somehow represent \"you\" which is where all the suffering is derived from.\n\nNow any time there's any sort of conflicting feeling I just sit with it on the spot and the resolution has gotten quicker from when I first started to look at things this way.",
        "will": "I feel just very happy as I am, I'm not invested in considering myself or being considered self realised. I know myself and for communicative purposes I feel I could say that I'm SR'd but I'm genuinely uninterested in any bravado or shit that comes with that.\n\nDoubt and skepticism don't have to be tinged with fear. I was skeptical because sure I had an experience, but I don't see why any experience should be significant and conclusive. I'm very cautious to offer conclusions naturally because they block one from continuing to investigate.\n\nNow after the click it's like I'm recalibrating my experience, all the thoughts and habits are still there. They're like cobwebs, and my awareness is a flame that burns all the unnecessary patterns of behaviour.",
        "Gabriel": "I still learn things as normal.\n\nThe steps for learning do not really change. Communicating experience is just difficult sometimes."
      }
    },
    {
      "id": "why-dont-you-need-a-self-image",
      "question": "Why don't you need a self-image?",
      "answers": {
        "Ender": "What is currently your self-image isn't actually you. It is knowledge about the world that is completely unrelated to what you really are. In terms of navigating the world, this knowledge in itself is very useful, but believing that this knowledge actually represents something about yourself is not.\n\nYou have knowledge about what you think is yourself, but that is just knowledge. The self-image is the belief that these bits of knowledge actually represent something about \"me.\" The knowledge itself is quite useful but the belief that it has something to do with \"me\" serves no utility.\n\nHaving a construct of a \"me\" is absolutely very useful when navigating social situations. However, mistaking the construct for literally being \"me\" causes a lot of unnecessary suffering. It's not that having a construct is unnecessary, but literally recognizing a \"me\" inside of that construct is unnecessary. You are not the construct. You are the awareness of sensory perception.",
        "Jamie": "The reason you don't need a self-image is because you don't need to imagine who you are. You are experiencing what you are every single moment of your life right now.",
        "Capy": "Self-image is what you think about yourself that doesn't actually exist. First and foremost, the self-image is a belief. There isn't a way to get rid of it because it already doesn't exist, there is only realizing that it already isn't there and that you are mistaking your thoughts for yourself.\n\nIn the same way how there is no way to get rid of Santa Claus, there is only realizing that he isn't in your experience already. It's already the case. It's already inherent to your experience.",
        "holos": "Your self-image is not you just as the word is not the thing, it will never be you. Any thought given to that self-image is just thinking of that self-image, constantly perpetuating it but never truly arriving at what the self actually is. Just like a painting of the landscape is never the landscape.\n\nEven if the self image is conflicting with itself or has any feature of conflict, if that is the image being displayed on the screen that is all there is.",
        "will": "We maintain an image of what we are, and protect the image of what we think we are, but rarely investigate what we actually are.\n\nI don't care about improving my character because the whole basis of wanting to improve is founded on a misunderstanding. Growth occurs naturally, everyday I'm learning and developing my skills so it's not really something I'm super concerned with bringing into fruition, it's already happening.\n\nYou've given the self extreme importance, what is it that is so important? It's like the belief in Santa is super important to a kid, because it supposedly affects them but they've never actually looked in their own experience at what it is they're referring to when they say 'Santa.'",
        "Gabriel": "Self-image does not do anything useful.\n\nYou have access to all of your important experience at every moment through memory, so you don't need an representation of your self. You can have a summary of what you know memorized and ready to say, but that summary is not all of your important experiences. Self-image is kind of like a summary, but the summary is trying to be all of the experiences at the same time, where the experiences are you."
      }
    },
    {
      "id": "how-do-i-engage-with-sr",
      "question": "How do I engage with self-realization?",
      "answers": {
        "Ender": "I have a hunch that the SR phenomenon becomes exponentially more likely to occur if the person inquiring does not feel any need to escape from their regular day-to-day life. If that isn't the case, the inquiry is biased by the person's feeling that they \"need to become SR.\"\n\nFor a long time I approached it intentionally. And then I gave up, thinking it would never actually happen... and then the realization happened. I bet that's not a coincidence. Since the realization is an insight into direct perception, you can't think your way to it. It's not really possible to intentionally make the realization happen. It sort of just appears out of nowhere.\n\nThe biggest thing for me personally was when I could literally directly observe and feel that it wasn't possible to think about myself. On this server we do a lot of logical arguing but I think that for nearly all people that is almost completely useless for self-realization. The type of understanding that self-realization actually is, is not one that can be thought about or explained.",
        "Jamie": "You will feel whatever you feel as you figure it out. They are both the same, but to be more practical, yes you need to engage. The only reason I'm saying they're the same is because your whole life is in service of self-realization and self-actualization. If you use the metaphor of a sunflower, if I plant the seed, it grows into the flower. This is inevitable. If I give it a consciousness, perhaps it has some greater freedom, volatility, energy efficiency, etc, but it becomes a sunflower no matter what it does, that tape runs its course. You are the same way and whether you get it or not, you will act yourself out as a human being.",
        "Capy": "I would just focus on the reality of whatever you're inquiring about, since that's the only thing relevant to any inquiry. The claim that you're making is that there is a thought or statement which describes you, or, is you. First figure out how you know that or what the experience of that is.\n\nBe completely honest. Stick to what is already the case or inherent to your experience. Look for what is unchanging in experience. Before you think about changing yourself or saving the world or whatever, first figure out what is actually real and true and doesn't change.\n\nGet rid of all that is transient, and stay with what is present, intrinsic, and essential.",
        "holos": "Self inquiry itself is just going into the cave to inspect beliefs held. It's inspecting what's already there. Inquiry is not setting out a solution or improving, it's about questioning. Questions don't have negativity, the negativity comes from beliefs that we hold about ourselves.\n\nJust think about yourself for a second, don't turn away but face what you think you are. The point of inspecting your beliefs is just to see them, judgement is not necessary or required in just looking.\n\nAdvice is on the basis of what you \"should\" do and there is nothing that you \"should\" do because there is nothing necessary to get to a destination. You're already here.",
        "will": "There really isn't any technique. I can't help you with any how or any method because something that is true doesn't require any method for it to be true. I can't tell you how to look as that's just checking the content of your experience which doesn't need a method. Your experience is right there.\n\nNo one here can teach you about yourself. It's literally nothing to do with me, you have the capacity you just need to be honest with yourself. No need to overcomplicate things, it can be understood in a flash.\n\nI just think it's not something you can rush or take shortcuts with, be patient and slow. It is so incredibly simple and I can't stress enough how there isn't any need to rush or have big leaps of logic. Just take your time, there literally isn't anything else more worth while than figuring it out.",
        "Gabriel": "Relax and enjoy the present moment.\n\nJust allow yourself to be aware of the present moment, and give yourself the freedom to think about whatever you want. You don't need to focus on anything specific, just allow your focus to explore your awareness, whether thought or other feeling. Let yourself experience what it is like to be yourself - notice the comfortableness of your chair, the cool sensation of drinking water. Notice the different things you experience every day, but take for granted."
      }
    },
    {
      "id": "do-you-experience-grief-or-loss",
      "question": "Do you experience grief or loss?",
      "answers": {
        "Ender": "I definitely don't feel related to past actions. Present actions are sort of just playing themselves out.\n\nIt's like being stressed about something looming in the future constantly and then realizing it's not real so there's no reason to worry at all. And then the mode of thinking changes completely to thoughts becoming completely harmless. The best metaphorical description I could think of for that experience is the thoughts getting shorter, like they were no longer tall enough to reach me and bother me anymore.",
        "Jamie": "It's analogous in my own experience to how I used to and presumably most people would experience a dream. In a dream something really bad might happen, you get really scared, then you wake up and in 5 seconds you're completely fine. Why don't you have lingering trauma? Because you intuit \"that wasn't real, it was a dream\" and your brain automatically discounts it. If you say \"I am going through a breakup, and the image of this person in my mind hurts\" it is different for me (now) because there is not the \"added on\" part of hurt. Without an imagined personal identity that was hurt by another person's death, there is no change in your identity or imagination of your life, just an immediate change to what is happening in front of you. You can love someone in their last moments, then they are gone, and there is no sadness, just an absence of love.",
        "Capy": "Without thought, there is \"you\" which is experiencing something that can never experience loss.\n\nIf you're worried about tomorrow, yet you're not experiencing it, then any emotion or whatever else isn't caused by tomorrow, it's how the thought presently feels. The explaining of emotion as if it is coming from tomorrow or somewhere other than \"here\" is what keeps it looping.",
        "holos": "Let's say their bodies stop operating, then what? The only semblance of that life is still your thought of it now. You don't have access to your body's death since it's a thought imagined into the future. Regardless of whether they're still here or not you can only tell since there is a difference between a perception of their life and death.\n\nThere is no lack that exists or has ever existed. There is only an imagined separation between your current state of lacking and the desired state of completion.",
        "will": "I am grieving the loss of my partner, she meant everything to me and now she is gone. The genuine fact of my everyday life is I am having an utterly appalling time. And so I feel that I desperately need to escape myself, I need to become someone who is stronger or at peace.\n\nHowever there's conflict here, in that my grief is completely here. It is an irrevocable fact. Yet I am trying to become something other than my grief. How am I to understand myself when I'm trying to become something else? I'm not treating myself with compassion at all if I am trying to become anything.\n\nDeath isn't a concept nor is it something far away from now, there is always the ending of something happening right now."
      }
    },
    {
      "id": "what-is-the-ego",
      "question": "What is the ego and how does it relate to love?",
      "answers": {
        "Ender": "I found that \"love\" to a non-dualist is completely different from most people because what most people think is \"love\" is actually just ego in disguise.\n\nThe self-image is a program that is constantly trying to update the model of \"me\" in response to new information. The mind is simply reacting to the present stimuli and attempts to make a conclusion about \"me.\" Strong self-image related emotional reactions occur when the present stimuli either strongly contradicts or confirms the current model of \"me.\"\n\nI don't know why the self-image exists. Probably something to do with trying to form a coherent story through thought, even though trying to understand yourself through thought isn't possible in the first place. I personally have become convinced that the only meaningful action that exists is in service of alleviating the suffering of others. That applies to everyone regardless of self-realization.",
        "Jamie": "The ultra-nutshell version is that your natural mode of operation is wanting to love. This is the complete fulfilment of intelligent function in relationship to your life as it plays out in front of you. Self-image or our ego is a secondary carbon copy of this literal brain function that is the belief we are an actual \"other\" person in thought. This causes a secondary version of the previous emotion set that demands we create conditions under which other people love us. This is an introduction to self-inquiry, which is the question: \"if you can see this, then how do you know other people love you other than your own invented standard?\"",
        "Capy": "The self-image is always a recursion. There isn't someone separate from self-image affected by self-image which denotes someone that has \"my self-image\". What you think you are is self-image. When you say \"it's because of my self-image\", whose self-image are you talking about, which is separate from the self-image? That entire thought is self-image, because it refers back to your previous thought which is also self-image.\n\nSelf-image recursively creates a model of a perceiver inside the whiteboard or blueprint which is being perceived, which is unnecessary.",
        "holos": "You say you are \"awareness\" well then that \"awareness\" becomes an object to identify with. Any form of thought creates an inherent division and can experience be divided? Only through thought can division take place, but thinking does not require division, seeing does not require division and so forth.\n\nIn what way can there be an other? There can only be an other if you believe you are something such as connected to a body, mind, soul etc. There has never been an other, only the one which illuminates.",
        "will": "It isn't a bad thing to have an identity. But we just misinterpret the signal of thought which makes it seem terrible. The word 'me' is just representing something else, but we mistake the symbol for the real thing and are threatened when the thought of 'me' may not endure.\n\nThe need to be loved by others stems from an insufficiency in our own experience. The need to be desirable is what is causing the suffering. Ultimately no amount of external love will ever make the shift.\n\nAll the idealisation of relationships is just pushing away the present moment, and the love you do have access to. Being in love with an idea is just so damn hollow."
      }
    },
    {
      "id": "what-is-the-root-of-discontent",
      "question": "What is the root of discontent?",
      "answers": {
        "Ender": "Comparison only feels negative if you believe you can compare yourself to something. Anxiety is believing that something you identify with is threatened. Things you believe are unrelated to yourself never cause anxiety.\n\nWe are disappointed because we make comparisons. However, the choice of what comparison we decide to make somehow manages to be, more often than not, comparing what you believe your present circumstance to be with an imaginary way things could have gone better. In that moment the disappointment comes from the comparison and not from the literal direct experience of what happened. Ultimately all psychological suffering is comparison that gets dressed in fancier and fancier clothes.\n\nThe mind makes selective comparisons that often lead to suffering. Why does someone with body dysmorphia compare their body to someone who they believe has an attractive body far more than they compare their body to unattractive bodies? Paying attention to those comparisons and making different strategic comparisons can alleviate some, if not all of the suffering from comparison.",
        "Jamie": "It's a relationship with your past, present and future. You feel discontent in the present because there is a previous \"wrong\" or \"insufficiency\" you want to correct, improve or achieve. This creates a present demand in the brain to acquire, achieve, or overcome something.",
        "Capy": "Past and future is equivalent to worry. Worrying about the past and future is the same as believing in past and future. It's the same idea/thought/belief.\n\nOnly what is in past and future can worry about past and future. Why worry about thinking presently?\n\nThe belief that knowledge comes from past and future means you will search the past and future for information about yourself and that information you pull out about yourself is self-image.",
        "holos": "We are not looking for solution, by seeking a solution you're just painting an image of how you fall short and there is something to solve. By creating an image of solution you are creating deficiency through thought, but what is there to solve in the first place? By thinking of a solution you're just creating an imaginary solution to an imaginary problem.\n\nThe desire itself creates a lack which never existed in the first place. \"I need to feel good\", but good is already the base state you just want to escape feeling bad.",
        "will": "Any problem we have is related to expectations we have about ourselves and our own circumstance. The content of the sense of self is entirely constructed by our own ambitions, regrets, hurts and prides. If I suffer because I don't have as much money as I thought I would by a certain age, my expected outcome/ambition IS what 'myself' is made up of. I am not a distinct entity looking at this challenge of suffering, the sense of 'me' is intrinsic to the challenge. There is no challenge if my mind is clean of comparison.\n\nI am in so much agony because I must become so many things and it's impossible. Escape is becoming. This is what we do to ourselves, this is the fact.\n\nSo when we are aware of this consciousness, which is one made up of misery and constantly pushing against what is, we are no longer contributing to it."
      }
    },
    {
      "id": "is-ambition-bad",
      "question": "Is ambition bad?",
      "answers": {
        "Ender": "Self-realization is not the end of seeking knowledge. Self-realization is the end of attempting to acquire more knowledge for the sake of self-understanding. Seeking knowledge does not cease, just the belief that more knowledge will lead to more self-understanding.\n\nActions can still be taken to fulfill goals, but they are without any emotional significance. Nothing is really seen as a \"problem\", there are just circumstances. \"Problem\" is a label you add yourself. There wasn't a point where I had a goal in mind that I was gauging my success based on. It was just curiosity and no sense of success or failure so it wasn't frustrating.\n\nIn my personal experience, SR mostly did not affect my discipline. The nature of decisions themselves don't change from SR, but the motivations for why an option is chosen do change since the self-image is no longer affecting the decisions.",
        "Jamie": "The beliefs an individual has don't make everything make sense, they try to make sense of things through forcing a relationship of \"I am not sufficient\" ----> \"my current experience\" -----> \"rectifying insufficiency with perfect solution\". An example with your mention of the need to be successful is not that there's anything wrong with being an athlete, or being a movie star, or being a successful business person, the only problem is the ongoing algorithmic brain function that operates constantly demanding it, which is ambition, anxiety, restlessness, and anger at your own failure to live up to your \"imagined\" solution to the problem. The problem in this case being not that you couldn't make more money or be in better shape and that would be cool, it is the artificial demand that has been invented by the brain that believes it is \"fixing\" something in time when it isn't.",
        "Capy": "You don't lose ambition or desire per se, but all that you desire is just exactly what is occurring right now, because that is the only thing you CAN desire.\n\nExistentially, you can't desire any THING, because to desire something it must not exist in your experience first. So, literally, by definition, all desires are about something that does not exist in your experience. Everything that can be sought exists now. The only thing to be sought is purely just the action of seeking something, which is of course redundant to seek.\n\nThis is not to say that desire is bad or redundant, but desire itself is recontextualized into something like a pleasant thought form that you are deciding to create. It can become unpleasant when you mix it with a belief that you are located inside that desire.",
        "holos": "There is no drive to get better, simply the drive to do what is desired to be done. When there is desire to do a task, involving comparison to a \"previous you\" that did that same thing doesn't need to be involved.\n\nA fools errand would be to try to get rid of desiring as that would just be desiring to not have desires. But it must be assessed who are you that is being judged at all? Who said life is for anyone? Life just is and you just are.",
        "will": "I genuinely want to understand what is meant by improving myself? I don't care about improving my character because the whole basis of wanting to improve is founded on a misunderstanding.\n\nGrowth occurs naturally, everyday I'm learning and developing my skills so it's not really something I'm super concerned with bringing into fruition, it's already happening. I love growth, but there's no need for me to worry about whether it'll happen or not. I just go about my daily tasks and it is a natural part of that.\n\nThe joy of singing or playing drums has nothing to do with dominating another. This goes for anyone with ambition related to a discipline they have. Is it more important to me that I be better at others or to never harm others?"
      }
    },
    {
      "id": "anger-vs-frustration",
      "question": "What is the difference between anger and frustration?",
      "answers": {
        "Ender": "Anger: the belief that something has wronged you. Frustration: the belief that efforts are not leading to the intended results. Frustration is not necessarily tied to self-image.\n\nAnnoyance is the belief that one's current experience could extremely conceivably be better if some process was more efficient, which is necessarily tied to self-image since it stems from a failure to recognize the oneness of experience.\n\nI think in general whether something counts as an emotion depends on whether it serves to bring focus on performing effectively right now, which makes it not an emotion, or whether it forces the mind into thought spirals, which makes it an emotion.",
        "Jamie": "I think the best analogy is that I don't ever experience anger related to ideas, but you do still experience frustration, which is a strong energetic demand from your brain to try to communicate an important idea you don't think another person is understanding. In the sense that if you are angry it is because you think another person is saying/doing something harmful, whereas if you are frustrated there is no emotion, but a forceful effort of communication to express the other person is not understanding you. Being angry feels like anger obviously, but being frustrated exclusively is just heightened energy towards a particular focus, like a dog who wants to get out of the car so it can run around.",
        "Capy": "It doesn't look like he is angry at anyone specifically, just \"people who ask that all the time\", and he basically goes back to calm right when he's done, so just looks like genuine frustration or something, not a grudge.\n\nAnger probably means you feel like you or someone else is in danger and it is the desire to neutralize whatever you believe to be the cause of that danger. Frustration is the desire to operate in two ways, because it is impossible.",
        "holos": "Anger can only be associated with someone or something attacking \"you\" or \"your ideals\" but these always start with \"you\".\n\nFrustration arises because you're protecting something which is not necessary thus causing a larger expenditure of energy than is required. This largely gets self regulated when communication aligns with what is thought and felt.",
        "will": "I nearly got angry the other day, but it didn't arise. My entire body was almost rumbling.\n\nAnger is the result of an expectation not being met. We have an image of how things should go, and when reality contradicts the image, we lash out. But after the frustration fades you still can experience love in relationship with them.\n\nI had a similar experience in which I was trying to explain my point of view and was written off for some petty reason, I felt frustrated. If people aren't trying to understand where you're coming from that can lead to frustration."
      }
    },
    {
      "id": "present-moment",
      "question": "What does it mean that everything is happening now?",
      "answers": {
        "Ender": "The time realization is self-realization. The self-image is fundamentally composed of memories and nothing else. Realizing one has no personal relationship with memories is the same thing as realizing it isn't possible for a self-image to be oneself, is the same thing as realizing it isn't possible to think about yourself, is the same thing as self-realization. What was originally mistaken to be \"me\" is just another generic collection of thoughts and memories.\n\nYour actual relationship with time is absolutely non-existent. The true nature of your experience is absolutely instantaneous with no duration, but there are thoughts that can very convincingly masquerade as an experience of the past or as duration. You have suddenly been placed in this body with all of its functions and memories right now.\n\nIt seems quite reasonable that the past exists. Right now I remember there being an experience of breakfast this morning. I can't be sure that this memory actually refers to something that really happened. I'm not saying time doesn't exist. I'm saying you don't experience it. The actions happening over time is totally a thing but you have no experience of the duration, only the now.",
        "Jamie": "My understanding, and to whatever extent experience, is that in a strange and very unintuitive way everything feeds into now. The point of the phrase and what it represents conceptually is there is nothing else to feed into now. Ten years ago it was experienced by you as \"Now\". Right now you are experiencing \"Now\". In ten years you will experience that moment in time as \"Now\". You cannot experience \"everything feeds into now\" there is no other thing than now. The one and only thing in existence to you is present experience.",
        "Capy": "Thoughts appear in our experience similar to a stage with many props and actors. Everything has to occur together on the same singular stage, which is now. If it's not happening together, it is absent, and so it isn't there at all.\n\nWhenever you're thinking, you can imagine it as looking at a whiteboard in the present moment that is describing things. The world or reality or \"now\" gets immersed in its own appearance of divisions, but it is all appearing on the \"same stage\" of now. Like a whiteboard which says \"past and future\" requires both words \"past\" and \"future\" to appear together on the same singular whiteboard.\n\nAlso pay attention to the chronological limitation of reality, which is that everything must occur now. \"Past\" and \"future\" are like scaffoldings which always must be built on top of now.",
        "holos": "In actuality the present encapsulates everything. The \"future\" is just an isolation of some present thought. We say it doesn't exist because you cannot have two separate nows. There is only one now which captures it all.\n\nWhat is now is permanent and that there is nothing apart from right now. This very moment is everything that has been and everything that will ever be. There has never been a moment that is not now. 15 years ago it was now, 15 years in the future it will be now.",
        "will": "In SR there is the insight that thought can only ever occur right now, and there's no possibility of thinking in the future. The takeaway message is your capacity to think only exists now, if you are getting sensory input of 'me in the past' or 'me in the future' examine why you believe this.\n\nAll psychological suffering requires 'I'. And our effort to end the suffering means we escape from ourselves. So the escape from ourselves requires we have time, i.e. 'in the future I can be less anxious'. But the image of 'the future' is occurring currently.\n\nYou already are living. You already are breathing, and seeing and hearing. So perceiving this fact of agony doesn't require effort at all. It may be deeply uncomfortable, but that doesn't mean effort."
      }
    }
  ]
}